
[
  {
    "id": "flujo-1",
    "displayId": 1,
    "fileName": "nostr-reporting.json",
    "flowName": "#锔NOSTR #DAMUS AI POWERED REPORTING + GMAIL + TELEGRAM",
    "shortDescription": "Este flujo automatiza la recopilaci贸n de hilos de Nostr con el hashtag #damus, emplea IA (Google Gemini) para extraer y analizar temas, y luego genera informes estructurados que se env铆an por correo electr贸nico a trav茅s de Gmail y como mensajes a trav茅s de Telegram.",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [],
    "mainFunction": "Generar y distribuir informes detallados sobre temas y conversaciones de la red social Nostr (espec铆ficamente #damus) utilizando capacidades de IA para el an谩lisis de texto.",
    "automationDestinations": [
      "Gmail",
      "Telegram"
    ],
    "dataOrigins": [
      "Nostr"
    ],
    "keyNodes": [
      "Nostr Read #damus",
      "ChainLlm",
      "lmChatGoogleGemini",
      "Markdown",
      "Gmail",
      "Telegram",
      "Aggregate",
      "Merge"
    ],
    "complexity": "Complejo",
    "useCaseExamples": [
      "Una startup que desarrolla una aplicaci贸n social descentralizada monitorea en tiempo real el sentimiento y las tendencias emergentes en Nostr relacionadas con #damus para informar el desarrollo de su propio producto. El objetivo es identificar los 3 temas m谩s discutidos (positivos o negativos) sobre #damus cada semana para priorizar mejoras en su aplicaci贸n, apuntando a un aumento del 15% en la satisfacci贸n del usuario en el pr贸ximo trimestre. Reciben informes semanales los lunes por la ma帽ana a trav茅s de Telegram y Gmail.",
      "Un gestor de comunidad para una plataforma Web3 utiliza el flujo de trabajo para detectar menciones cr铆ticas o feedback negativo sobre #damus en Nostr, permitiendo una respuesta proactiva. Esto busca reducir el tiempo de respuesta a problemas cr铆ticos de la comunidad en un 20% al identificar y abordar 5 problemas potenciales en un plazo de 24 horas cada semana. Reciben alertas diarias por Telegram sobre temas de alta prioridad y un resumen semanal por Gmail.",
      "Un periodista especializado en tecnolog铆as descentralizadas busca identificar r谩pidamente temas candentes y narrativas emergentes sobre #damus en Nostr para generar ideas de contenido original y oportuno. Su meta es generar al menos 2 ideas de art铆culos o informes de noticias por semana basadas en los an谩lisis de IA, resultando en un aumento del 10% en el engagement de la audiencia en los pr贸ximos dos meses. Reciben un informe quincenal con los temas principales y sus an谩lisis un viernes por la tarde, para la planificaci贸n de la siguiente semana.",
      "Un equipo de desarrollo de un cliente de Nostr recopila autom谩ticamente sugerencias de funciones y reportes de errores relacionados con #damus publicados por los usuarios en la red. El equipo busca identificar 3 nuevas solicitudes de funciones o reportes de errores recurrentes al mes, integr谩ndolos en el backlog del producto en un plazo de 30 d铆as, mejorando la hoja de ruta del producto en un 15% para el final del trimestre. Reciben un informe mensual consolidado a principios de cada mes v铆a Gmail y un resumen por Telegram sobre feedback cr铆tico en tiempo real.",
      "Un investigador en sociolog铆a digital estudia la evoluci贸n del discurso y la polarizaci贸n en torno a #damus en Nostr para un estudio acad茅mico sobre la formaci贸n de comunidades en redes descentralizadas. Se propone recopilar y analizar 1000 hilos por mes, identificando al menos 2 cambios significativos en el sentimiento o los temas dominantes cada trimestre, contribuyendo a la publicaci贸n de un art铆culo de investigaci贸n en 12 meses. Reciben informes trimestrales detallados por Gmail que resuman las tendencias y el sentimiento, y alertas mensuales de Telegram sobre anomal铆as detectadas."
    ],
    "similarities": [
      {
        "workflowId": "flujo-15",
        "workflowName": "#15 - NEW TWEETS",
        "score": 0.75,
        "reason": "Ambos flujos monitorean una red social (Nostr y Twitter) para recopilar datos, aunque usan diferentes destinos y m茅todos de procesamiento."
      }
    ]
  },
  {
    "id": "flujo-2",
    "displayId": 2,
    "fileName": "gumroad-trigger.json",
    "flowName": "GUMROAD SALE TRIGGER",
    "shortDescription": "Este flujo se activa con cada nueva venta en Gumroad. Autom谩ticamente a帽ade al comprador como suscriptor en MailerLite, lo asigna a un grupo espec铆fico para campa帽as de email post-venta y registra los detalles de la venta (fecha, email, pa铆s, producto) en una hoja de Google Sheets que funciona como CRM.",
    "mainArea": "Automatizaci贸n de Marketing y Ventas",
    "secondaryAreas": [],
    "mainFunction": "Automatizar la gesti贸n de nuevos clientes y la comunicaci贸n post-venta despu茅s de una venta en Gumroad, registrando la informaci贸n en un CRM y a帽adi茅ndolos a una lista de correo.",
    "automationDestinations": [
      "Gumroad",
      "MailerLite",
      "Google Sheets"
    ],
    "dataOrigins": [
      "Gumroad"
    ],
    "keyNodes": [
      "Gumroad Trigger",
      "MailerLite",
      "HTTP Request",
      "Google Sheets"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "Automatizaci贸n de Onboarding para Cursos Digitales: Un creador de cursos online utiliza este flujo para automatizar el onboarding de nuevos estudiantes. Cada vez que se vende un curso en Gumroad, el estudiante se a帽ade autom谩ticamente a MailerLite, se le asigna a un grupo espec铆fico del curso (ej. \"Curso Avanzado de Fotograf铆a\") para recibir emails de bienvenida, acceso a recursos y actualizaciones relevantes. Los detalles de la venta se registran en Google Sheets para seguimiento. Objetivo SMART: Asegurar que el 100% de los nuevos estudiantes reciban la secuencia de bienvenida y acceso a recursos en las primeras 24 horas despu茅s de la compra, mejorando la tasa de finalizaci贸n del curso en un 15% en los pr贸ximos tres meses.",
      "Gesti贸n de Membres铆as y Contenido Exclusivo: Una comunidad premium o un club de suscripci贸n que vende acceso a contenido exclusivo a trav茅s de Gumroad. Este flujo garantiza que cada nuevo miembro se suscriba instant谩neamente a la lista de correo de MailerLite \"Miembros VIP\", reciba autom谩ticamente un email con instrucciones de acceso al contenido exclusivo y que su membres铆a se registre en Google Sheets para renovaciones y an谩lisis. Objetivo SMART: Mantener un 99% de precisi贸n en la incorporaci贸n de nuevos miembros a la lista exclusiva en MailerLite y reducir en un 80% el tiempo de gesti贸n manual de nuevas altas de membres铆a para el final del pr贸ximo trimestre.",
      "Segmentaci贸n para Marketing de Productos Complementarios: Una tienda de productos digitales (ej. plantillas, presets, paquetes de iconos) quiere segmentar a sus clientes para futuras campa帽as de cross-selling. Cada venta en Gumroad a帽ade al comprador a MailerLite, lo categoriza por el producto adquirido (ej. \"Compradores de Plantillas de Social Media\") y registra todos los detalles en Google Sheets. Objetivo SMART: Lanzar tres campa帽as de email de cross-selling dirigidas a segmentos espec铆ficos de clientes dentro de los pr贸ximos seis meses, con el objetivo de lograr una tasa de conversi贸n del 5% en la venta de productos complementarios.",
      "Optimizaci贸n de Contabilidad y Reportes Fiscales: Un freelancer o peque帽a empresa que vende productos digitales y necesita una forma eficiente de registrar sus ingresos para la contabilidad y los impuestos. El flujo registra autom谩ticamente cada venta de Gumroad en una hoja de Google Sheets, incluyendo fecha y pa铆s, lo que facilita la preparaci贸n de informes de ingresos y la gesti贸n de obligaciones fiscales (como el IVA seg煤n el pa铆s del comprador). Objetivo SMART: Reducir el tiempo dedicado a la preparaci贸n de informes de ventas mensuales en un 70% y asegurar la precisi贸n del 100% de los datos de ventas para los cierres fiscales trimestrales, comenzando desde el pr贸ximo mes.",
      "An谩lisis Demogr谩fico y Estrategia de Expansi贸n Geogr谩fica: Un creador que opera a nivel global quiere identificar sus mercados m谩s fuertes y d茅biles para enfocar sus esfuerzos de marketing o traducir sus productos. El flujo registra autom谩ticamente el pa铆s de cada comprador en Google Sheets y los a帽ade a MailerLite. Objetivo SMART: Analizar la distribuci贸n geogr谩fica de las ventas registradas en Google Sheets al final de cada trimestre para identificar los tres pa铆ses con mayor potencial de crecimiento, y lanzar una campa帽a de marketing dirigida a uno de esos mercados en los siguientes dos meses."
    ],
    "similarities": [
      {
        "workflowId": "flujo-18",
        "workflowName": "#18 - ON NEW STRIPE INVOICE PAYMENT UPDATE HUBSPOT AND NOTIFY THE TEAM IN SLACK",
        "score": 0.8,
        "reason": "Ambos flujos se activan por un evento de pago (Gumroad y Stripe) y realizan acciones de automatizaci贸n de ventas/clientes, como actualizar un CRM o registrar datos."
      }
    ]
  },
  {
    "id": "flujo-3",
    "displayId": 3,
    "fileName": "chatgpt-image.json",
    "flowName": "TEMPLATE-DEMO-CHATGPT-IMAGE-1-WITH-DRIVE-AND-SHEET COPY",
    "shortDescription": "Este flujo genera im谩genes usando ChatGPT a partir de un mensaje de chat, guarda las im谩genes generadas en Google Drive y registra los detalles de la imagen y los costos de uso en Google Sheets.",
    "mainArea": "Generaci贸n de Contenido Digital",
    "secondaryAreas": [],
    "mainFunction": "Generar im谩genes a partir de descripciones de texto mediante IA, almacenarlas en la nube y registrar su uso y costos.",
    "automationDestinations": [
      "OpenAI (ChatGPT API)",
      "Google Drive",
      "Google Sheets"
    ],
    "dataOrigins": [
      "Chat Trigger"
    ],
    "keyNodes": [
      "n8n-nodes-base.httpRequest",
      "n8n-nodes-base.googleDrive",
      "n8n-nodes-base.googleSheets",
      "@n8n/n8n-nodes-langchain.chatTrigger",
      "n8n-nodes-base.convertToFile",
      "n8n-nodes-base.splitOut",
      "n8n-nodes-base.splitInBatches"
    ],
    "complexity": "Complejo",
    "useCaseExamples": [
      "Marketing Digital para PYMES: Una peque帽a empresa necesita generar im谩genes atractivas y variadas para sus publicaciones diarias en redes sociales sin un dise帽ador gr谩fico a tiempo completo. El flujo generar谩 5 im谩genes 煤nicas cada d铆a, bas谩ndose en el tema diario de la campa帽a, guard谩ndolas en una carpeta espec铆fica de Google Drive y registrando el costo de cada generaci贸n. Esto reducir谩 el tiempo de creaci贸n de contenido visual en un 70% y aumentar谩 la interacci贸n en redes sociales en un 15% en los pr贸ximos 30 d铆as, con un costo m谩ximo de $50 USD mensuales por im谩genes.",
      "E-commerce para Tienda de Ropa: Una tienda online necesita im谩genes de \"estilo de vida\" para sus nuevos productos de ropa, mostrando las prendas en diferentes escenarios, lo cual es costoso y lento con sesiones de fotos tradicionales. Para cada nuevo producto lanzado semanalmente, el flujo generar谩 3 im谩genes de estilo de vida diversas a partir de descripciones de texto, las almacenar谩 en Google Drive y registrar谩 los detalles de la imagen y el uso de la API en Google Sheets para control presupuestario. El objetivo es generar un total de 30 im谩genes de estilo de vida para 10 nuevos productos en un mes, reduciendo los costos de fotograf铆a en un 80% y manteniendo la carga de im谩genes actualizada en la web en menos de 24 horas tras el lanzamiento del producto.",
      "Blog de Recetas de Cocina: Un bloguero de cocina necesita im谩genes atractivas y originales para ilustrar cada una de sus nuevas recetas semanales, pero no siempre tiene tiempo o recursos para fotografiar cada plato. Al publicar cada una de las 4 nuevas recetas mensuales, el flujo generar谩 autom谩ticamente una imagen principal y dos im谩genes de detalle para cada receta, bas谩ndose en la descripci贸n del plato, las subir谩 a Google Drive y registrar谩 los datos de generaci贸n y costos en una hoja de c谩lculo. Esto asegurar谩 que cada una de las 4 recetas mensuales tenga 3 im谩genes generadas en un plazo de 6 horas desde la redacci贸n, con un objetivo de aumentar las visitas a las publicaciones en un 10% trimestral, verificando los costos mensuales.",
      "Generaci贸n de Material Educativo: Un instructor de cursos online requiere ilustraciones conceptuales personalizadas y diagramas para sus m贸dulos de formaci贸n, pero carece de habilidades de dise帽o gr谩fico. Para cada uno de los 5 nuevos m贸dulos del curso a desarrollar en el pr贸ximo bimestre, el instructor usar谩 el flujo para generar 4 ilustraciones y diagramas explicativos complejos a partir de descripciones textuales. Estas im谩genes se guardar谩n en Google Drive y los costos se detallar谩n en Google Sheets. Esto permitir谩 completar la creaci贸n de 20 ilustraciones y diagramas para los nuevos m贸dulos en 8 semanas, garantizando la claridad visual y manteniendo el costo total por m贸dulo por debajo de los $10 USD.",
      "Inmobiliaria para Visitas Virtuales: Una agencia inmobiliaria necesita mostrar el potencial de las propiedades vac铆as o con mobiliario anticuado mediante \"home staging\" virtual, lo cual es muy caro y lento de realizar manualmente. Para cada una de las 3 propiedades nuevas que se listan semanalmente, el flujo generar谩 4 im谩genes de cada estancia con diferentes estilos de decoraci贸n y mobiliario, guard谩ndolas en una carpeta de Google Drive asociada a la propiedad y registrando los costos. Esto permitir谩 generar 12 im谩genes de \"home staging\" virtual para 3 propiedades en un plazo de 24 horas despu茅s de la visita inicial, con el fin de aumentar los contactos de posibles compradores en un 20% en el primer mes de publicaci贸n y reducir los gastos de fotograf铆a y staging en un 50% en el pr贸ximo semestre."
    ],
    "similarities": [
      {
        "workflowId": "flujo-7",
        "workflowName": "#7 - AUTOMATED SOCIAL MEDIA CONTENT PUBLISHING FACTORY + SYSTEM PROMPT COMPOSITION",
        "score": 0.85,
        "reason": "Ambos flujos utilizan IA para generar contenido visual. Este flujo se enfoca en im谩genes con ChatGPT y almacenamiento, mientras que el flujo 7 lo integra en un sistema m谩s amplio de publicaci贸n en redes sociales."
      }
    ]
  },
  {
    "id": "flujo-4",
    "displayId": 4,
    "fileName": "ticket-alerts.json",
    "flowName": "NEW TICKET ALERTS TO TEAMS",
    "shortDescription": "Este flujo monitorea nuevos tickets en ConnectWise, filtra los ya procesados, agrupa los tickets por empresa y los notifica al equipo de Dispatch a trav茅s de Microsoft Teams, registrando cada notificaci贸n en Redis.",
    "mainArea": "Servicio al Cliente",
    "secondaryAreas": [],
    "mainFunction": "Notificaci贸n de nuevos tickets de soporte",
    "automationDestinations": [
      "ConnectWise",
      "Redis",
      "Microsoft Teams"
    ],
    "dataOrigins": [
      "ConnectWise"
    ],
    "keyNodes": [
      "Schedule Trigger",
      "HTTP Request",
      "Redis",
      "Code",
      "Merge",
      "Microsoft Teams"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "Una empresa de servicios gestionados (MSP) implementar谩 el flujo para acelerar el tiempo de respuesta inicial a los problemas cr铆ticos de sus clientes. El objetivo es reducir en un 25% el tiempo promedio desde la creaci贸n de un ticket de alta prioridad en ConnectWise hasta su notificaci贸n al equipo de Dispatch a trav茅s de Microsoft Teams en el pr贸ximo trimestre, garantizando una atenci贸n m谩s r谩pida a los incidentes que afectan el servicio del cliente.",
      "El departamento de TI de una gran corporaci贸n utilizar谩 el flujo para optimizar la gesti贸n de solicitudes de soporte interno de sus diversas unidades de negocio. El flujo asegurar谩 que el 98% de los nuevos tickets de soporte t茅cnico creados en ConnectWise sean notificados al equipo de soporte de TI en Microsoft Teams en menos de 10 minutos, permitiendo una asignaci贸n y resoluci贸n m谩s 谩gil de los problemas internos a partir del pr贸ximo mes.",
      "Una empresa de software como servicio (SaaS) emplear谩 el flujo para mejorar la visibilidad y el tiempo de respuesta a informes de errores cr铆ticos de sus clientes. El flujo garantizar谩 que todos los tickets de ConnectWise marcados como 'error cr铆tico' o 'ca铆da de servicio' sean notificados inmediatamente al equipo de desarrollo y al equipo de soporte de Nivel 2 en Microsoft Teams, con el objetivo de iniciar la investigaci贸n en un plazo de 30 minutos a partir de su detecci贸n, comenzando esta semana.",
      "Una empresa de gesti贸n de propiedades utilizar谩 el flujo para coordinar eficazmente las solicitudes de mantenimiento y las incidencias en sus diversas ubicaciones. Se pretende que el 100% de los tickets de mantenimiento urgente (ej. fuga de agua, falla el茅ctrica) generados en ConnectWise para cualquiera de sus propiedades sean notificados al equipo de operaciones en sitio v铆a Microsoft Teams en un plazo de 5 minutos, con un registro de cada notificaci贸n en Redis, para finales de este mes.",
      "El equipo de 茅xito del cliente de una organizaci贸n de servicios tecnol贸gicos implementar谩 este flujo para identificar proactivamente a clientes que puedan estar experimentando problemas recurrentes. El flujo notificar谩 al equipo de 茅xito del cliente en Microsoft Teams cada vez que una empresa cliente genere tres o m谩s tickets nuevos en ConnectWise dentro de un periodo de 24 horas, permitiendo al equipo contactar al cliente para ofrecer apoyo adicional en un plazo de 48 horas tras la notificaci贸n, a partir del pr贸ximo trimestre."
    ],
    "similarities": []
  },
  {
    "id": "flujo-5",
    "displayId": 5,
    "fileName": "calendar-sync.json",
    "flowName": "GOOGLE CALENDAR TO OUTLOOK",
    "shortDescription": "Este flujo sincroniza eventos creados y cancelados en Google Calendar con Microsoft Outlook, creando nuevos eventos y eliminando los cancelados, y enviando una notificaci贸n por correo electr贸nico para las cancelaciones.",
    "mainArea": "Productividad",
    "secondaryAreas": [],
    "mainFunction": "Sincronizaci贸n de eventos de calendario entre Google Calendar y Outlook",
    "automationDestinations": [
      "Google Calendar",
      "Microsoft Outlook"
    ],
    "dataOrigins": [
      "Google Calendar"
    ],
    "keyNodes": [
      "Google Calendar Trigger",
      "Microsoft Outlook",
      "Merge"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "Un consultor independiente que gestiona m煤ltiples clientes utiliza Google Calendar para su planificaci贸n personal y profesional. Algunos clientes, sin embargo, programan reuniones a trav茅s de Outlook. El flujo de trabajo asegura que todas las reuniones creadas o canceladas en Google Calendar se sincronicen autom谩ticamente con su calendario de Outlook, eliminando la necesidad de introducir manualmente los eventos y enviando una notificaci贸n instant谩nea si un cliente cancela una cita, lo que permite al consultor reorganizar su tiempo eficientemente y reducir en un 80% el tiempo de gesti贸n de calendarios en el pr贸ximo mes.",
      "Un departamento de una universidad coordina horarios de clases y reuniones acad茅micas. Los profesores usan Google Calendar para sus horarios de oficina y seminarios, mientras que el personal administrativo utiliza Outlook para reuniones departamentales. El flujo de trabajo garantiza que todas las cancelaciones o nuevas programaciones de seminarios en Google Calendar se reflejen en los calendarios de Outlook del personal pertinente y que se env铆e una notificaci贸n por correo electr贸nico para las cancelaciones cr铆ticas, reduciendo en un 95% los conflictos de programaci贸n antes del pr贸ximo semestre acad茅mico.",
      "Un equipo de ventas utiliza Google Calendar para programar demostraciones de productos y reuniones con clientes potenciales. Los clientes a menudo usan Outlook. El flujo de trabajo automatiza la sincronizaci贸n de las demostraciones programadas en Google Calendar al calendario de Outlook del representante de ventas. Si un cliente cancela una demostraci贸n a trav茅s de Google Calendar, el evento se elimina de Outlook y el representante recibe una alerta inmediata para contactar al cliente, lo que disminuye en un 15% las demostraciones perdidas y mejora la capacidad de respuesta del equipo en los pr贸ximos 30 d铆as.",
      "Una empresa de gesti贸n de eventos utiliza Google Calendar para coordinar la log铆stica interna, las reuniones con proveedores y los plazos del proyecto. Los clientes y algunos socios externos operan con Outlook. Este flujo de trabajo asegura que todas las cancelaciones o cambios en las reuniones internas de Google Calendar se repliquen en los calendarios de Outlook de los gerentes de proyecto y que se notifique por correo electr贸nico a los equipos afectados, eliminando el 90% de los errores de programaci贸n y mejorando la comunicaci贸n en tiempo real para los pr贸ximos 5 eventos principales.",
      "El departamento de RRHH de una gran corporaci贸n programa sesiones de incorporaci贸n, capacitaciones y entrevistas de salida utilizando Google Calendar. Algunos nuevos empleados o capacitadores externos utilizan Outlook. El flujo de trabajo sincroniza estos eventos clave, asegurando que las sesiones canceladas en Google Calendar se eliminen de Outlook y que los participantes reciban notificaciones por correo electr贸nico, reduciendo en un 75% las ausencias a eventos importantes de RRHH y acelerando las notificaciones de cambios en un 50% antes del final del a帽o fiscal."
    ],
    "similarities": []
  },
  {
    "id": "flujo-6",
    "displayId": 6,
    "fileName": "hn-scrape.json",
    "flowName": "HN WHO IS HIRING SCRAPE",
    "shortDescription": "Este flujo de trabajo raspa las publicaciones de 'Qui茅n est谩 contratando' de Hacker News, extrae y limpia los detalles de las ofertas de empleo utilizando IA, y los almacena en una base de datos Airtable.",
    "mainArea": "Recursos Humanos",
    "secondaryAreas": [],
    "mainFunction": "Extracci贸n, procesamiento y almacenamiento estructurado de ofertas de empleo",
    "automationDestinations": [
      "OpenAI",
      "Airtable"
    ],
    "dataOrigins": [
      "Hacker News (Algolia Search API, Firebase API)"
    ],
    "keyNodes": [
      "manualTrigger",
      "httpRequest",
      "Split Out",
      "Code",
      "OpenAI Chat Model",
      "Structured Output Parser",
      "Airtable"
    ],
    "complexity": "Complejo",
    "useCaseExamples": [
      "Un desarrollador de software busca activamente nuevas oportunidades: Utilizar el flujo de trabajo para automatizar la recopilaci贸n de ofertas de empleo de startups y empresas tecnol贸gicas, reduciendo el tiempo de b煤squeda manual en un 70% y aumentando el n煤mero de candidaturas enviadas en un 50% en los pr贸ximos 30 d铆as, enfoc谩ndose solo en puestos relevantes filtrados en Airtable.",
      "Una agencia de reclutamiento especializada en tecnolog铆a: Implementar el flujo de trabajo para identificar r谩pidamente empresas que est谩n contratando en el sector tecnol贸gico, reduciendo el tiempo dedicado a la prospecci贸n de clientes en un 60% y expandiendo la base de datos de contactos potenciales en un 25% para el final del pr贸ximo trimestre, lo que permite ofrecer talento de manera m谩s eficiente.",
      "Un analista de mercado que rastrea tendencias de contrataci贸n: Ejecutar el flujo de trabajo para recopilar datos estructurados sobre las demandas de habilidades y ubicaciones geogr谩ficas en el mercado laboral tecnol贸gico, generando informes mensuales con una precisi贸n del 90% sobre las 10 habilidades m谩s solicitadas y las 5 ciudades con mayor contrataci贸n durante los pr贸ximos seis meses para informar estrategias de talento.",
      "Un consultor freelancer de TI en busca de proyectos: Aprovechar el flujo de trabajo para encontrar oportunidades de proyectos a corto plazo o consultor铆as en startups que est谩n contratando, identificando al menos 5 oportunidades relevantes por mes y contactando a los posibles clientes en menos de 48 horas desde la publicaci贸n del puesto, con el objetivo de lograr una tasa de respuesta del 15% en los pr贸ximos 60 d铆as.",
      "Un departamento de servicios de carrera universitario: Emplear el flujo de trabajo para crear una base de datos actualizada de ofertas de empleo relevantes de startups y tecnolog铆a para sus estudiantes de 煤ltimo a帽o, proporcionando una lista semanal de al menos 20 ofertas filtradas, lo que se espera aumente en un 10% las solicitudes de empleo post-graduaci贸n de los estudiantes que usan el recurso durante el pr贸ximo a帽o acad茅mico."
    ],
    "similarities": [
      {
        "workflowId": "flujo-21",
        "workflowName": "#21 - PRIORIZACIN Y CATEGORIZACIN DE TAREAS DE TODOIST CON IA",
        "score": 0.65,
        "reason": "Ambos flujos utilizan IA (OpenAI) para procesar texto, aunque con fines muy diferentes: uno para extraer datos de ofertas de empleo y el otro para categorizar tareas."
      }
    ]
  },
  {
    "id": "flujo-7",
    "displayId": 7,
    "fileName": "social-media-factory.json",
    "flowName": "AUTOMATED SOCIAL MEDIA CONTENT PUBLISHING FACTORY + SYSTEM PROMPT COMPOSITION",
    "shortDescription": "Este flujo automatiza la generaci贸n y publicaci贸n de contenido de redes sociales en m煤ltiples plataformas, gestionando la creaci贸n de texto e im谩genes con IA, la aprobaci贸n del usuario y el archivo, todo ello configurable din谩micamente desde Google Docs.",
    "mainArea": "Marketing y Gesti贸n de Contenidos",
    "secondaryAreas": [],
    "mainFunction": "Automatizar la creaci贸n, aprobaci贸n y publicaci贸n de contenido optimizado para diversas plataformas de redes sociales, utilizando IA y configuraciones din谩micas.",
    "automationDestinations": [
      "X (Twitter)",
      "Instagram",
      "Facebook",
      "LinkedIn",
      "Threads",
      "YouTube Shorts",
      "Pollinations.ai",
      "imgbb.com",
      "Gmail",
      "Google Docs",
      "Google Drive",
      "Telegram",
      "SerpAPI"
    ],
    "dataOrigins": [
      "Mensajes de chat (interacci贸n del usuario)",
      "Google Docs (esquemas y prompts de IA)",
      "SerpAPI (datos de b煤squeda web)"
    ],
    "keyNodes": [
      "chatTrigger",
      "agent",
      "lmChatOpenAi",
      "googleDocs",
      "httpRequest",
      "switch",
      "twitter",
      "facebookGraphApi",
      "linkedIn",
      "gmail",
      "googleDrive",
      "code",
      "toolSerpApi"
    ],
    "complexity": "Complejo",
    "useCaseExamples": [
      "Una agencia de marketing automatiza la creaci贸n y publicaci贸n de contenido diario para sus clientes: La agencia configura los temas y el calendario en Google Docs. El flujo utiliza IA para generar borradores de texto e im谩genes, los env铆a para aprobaci贸n del cliente y, tras la aprobaci贸n, los publica en LinkedIn, Facebook e Instagram. Objetivo: Reducir el tiempo de creaci贸n y programaci贸n en un 50% para 3 clientes en los pr贸ximos 3 meses.",
      "Una tienda de e-commerce lanza productos r谩pidamente en redes sociales: Los gerentes de producto introducen los detalles de nuevos productos en un Google Doc. El flujo genera autom谩ticamente publicaciones de anuncio (texto e im谩genes IA) para Facebook, Instagram y Twitter. Un gerente de marketing revisa y aprueba el contenido para su publicaci贸n inmediata. Objetivo: Disminuir el tiempo de publicaci贸n de anuncios de nuevos productos de 3 d铆as a 1 d铆a por lanzamiento.",
      "Una instituci贸n educativa promociona eventos y seminarios: Los organizadores de eventos llenan un Google Doc con los detalles del evento. El flujo usa IA para crear textos atractivos e im谩genes para LinkedIn y la p谩gina de Facebook de la universidad. Un responsable de departamento aprueba el contenido, que luego se programa. Objetivo: Promover todos los eventos aprobados en un plazo de 24 horas tras la finalizaci贸n de los detalles, reduciendo el esfuerzo manual en un 60% por semestre.",
      "Un creador de contenido o influencer gestiona su calendario editorial: El creador define sus temas y mensajes clave semanales en un Google Doc. El flujo aprovecha la IA para generar subt铆tulos y conceptos de imagen, que el creador revisa y aprueba para su publicaci贸n automatizada en Instagram y Twitter. El contenido publicado se archiva. Objetivo: Aumentar la frecuencia de publicaci贸n en un 30% y ahorrar 5-10 horas semanales en la creaci贸n de contenido en el pr贸ximo mes.",
      "El departamento de RRHH de una empresa difunde comunicaciones internas: El equipo de RRHH introduce las novedades (pol铆ticas, reconocimientos) en un Google Doc. El flujo genera un mensaje conciso y una imagen con IA, adaptado para plataformas internas (ej. Slack, SharePoint). Un l铆der de equipo aprueba el mensaje antes de publicarse y se archiva un registro. Objetivo: Asegurar que el 100% de las comunicaciones internas cr铆ticas se difundan en 4 horas desde su aprobaci贸n, mejorando el engagement de los empleados."
    ],
    "similarities": [
      {
        "workflowId": "flujo-3",
        "workflowName": "#3 - TEMPLATE-DEMO-CHATGPT-IMAGE-1-WITH-DRIVE-AND-SHEET COPY",
        "score": 0.85,
        "reason": "Ambos flujos son similares porque utilizan IA para la generaci贸n de contenido visual, pero este flujo es m谩s completo al incluir la publicaci贸n multicanal en redes sociales."
      },
      {
        "workflowId": "flujo-8",
        "workflowName": "#8 - NOTION TO LINKEDIN",
        "score": 0.7,
        "reason": "Ambos flujos automatizan la publicaci贸n de contenido en redes sociales (especialmente LinkedIn), pero este flujo es m谩s complejo al usar IA para la generaci贸n del contenido, mientras que el flujo 8 lo toma de Notion."
      }
    ]
  },
  {
    "id": "flujo-8",
    "displayId": 8,
    "fileName": "notion-to-linkedin.json",
    "flowName": "NOTION TO LINKEDIN",
    "shortDescription": "Este flujo automatiza la publicaci贸n diaria de posts de una base de datos de Notion en LinkedIn, formateando el contenido, descargando im谩genes asociadas y actualizando el estado de publicaci贸n en Notion.",
    "mainArea": "Marketing",
    "secondaryAreas": [],
    "mainFunction": "Automatizar la publicaci贸n de contenido diario",
    "automationDestinations": [
      "Notion",
      "LinkedIn",
      "Servicio HTTP externo (para im谩genes)"
    ],
    "dataOrigins": [
      "Notion"
    ],
    "keyNodes": [
      "Schedule Trigger",
      "Notion",
      "Aggregate",
      "Code",
      "HTTP Request",
      "Merge",
      "LinkedIn"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "Una agencia de marketing digital desea mantener una presencia activa en LinkedIn, publicando diariamente consejos y art铆culos de blog para atraer nuevos clientes. El flujo automatizar谩 la publicaci贸n, buscando aumentar el engagement en un 20% y generar 5 nuevos leads cualificados por mes, con un plazo de implementaci贸n de 1 semana y evaluaci贸n mensual.",
      "Un departamento universitario necesita difundir diariamente res煤menes de nuevas publicaciones de investigaci贸n y eventos acad茅micos entre la comunidad profesional de LinkedIn para mejorar la visibilidad de su trabajo. Se espera un aumento del 15% en las visitas a p谩ginas de investigaci贸n en los pr贸ximos tres meses, con una puesta en marcha en 2 semanas y seguimiento trimestral.",
      "Un consultor independiente busca establecer su marca personal como l铆der de pensamiento en su nicho, publicando regularmente ideas y reflexiones en LinkedIn sin la carga manual diaria. El objetivo es incrementar su red de contactos en LinkedIn en un 10% mensual y recibir al menos 2 invitaciones a charlas por trimestre, con una configuraci贸n inicial en 3 d铆as y revisi贸n de resultados mensual.",
      "Una empresa tecnol贸gica desea compartir noticias internas, logros de equipo y ofertas de empleo con sus empleados y la comunidad tecnol贸gica en LinkedIn de forma regular. El flujo buscar谩 aumentar el 'employee advocacy' en un 25% en 6 meses y reducir el tiempo de publicaci贸n manual en 8 horas semanales, con un lanzamiento en 1 mes y evaluaci贸n semestral.",
      "Una empresa SaaS necesita anunciar nuevas caracter铆sticas y actualizaciones de productos en LinkedIn de manera consistente para mantener informada a su base de usuarios y posibles clientes. Se busca aumentar la retenci贸n de usuarios en un 5% en 3 meses y lograr que el 30% de los posts generen clics hacia la documentaci贸n, con implementaci贸n y pruebas en 2 semanas y seguimiento mensual."
    ],
    "similarities": [
      {
        "workflowId": "flujo-7",
        "workflowName": "#7 - AUTOMATED SOCIAL MEDIA CONTENT PUBLISHING FACTORY + SYSTEM PROMPT COMPOSITION",
        "score": 0.7,
        "reason": "Ambos automatizan la publicaci贸n en LinkedIn, pero este flujo se origina en Notion, mientras que el flujo 7 usa IA y es multicanal, siendo m谩s complejo."
      },
      {
        "workflowId": "flujo-15",
        "workflowName": "#15 - NEW TWEETS",
        "score": 0.6,
        "reason": "Ambos flujos trabajan con plataformas de redes sociales (LinkedIn y Twitter). Uno es para publicar contenido (push) y el otro para monitorear (pull)."
      }
    ]
  },
  {
    "id": "flujo-9",
    "displayId": 9,
    "fileName": "multi-agent.json",
    "flowName": "MULTI-AGENT CONVERSATION",
    "shortDescription": "Este flujo permite iniciar conversaciones con m煤ltiples agentes de IA, cada uno configurable con su propio modelo e instrucciones. Los agentes pueden ser invocados por menciones o responder todos aleatoriamente si no hay menciones espec铆ficas.",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [],
    "mainFunction": "Gestionar y orquestar conversaciones interactivas con m煤ltiples agentes de IA personalizables.",
    "automationDestinations": [
      "OpenRouter"
    ],
    "dataOrigins": [
      "Mensaje de Chat (n8n chatTrigger)"
    ],
    "keyNodes": [
      "Chat Trigger",
      "Agente de IA",
      "C贸digo",
      "Split in Batches (Bucle)",
      "If (Condicional)",
      "Memoria de Conversaci贸n",
      "Modelo de Chat OpenRouter"
    ],
    "complexity": "Complejo",
    "useCaseExamples": [
      "Una empresa de comercio electr贸nico utiliza el flujo para gestionar consultas de clientes. Configuran agentes como \"@SoportePedidos\" para problemas de env铆o/devoluciones y \"@SoporteT茅cnico\" para fallos de productos. Las consultas que mencionan a un agente son dirigidas; las generales reciben una respuesta combinada. El objetivo es reducir el tiempo de primera respuesta en un 40% y mejorar la satisfacci贸n del cliente en un 15% en los pr贸ximos tres meses.",
      "Un equipo de marketing emplea el flujo para la ideaci贸n de campa帽as. Configuran \"@GeneradorSlogans\", \"@CreadorHistorias\" y \"@AnalistaTendencias\". Pueden solicitar ideas a un agente espec铆fico o lanzar una pregunta abierta para obtener diversas perspectivas de todos. Esto busca generar 20 ideas de campa帽a semanales y reducir el tiempo de \"brainstorming\" en un 30% para el final del trimestre.",
      "Una organizaci贸n sin fines de lucro usa el flujo para responder a donantes y voluntarios. Tienen agentes como \"@InformacionDonaciones\" para preguntas de aportaciones y \"@CoordinadorVoluntarios\" para horarios y tareas. Las consultas pueden dirigirse o recibir una respuesta colaborativa. El objetivo es aumentar la tasa de respuesta a donantes en un 25% y la participaci贸n de voluntarios en un 10% en seis meses.",
      "Una startup de software utiliza el flujo para generar especificaciones de caracter铆sticas de productos. Configuran agentes como \"@UX_Dise帽ador\" para experiencia de usuario, \"@Backend_Ingeniero\" para viabilidad t茅cnica y \"@AnalistaNegocio\" para impacto comercial. El equipo puede pedir una opini贸n a un agente o una revisi贸n general del concepto. El prop贸sito es mejorar la calidad de las especificaciones en un 20% y acelerar la fase de dise帽o en un 15% en cuatro meses.",
      "Un departamento de recursos humanos implementa el flujo para responder a preguntas frecuentes de empleados. Disponen de agentes como \"@BeneficiosHR\" para consultas de seguros y \"@NormativasEmpresa\" para pol铆ticas internas. Los empleados pueden mencionar un agente o hacer una pregunta general. Esto pretende reducir las consultas directas a HR en un 30% y asegurar una respuesta consistente del 90% para el pr贸ximo a帽o fiscal."
    ],
    "similarities": []
  },
  {
    "id": "flujo-10",
    "displayId": 10,
    "fileName": "lead-qualification.json",
    "flowName": "LEAD QUALIFICATION WITH BATCHDATA",
    "shortDescription": "Este flujo califica leads autom谩ticamente utilizando datos de propiedades de BatchData, actualiza el CRM con la informaci贸n enriquecida y dispara acciones de seguimiento o notificaciones basadas en el estado de calificaci贸n.",
    "mainArea": "Ventas",
    "secondaryAreas": [],
    "mainFunction": "Calificar leads autom谩ticamente utilizando datos de propiedades y automatizar tareas de seguimiento o notificaci贸n.",
    "automationDestinations": [
      "CRM",
      "BatchData",
      "Slack"
    ],
    "dataOrigins": [
      "CRM"
    ],
    "keyNodes": [
      "webhook",
      "httpRequest",
      "code",
      "if",
      "slack"
    ],
    "complexity": "Complejo",
    "useCaseExamples": [
      "Una agencia inmobiliaria automatiza la calificaci贸n de interesados en propiedades, enriqueciendo los leads con BatchData para priorizar contactos de alto valor en el CRM y disparar llamadas autom谩ticas, buscando aumentar las conversiones de consulta a visita en un 15% en 6 meses.",
      "Una empresa SaaS califica autom谩ticamente a los usuarios de pruebas gratuitas utilizando BatchData (ej. tama帽o de empresa), actualizando el CRM para que los vendedores contacten a los leads de mayor potencial, con el objetivo de incrementar la tasa de conversi贸n de prueba a pago en un 10% en el pr贸ximo trimestre.",
      "Un equipo de marketing B2B utiliza el flujo para calificar leads post-campa帽a con BatchData, actualizando el CRM para asignar leads de alta calidad a un vendedor o secuencia de nutrici贸n personalizada, buscando aumentar la tasa de apertura de seguimiento en un 20% para fin de a帽o.",
      "Una instituci贸n financiera pre-califica autom谩ticamente las solicitudes de pr茅stamos con datos de BatchData para priorizar a los solicitantes con mayor probabilidad de aprobaci贸n en el CRM, aspirando a reducir el tiempo de procesamiento en un 25% en los pr贸ximos 9 meses.",
      "Una universidad califica a los futuros estudiantes bas谩ndose en propiedades de BatchData, actualiza el CRM para priorizar a los candidatos con mayor potencial de inscripci贸n y env铆a informaci贸n personalizada, con el fin de aumentar la tasa de conversi贸n de consulta a inscripci贸n en un 8% durante el pr贸ximo ciclo de admisi贸n."
    ],
    "similarities": [
      {
        "workflowId": "flujo-22",
        "workflowName": "#22 - GESTIN BSICA DE CONTACTOS EN COPPER",
        "score": 0.7,
        "reason": "Ambos flujos trabajan con CRMs (uno gen茅rico, el otro Copper) para la gesti贸n de contactos/leads. Este flujo es m谩s complejo ya que incluye calificaci贸n de leads con un servicio externo (BatchData)."
      }
    ]
  },
  {
    "id": "flujo-11",
    "displayId": 11,
    "fileName": "totp-generator.json",
    "flowName": "COMPLETE GUIDE TO SETTING UP AND GENERATING TOTP CODES IN N8N ",
    "shortDescription": "Este flujo permite generar c贸digos TOTP (Time-based One-Time Password) de forma manual en n8n para prop贸sitos de autenticaci贸n o seguridad.",
    "mainArea": "IT/Seguridad",
    "secondaryAreas": [],
    "mainFunction": "Generar c贸digos TOTP (Time-based One-Time Password) para autenticaci贸n segura",
    "automationDestinations": [
      "n8n"
    ],
    "dataOrigins": [
      "Datos internos de n8n / Configuraci贸n manual"
    ],
    "keyNodes": [
      "Manual Trigger",
      "TOTP"
    ],
    "complexity": "Simple",
    "useCaseExamples": [
      "Un administrador de TI necesita acceder a una herramienta de gesti贸n interna o un panel de control que requiere un c贸digo TOTP para el inicio de sesi贸n, pero su dispositivo m贸vil principal con la aplicaci贸n autenticadora no est谩 disponible o no tiene bater铆a. El flujo de n8n le permite generar este c贸digo bajo demanda, reduciendo el tiempo de inactividad del administrador por problemas de acceso en un 50% en el pr贸ximo mes, con el c贸digo TOTP disponible para copiar en menos de 10 segundos desde la ejecuci贸n del flujo.",
      "Un agente de soporte al cliente necesita ayudar a un usuario a recuperar el acceso a su cuenta protegida por 2FA (TOTP) despu茅s de que el usuario haya perdido su dispositivo autenticador. Tras una rigurosa verificaci贸n de identidad, el agente utiliza n8n para generar un c贸digo TOTP de emergencia de un solo uso (con un secreto temporal o el secreto del usuario almacenado de forma segura) para que el cliente pueda acceder y restablecer su 2FA, mejorando la tasa de resoluci贸n de problemas de acceso por TOTP en el primer contacto en un 30% para el final del trimestre. El proceso completo de generaci贸n y provisi贸n del c贸digo no debe exceder los 5 minutos despu茅s de la verificaci贸n de identidad.",
      "Un equipo de QA o desarrollo necesita realizar pruebas repetitivas de la funcionalidad de autenticaci贸n de dos factores (TOTP) en una nueva aplicaci贸n o API, simulando diferentes escenarios sin depender de un autenticador m贸vil f铆sico. El flujo de n8n genera los c贸digos TOTP necesarios para cada ciclo de prueba con secretos predefinidos, reduciendo el tiempo dedicado a la configuraci贸n manual de pruebas de 2FA en un 40% durante el pr贸ximo ciclo de desarrollo. Se permite la generaci贸n y validaci贸n de 50 c贸digos TOTP de prueba en menos de 1 minuto.",
      "Un auditor de seguridad o un ingeniero de operaciones necesita verificar que la implementaci贸n de TOTP en un sistema de terceros o un servicio en la nube (donde se ha configurado un secreto conocido) est谩 funcionando correctamente. El flujo de n8n genera un c贸digo TOTP utilizando el secreto configurado, que luego se compara con el c贸digo que deber铆a aceptar el sistema auditado, aumentando la velocidad de las auditor铆as de seguridad de 2FA en un 25% y asegurando un 100% de consistencia en las pruebas. Se puede realizar una verificaci贸n completa de un sistema en menos de 15 minutos, incluyendo la generaci贸n y comparaci贸n del c贸digo.",
      "Para acceder a un entorno de desarrollo o producci贸n altamente sensible, un ingeniero requiere un c贸digo TOTP temporal que no est茅 vinculado a su autenticador personal. Un flujo de n8n, activado por un superior o bajo estrictos controles de acceso, genera un TOTP de un solo uso con un secreto espec铆fico para ese acceso restringido, que el ingeniero usa en un corto periodo de tiempo, reduciendo el riesgo de acceso no autorizado a entornos cr铆ticos en un 100% al eliminar el uso de autenticadores personales para accesos temporales y compartidos. El c贸digo TOTP generado debe ser usado y el acceso revocado o expirado en menos de 30 minutos."
    ],
    "similarities": []
  },
  {
    "id": "flujo-12",
    "displayId": 12,
    "fileName": "typeform-feedback.json",
    "flowName": "TYPEFORM FEEDBACK WORKFLOW",
    "shortDescription": "Este flujo recopila feedback enviado a trav茅s de Typeform, eval煤a su utilidad y lo clasifica autom谩ticamente, guardando la informaci贸n en hojas de c谩lculo separadas de Google Sheets seg煤n la valoraci贸n.",
    "mainArea": "Gesti贸n de Feedback",
    "secondaryAreas": [],
    "mainFunction": "Recopilaci贸n y Clasificaci贸n de Feedback",
    "automationDestinations": [
      "Google Sheets"
    ],
    "dataOrigins": [
      "Typeform"
    ],
    "keyNodes": [
      "Typeform Trigger",
      "IF",
      "Google Sheets",
      "Set"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "Gesti贸n de Feedback de Producto: Una startup de software utiliza Typeform para recopilar sugerencias de nuevas funcionalidades y reportes de errores. El flujo eval煤a autom谩ticamente la prioridad del feedback (por ejemplo, 'Cr铆tico', 'Mayor', 'Menor') bas谩ndose en palabras clave y categoriza las entradas, guardando los errores cr铆ticos en una hoja de Google Sheets para el equipo de desarrollo de inmediato y las sugerencias en otra para revisi贸n semanal, con el objetivo de reducir el tiempo de triage manual en un 70% para el pr贸ximo trimestre.",
      "Evaluaci贸n de Eventos y Sesiones Educativas: Un organizador de conferencias env铆a encuestas post-evento a trav茅s de Typeform. El flujo analiza las valoraciones y comentarios para clasificar autom谩ticamente las sesiones en 'Excelente', 'Bueno' o 'Necesita Mejora', almacenando cada categor铆a en una hoja de Google Sheets separada. Esto permite identificar las tres sesiones mejor valoradas y las tres peor valoradas en menos de 24 horas tras el cierre de la encuesta para planificar futuras mejoras.",
      "Priorizaci贸n de Solicitudes de Soporte al Cliente: Una tienda online recibe consultas de clientes a trav茅s de un formulario Typeform. El flujo eval煤a la urgencia y el tipo de problema (por ejemplo, 'Problema de Env铆o Cr铆tico', 'Consulta de Producto', 'Queja General') usando procesamiento de lenguaje natural. Las solicitudes 'Cr铆ticas' se dirigen a una hoja de c谩lculo para el equipo de soporte de Nivel 1 para acci贸n inmediata, mientras que las otras van a hojas para Nivel 2 o consultas generales, buscando reducir el tiempo de respuesta inicial para problemas cr铆ticos en un 50% en el pr贸ximo mes.",
      "Recopilaci贸n de Feedback Interno de Empleados: El departamento de RRHH de una empresa utiliza Typeform para encuestas de clima laboral o sugerencias de mejora. El flujo eval煤a el sentimiento y la relevancia del feedback, clasific谩ndolo en 'Acci贸n Inmediata', 'Revisi贸n Semanal' o 'Sugerencia General'. Cada tipo se guarda en una hoja de Google Sheets distinta, garantizando que cualquier problema urgente sea escalado y abordado en un m谩ximo de 48 horas tras su recepci贸n.",
      "An谩lisis de Propuestas para Publicaciones o Contenido: Una editorial digital recibe propuestas de art铆culos o ideas de contenido a trav茅s de Typeform. El flujo las eval煤a en base a criterios predefinidos (originalidad, relevancia tem谩tica, audiencia) y las clasifica en 'Alto Potencial', 'Pendiente de Revisi贸n' o 'Archivo'. Cada categor铆a se almacena en hojas de Google Sheets separadas, con el objetivo de agilizar el proceso de selecci贸n de contenido en un 40% y tener las ideas de 'Alto Potencial' evaluadas por el comit茅 editorial en una semana."
    ],
    "similarities": []
  },
  {
    "id": "flujo-13",
    "displayId": 13,
    "fileName": "bitwarden-management.json",
    "flowName": "GESTIN DE GRUPOS Y MIEMBROS DE BITWARDEN",
    "shortDescription": "Este flujo de trabajo gestiona los grupos y los miembros dentro de Bitwarden, permitiendo la creaci贸n de grupos, la obtenci贸n de todos los miembros, y la actualizaci贸n y consulta de la membres铆a de grupos.",
    "mainArea": "Seguridad / TI",
    "secondaryAreas": [],
    "mainFunction": "Automatizar la gesti贸n de grupos y miembros en Bitwarden.",
    "automationDestinations": [
      "Bitwarden"
    ],
    "dataOrigins": [
      "Bitwarden"
    ],
    "keyNodes": [
      "Bitwarden"
    ],
    "complexity": "Simple",
    "useCaseExamples": [
      "Integraci贸n de empleados: Al contratar a un nuevo empleado, el flujo de trabajo lo a帽ade autom谩ticamente a los grupos de Bitwarden pertinentes (ej. \"Finanzas\", \"Desarrollo\") bas谩ndose en su departamento en el sistema de RRHH, asegurando un acceso inmediato a las credenciales compartidas y reduciendo los retrasos en el acceso en un 70% en el primer d铆a de trabajo.",
      "Desvinculaci贸n de empleados: Cuando un empleado deja la empresa, el flujo de trabajo lo elimina autom谩ticamente de todos los grupos de Bitwarden y revoca su acceso, garantizando que el 100% de los accesos a credenciales sensibles se retiren en menos de 4 horas tras su desvinculaci贸n oficial.",
      "Sincronizaci贸n de roles: Sincronizar semanalmente las membres铆as de los grupos de Bitwarden con los roles y departamentos definidos en el directorio activo de la empresa, manteniendo una consistencia del 98% en la asignaci贸n de accesos y reduciendo el esfuerzo de gesti贸n manual en un 60% mensualmente.",
      "Auditor铆a de seguridad: Generar un informe mensual detallado de todos los grupos de Bitwarden y sus miembros, identificando cualquier inconsistencia o acceso no autorizado. Este proceso debe reducir el tiempo de auditor铆a manual en un 80% y detectar el 100% de los miembros no conformes en un plazo de 24 horas tras su ejecuci贸n.",
      "Acceso por proyectos: Bas谩ndose en las asignaciones de proyectos en Jira, el flujo de trabajo a帽ade o elimina autom谩ticamente a los usuarios de los grupos de Bitwarden correspondientes a cada proyecto. Esto garantiza que el 100% de los miembros del equipo tengan acceso a las credenciales del proyecto en menos de 30 minutos desde su asignaci贸n, eliminando retrasos."
    ],
    "similarities": []
  },
  {
    "id": "flujo-14",
    "displayId": 14,
    "fileName": "iss-tracker.json",
    "flowName": "SEND UPDATES ABOUT THE POSITION OF THE ISS EVERY MINUTE TO A TOPIC IN ACTIVEMQ",
    "shortDescription": "Este flujo obtiene la posici贸n actual de la ISS cada minuto a trav茅s de una API externa y la env铆a a un t贸pico de ActiveMQ.",
    "mainArea": "Monitoreo de Datos",
    "secondaryAreas": [],
    "mainFunction": "Obtener y enviar la posici贸n actual de la Estaci贸n Espacial Internacional (ISS)",
    "automationDestinations": [
      "ActiveMQ"
    ],
    "dataOrigins": [
      "API externa (wheretheiss.at)"
    ],
    "keyNodes": [
      "Cron",
      "HTTP Request",
      "Set",
      "AMQP Sender"
    ],
    "complexity": "Simple",
    "useCaseExamples": [
      "Un museo de ciencia desea mostrar la ubicaci贸n en tiempo real de la Estaci贸n Espacial Internacional (ISS) en una gran pantalla interactiva dentro de su exposici贸n espacial. La pantalla se actualiza cada minuto, mostrando las coordenadas correctas y una representaci贸n visual de la ISS sobre un mapa global, logrando una disponibilidad del 98% del sistema durante las horas de apertura del museo. El flujo de n8n env铆a los datos de la ISS a un t贸pico de ActiveMQ, y una aplicaci贸n de display personalizada suscrita a ese t贸pico consume y visualiza los datos. La implementaci贸n y puesta en marcha deben completarse antes de la inauguraci贸n de la nueva exposici贸n en los pr贸ximos dos meses.",
      "Una comunidad de astr贸nomos aficionados o entusiastas de la radioafici贸n quiere recibir alertas autom谩ticas cuando la ISS sea visible desde su ubicaci贸n espec铆fica o est茅 a punto de pasar por encima. Los usuarios reciben notificaciones (por ejemplo, por correo electr贸nico o SMS) con un m铆nimo de 5 minutos de antelaci贸n al paso visible de la ISS, con una precisi贸n del 90% en la predicci贸n para un radio de 100 km durante el pr贸ximo trimestre. El flujo de n8n alimenta ActiveMQ con la posici贸n de la ISS. Otro flujo de n8n (o un servicio externo) consume estos datos, compara las coordenadas con las ubicaciones registradas de los usuarios y activa las notificaciones correspondientes. El sistema de alertas debe estar operativo y probado por un grupo beta en las pr贸ximas cuatro semanas.",
      "Una empresa de desarrollo de aplicaciones m贸viles busca integrar un feed de datos en tiempo real de la posici贸n de la ISS en una aplicaci贸n educativa de realidad aumentada que superpone la ubicaci贸n de la ISS en la vista del cielo de los usuarios. La aplicaci贸n consume el feed de datos de la ISS con una latencia de actualizaci贸n inferior a 3 segundos, y la posici贸n mostrada en AR tiene una precisi贸n visual del 95% respecto a la ubicaci贸n real esperada, evaluado en el 80% de los dispositivos durante un periodo de prueba de un mes. El flujo de n8n env铆a la posici贸n a ActiveMQ. Un backend de API que se suscribe a ActiveMQ expone un endpoint (por ejemplo, WebSocket) para que la aplicaci贸n m贸vil reciba actualizaciones continuas. La integraci贸n y prueba inicial del feed de datos debe completarse para la fase alfa de la aplicaci贸n en las pr贸ximas seis semanas.",
      "Un equipo de investigaci贸n universitario necesita recopilar un conjunto de datos hist贸ricos y en tiempo real de la posici贸n de la ISS para estudiar sus patrones orbitales, desviaciones o correlacionar con eventos espaciales. Se logra una ingesta continua de datos de posici贸n de la ISS en un lago de datos (o base de datos para series temporales) con una latencia de menos de 10 segundos y una tasa de 茅xito de escritura del 99.9% durante un per铆odo de recopilaci贸n de un a帽o. El flujo de n8n publica la posici贸n en ActiveMQ. Otro servicio o un flujo de n8n adicional suscribe a este t贸pico y persiste los datos en un almacenamiento a largo plazo como un data lake (ej. S3, Azure Blob Storage) o una base de datos. La recopilaci贸n de datos debe comenzar en la pr贸xima semana y extenderse por un m铆nimo de 12 meses para el proyecto de investigaci贸n.",
      "Una instituci贸n educativa o un peque帽o centro de simulaci贸n desea proporcionar a sus estudiantes o aprendices una simulaci贸n b谩sica de seguimiento de un activo orbital, utilizando datos reales de la ISS. La simulaci贸n muestra la posici贸n de la ISS con actualizaciones cada minuto, reflejando su trayectoria real con una desviaci贸n inferior al 1% en un periodo de seguimiento de una hora, y el entorno de simulaci贸n se mantiene en l铆nea durante el 95% de las sesiones de entrenamiento. El flujo de n8n env铆a los datos a ActiveMQ. Una plataforma de simulaci贸n o una herramienta de visualizaci贸n personalizada consume este flujo de datos en tiempo real para representar el movimiento de la ISS en un entorno simulado. La simulaci贸n debe estar disponible para el pr贸ximo programa de capacitaci贸n que comienza en tres meses."
    ],
    "similarities": []
  },
  {
    "id": "flujo-15",
    "displayId": 15,
    "fileName": "new-tweets.json",
    "flowName": "NEW TWEETS",
    "shortDescription": "Este flujo busca tweets espec铆ficos en Twitter, compara los resultados con los registros existentes en Airtable y a帽ade autom谩ticamente los tweets nuevos a la base de datos de Airtable.",
    "mainArea": "Marketing",
    "secondaryAreas": [],
    "mainFunction": "Monitorear y almacenar nuevos tweets en una base de datos",
    "automationDestinations": [
      "Twitter",
      "Airtable"
    ],
    "dataOrigins": [
      "Twitter"
    ],
    "keyNodes": [
      "Twitter",
      "Airtable",
      "Set",
      "Merge"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "**Monitorizaci贸n de Marca y Gesti贸n de Reputaci贸n:** Una empresa de software desea monitorizar todas las menciones de su marca, productos y palabras clave relacionadas en Twitter para identificar comentarios de clientes, quejas y noticias relevantes. El flujo buscar谩 tweets con @MiEmpresa, #MiProducto y MiEmpresa opiniones. El objetivo es reducir el tiempo de respuesta a menciones negativas en Twitter en un 30% en los pr贸ximos dos meses. El flujo se ejecutar谩 cada 15 minutos, almacenando los tweets en Airtable para su revisi贸n por el equipo de marketing.",
      "**An谩lisis de Competencia en Tiempo Real:** Una agencia de marketing digital quiere seguir de cerca las actividades de sus tres principales competidores en Twitter, incluyendo sus campa帽as, lanzamientos de productos y la reacci贸n del p煤blico a sus publicaciones. El flujo buscar谩 los hashtags de campa帽a y menciones de las cuentas de Twitter de los competidores. El objetivo es identificar al menos dos nuevas estrategias de marketing o anuncios de productos de la competencia por semana y registrarlos en Airtable para su an谩lisis. El flujo se configurar谩 para ejecutarse cada hora.",
      "**Detecci贸n de Tendencias y Temas de Inter茅s para Contenido:** Un medio de comunicaci贸n online busca identificar r谩pidamente temas y noticias emergentes en una industria espec铆fica (ej. tecnolog铆a verde) para generar contenido relevante. El flujo buscar谩 tweets que contengan palabras clave como energ铆a solar, veh铆culo el茅ctrico, sostenibilidad y #Tecnolog铆aVerde. El objetivo es publicar al menos tres art铆culos mensuales basados en tendencias detectadas, aumentando el engagement de la audiencia en un 10% en esos art铆culos en el pr贸ximo trimestre. El flujo se ejecutar谩 diariamente.",
      "**Recopilaci贸n Automatizada de Testimonios de Clientes:** Una tienda de comercio electr贸nico desea recopilar tweets positivos de clientes sobre sus productos para utilizarlos como testimonios en su sitio web y redes sociales. El flujo buscar谩 tweets que mencionen el nombre de la tienda o productos con palabras como me encanta, excelente, feliz, s煤per y calificadores positivos. El objetivo es recopilar un promedio de 5 nuevos testimonios de clientes v谩lidos por semana, y utilizarlos para aumentar la tasa de conversi贸n en la p谩gina de producto en un 5% en los pr贸ximos seis meses. El flujo se ejecutar谩 dos veces al d铆a.",
      "**Monitoreo Proactivo de Quejas y Soporte al Cliente:** Una empresa de servicios online quiere detectar y responder proactivamente a quejas de clientes en Twitter que a煤n no se han convertido en tickets de soporte formal. El flujo buscar谩 menciones de la empresa junto con palabras clave como problema, no funciona, error, ayuda, soporte o ca铆do. El objetivo es reducir el tiempo promedio de primera respuesta a quejas p煤blicas en Twitter en un 40% en el pr贸ximo trimestre y disminuir el n煤mero de quejas sin respuesta en la plataforma a cero. El flujo se ejecutar谩 cada 10 minutos."
    ],
    "similarities": [
      {
        "workflowId": "flujo-1",
        "workflowName": "#1 - #锔NOSTR #DAMUS AI POWERED REPORTING + GMAIL + TELEGRAM",
        "score": 0.75,
        "reason": "Ambos flujos monitorean una red social (Twitter y Nostr) para recopilar y procesar informaci贸n, aunque sus destinos y complejidad var铆an."
      },
      {
        "workflowId": "flujo-8",
        "workflowName": "#8 - NOTION TO LINKEDIN",
        "score": 0.6,
        "reason": "Ambos flujos interact煤an con redes sociales. Este flujo lee datos de Twitter, mientras que el flujo 8 escribe datos en LinkedIn."
      }
    ]
  },
  {
    "id": "flujo-16",
    "displayId": 16,
    "fileName": "weather-alert.json",
    "flowName": "ALERTA METEOROLGICA PROGRAMADA",
    "shortDescription": "Este flujo env铆a un mensaje diario con la temperatura actual de Berl铆n a trav茅s de Plivo, activado por un horario predefinido.",
    "mainArea": "Utilidades",
    "secondaryAreas": [],
    "mainFunction": "Enviar una alerta diaria con la temperatura actual",
    "automationDestinations": [
      "Plivo"
    ],
    "dataOrigins": [
      "OpenWeatherMap"
    ],
    "keyNodes": [
      "Cron",
      "OpenWeatherMap",
      "Plivo"
    ],
    "complexity": "Simple",
    "useCaseExamples": [
      "Una empresa de log铆stica utiliza este flujo para enviar la temperatura actual de su principal centro de operaciones en Barcelona a todos sus conductores cada ma帽ana a las 6:00 AM, con el objetivo de reducir en un 15% las demoras por condiciones clim谩ticas adversas en las entregas durante el pr贸ximo trimestre.",
      "Una cooperativa agr铆cola implementa este flujo para notificar a sus miembros la temperatura m铆nima esperada en la regi贸n de Murcia a las 5:30 AM diariamente, permitiendo optimizar en un 10% la protecci贸n de cultivos sensibles a heladas en la pr贸xima temporada de invierno.",
      "El equipo de mantenimiento de un gran complejo de oficinas en Buenos Aires recibe un SMS con la temperatura exterior actual a las 8:00 AM cada d铆a, para ajustar de manera proactiva los sistemas de climatizaci贸n y lograr una reducci贸n del 5% en el consumo energ茅tico mensual para el pr贸ximo semestre.",
      "Una agencia de viajes especializada en aventuras al aire libre env铆a la temperatura prevista para sus destinos en los Alpes suizos a sus gu铆as y clientes participantes a las 7:00 AM, un d铆a antes de cada excursi贸n, buscando reducir en un 20% las incidencias relacionadas con la vestimenta inadecuada en los pr贸ximos seis meses.",
      "Un servicio de suscripci贸n para personas mayores con condiciones sensibles al clima env铆a un mensaje de texto diario con la temperatura esperada en la ciudad de Sevilla a las 9:00 AM, con el objetivo de que el 85% de los usuarios reporten mayor comodidad y preparaci贸n para el clima en el primer mes de uso."
    ],
    "similarities": []
  },
  {
    "id": "flujo-17",
    "displayId": 17,
    "fileName": "todoist-task.json",
    "flowName": "CREATE A NEW TASK IN TODOIST",
    "shortDescription": "Este flujo permite crear una nueva tarea en Todoist de forma manual.",
    "mainArea": "Productividad Personal",
    "secondaryAreas": [],
    "mainFunction": "Crear una nueva tarea",
    "automationDestinations": [
      "Todoist"
    ],
    "dataOrigins": [
      "Entrada Manual"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Todoist"
    ],
    "complexity": "Simple",
    "useCaseExamples": [
      "Despu茅s de cerrar una venta importante, un representante comercial inicia manualmente el flujo de n8n para crear una tarea estandarizada en Todoist para el equipo de implementaci贸n, incluyendo detalles clave del cliente y la fecha l铆mite acordada. Esto asegura que el 100% de las ventas cerradas tengan una tarea de seguimiento en Todoist asignada al equipo de implementaci贸n en las 24 horas siguientes al cierre, reduciendo los olvidos de un 15% a un 0% en el pr贸ximo trimestre.",
      "Un t茅cnico de TI, tras completar una actualizaci贸n cr铆tica de software en un servidor, activa manualmente el flujo de n8n para programar una tarea de seguimiento en Todoist para s铆 mismo, record谩ndole verificar la estabilidad del sistema una semana despu茅s. Esto garantizar谩 que el 100% de las actualizaciones cr铆ticas de software tengan una tarea de verificaci贸n post-implementaci贸n programada en Todoist dentro de una semana, aumentando la fiabilidad del sistema en un 5% en los pr贸ximos dos meses.",
      "Un gerente de marketing, al tener una nueva idea para un art铆culo de blog durante una reuni贸n, activa manualmente el flujo de n8n para crear una tarea en Todoist, asign谩ndola a un redactor espec铆fico con un t铆tulo predefinido y una fecha de entrega provisional de dos semanas. La asignaci贸n de nuevas ideas de contenido aumentar谩 en un 20% su eficiencia, asegurando que el 90% de las ideas se traduzcan en tareas asignadas en Todoist en menos de 30 minutos despu茅s de ser concebidas, durante el pr贸ximo mes.",
      "El equipo de RRHH, al confirmar la fecha de inicio de un nuevo empleado, activa manualmente el flujo de n8n para generar una lista de tareas de bienvenida estandarizadas en Todoist, asign谩ndolas al gerente del nuevo empleado con fechas l铆mite apropiadas para su primera semana. Se reducir谩 el tiempo dedicado a la preparaci贸n de tareas de onboarding para gerentes en un 15% durante el pr贸ximo trimestre, asegurando que todas las tareas esenciales se creen autom谩ticamente en el momento de la confirmaci贸n de la fecha de inicio.",
      "Durante una reuni贸n de seguimiento de proyecto, el jefe de proyecto identifica un impedimento cr铆tico y activa manualmente el flujo de n8n para crear una tarea de alta prioridad en Todoist, asign谩ndola inmediatamente al miembro del equipo responsable con una descripci贸n clara y una fecha l铆mite de 24 horas. La tasa de resoluci贸n de impedimentos cr铆ticos mejorar谩 en un 20% en los pr贸ximos tres meses, logrando que el 95% de los impedimentos se registren y asignen como tareas en Todoist en menos de 15 minutos despu茅s de su identificaci贸n."
    ],
    "similarities": [
      {
        "workflowId": "flujo-21",
        "workflowName": "#21 - PRIORIZACIN Y CATEGORIZACIN DE TAREAS DE TODOIST CON IA",
        "score": 0.9,
        "reason": "Ambos flujos se centran en la gesti贸n de tareas en Todoist. Este flujo es para la creaci贸n manual de tareas, mientras que el flujo 21 es para la categorizaci贸n y priorizaci贸n autom谩tica de tareas existentes."
      }
    ]
  },
  {
    "id": "flujo-18",
    "displayId": 18,
    "fileName": "stripe-hubspot-slack.json",
    "flowName": "ON NEW STRIPE INVOICE PAYMENT UPDATE HUBSPOT AND NOTIFY THE TEAM IN SLACK",
    "shortDescription": "Este flujo se activa cuando se paga una factura en Stripe, busca el trato correspondiente en Hubspot basado en el n煤mero de PO, actualiza el estado del trato a 'Pagado' y notifica al equipo en Slack sobre el pago, manejando casos sin n煤mero de PO o sin trato encontrado.",
    "mainArea": "Finanzas",
    "secondaryAreas": [],
    "mainFunction": "Actualizar el estado de pago de una transacci贸n y notificar al equipo",
    "automationDestinations": [
      "Stripe",
      "Hubspot",
      "Slack"
    ],
    "dataOrigins": [
      "Stripe"
    ],
    "keyNodes": [
      "stripeTrigger",
      "hubspot",
      "if",
      "slack"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "Este flujo de trabajo permitir谩 a una empresa SaaS automatizar la actualizaci贸n del estado de los tratos en HubSpot a 'Pagado' inmediatamente despu茅s de recibir un pago de un cliente empresarial a trav茅s de Stripe. Esto reducir谩 el tiempo dedicado por el equipo de finanzas a la conciliaci贸n manual de pagos en un 50% para el pr贸ximo trimestre, garantizando que los equipos de 茅xito del cliente sean notificados instant谩neamente en Slack para iniciar los procesos de onboarding o soporte.",
      "Una agencia de marketing digital utilizar谩 este flujo para automatizar la confirmaci贸n de los pagos de sus proyectos de clientes. Al recibir un pago en Stripe, el flujo actualizar谩 el trato de proyecto correspondiente en HubSpot a 'Pagado' y notificar谩 a los gerentes de proyecto en Slack. El objetivo es eliminar los retrasos en el inicio de la fase del proyecto debidos a la confirmaci贸n manual de pagos en un 100% antes de finalizar el Q3, mejorando la eficiencia operativa y la satisfacci贸n del cliente.",
      "Un distribuidor B2B que maneja grandes vol煤menes de pedidos con pago por factura implementar谩 este flujo para agilizar su proceso post-pago. Cuando un cliente mayorista paga una factura en Stripe, el trato en HubSpot se marcar谩 como 'Pagado' y el equipo de log铆stica ser谩 alertado en Slack. Esto asegurar谩 que todos los pedidos pagados est茅n listos para el procesamiento y env铆o dentro de los 30 minutos posteriores al pago, reduciendo los tiempos de espera del cliente en un 25% para fin de a帽o.",
      "Una firma consultora de TI utilizar谩 este flujo para gestionar los pagos por hitos de sus proyectos. Cada vez que se paga una factura de hito en Stripe, el flujo actualizar谩 el estado del trato del proyecto en HubSpot y notificar谩 al equipo de consultores en Slack. Esto reducir谩 las consultas internas sobre el estado de los pagos en un 75% durante los pr贸ximos seis meses y garantizar谩 una transici贸n fluida a la siguiente fase del proyecto sin retrasos por verificaci贸n manual.",
      "Este flujo permitir谩 a un proveedor de software empresarial automatizar la gesti贸n de las renovaciones de licencias de alto valor. Tras recibir el pago de una factura de renovaci贸n en Stripe, el flujo actualizar谩 el trato de renovaci贸n correspondiente en HubSpot a 'Pagado' y enviar谩 una notificaci贸n a los equipos de ventas y legal en Slack. El objetivo es asegurar que el 100% de las actualizaciones de estado de trato por renovaci贸n manual se realicen en menos de 10 minutos post-pago, eliminando errores de seguimiento y mejorando la precisi贸n de los pron贸sticos de ingresos dentro del pr贸ximo mes."
    ],
    "similarities": [
      {
        "workflowId": "flujo-2",
        "workflowName": "#2 - GUMROAD SALE TRIGGER",
        "score": 0.8,
        "reason": "Ambos flujos se inician con un evento de pago (Stripe y Gumroad) y automatizan procesos de post-venta, como la actualizaci贸n de datos de clientes."
      }
    ]
  },
  {
    "id": "flujo-19",
    "displayId": 19,
    "fileName": "data-merge.json",
    "flowName": "FUSIN DE DATOS DE ENTREVISTAS Y EMPLEADOS",
    "shortDescription": "Este flujo fusiona datos simulados de entrevistas con informaci贸n de empleados, utilizando un identificador 煤nico para correlacionar ambos conjuntos de informaci贸n.",
    "mainArea": "Recursos Humanos",
    "secondaryAreas": [],
    "mainFunction": "Correlacionar datos de entrevistas con informaci贸n de empleados por un identificador 煤nico.",
    "automationDestinations": [
      "Ninguna (solo procesamiento interno de datos en esta representaci贸n simplificada)"
    ],
    "dataOrigins": [
      "Interna (generada en los nodos Function)"
    ],
    "keyNodes": [
      "Function",
      "Merge"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "**Proceso de Selecci贸n (RRHH):** Fusionar los resultados detallados de las entrevistas t茅cnicas y de habilidades blandas de los candidatos (puntuaciones, comentarios, disponibilidad) con su informaci贸n demogr谩fica y historial de aplicaciones ya registrado en el ATS (Sistema de Seguimiento de Candidatos). El objetivo es reducir el tiempo de consolidaci贸n manual de datos en un 30% y agilizar la toma de decisiones para finales del pr贸ximo trimestre, logrando una vista unificada de cada candidato.",
      "**Evaluaci贸n de Desempe帽o 360 (Gesti贸n del Talento):** Integrar el feedback cualitativo y cuantitativo recopilado de las entrevistas de evaluaci贸n de desempe帽o 360 (aportaciones del jefe, pares y subordinados) con el registro de desempe帽o hist贸rico y los datos de compensaci贸n de cada empleado. Esto permitir谩 a los gerentes tener una visi贸n hol铆stica para las revisiones anuales, con el objetivo de mejorar la precisi贸n de las evaluaciones en un 15% antes del pr贸ximo ciclo de revisi贸n anual.",
      "**Monitoreo del Onboarding (RRHH):** Combinar los resultados de las encuestas y entrevistas iniciales de incorporaci贸n (ej. satisfacci贸n con el proceso, expectativas, desaf铆os) con los datos del nuevo empleado y su progreso en programas de capacitaci贸n obligatorios. El objetivo es identificar proactivamente los problemas y mejorar la experiencia del nuevo empleado para aumentar la retenci贸n en los primeros 6 meses en un 10% para el final del a帽o fiscal.",
      "**An谩lisis de Desvinculaci贸n (RRHH):** Fusionar los datos cualitativos de las entrevistas de salida (razones de desvinculaci贸n, sugerencias de mejora, ambiente laboral percibido) con la informaci贸n demogr谩fica, el historial de empleo y los datos salariales de los empleados que se van. Esto permitir谩 a la empresa identificar las 3 principales causas de rotaci贸n y reducir la tasa de rotaci贸n voluntaria en un 5% en los pr贸ximos 12 meses.",
      "**Planificaci贸n de Sucesi贸n y Desarrollo (Desarrollo Organizacional):** Integrar los resultados de entrevistas de evaluaci贸n de potencial interno o sesiones de 'talent review' (ej. aspiraciones de carrera, habilidades de liderazgo, 谩reas de mejora) con el historial de formaci贸n, certificaciones y trayectoria profesional de los empleados. El objetivo es identificar al 20% de los empleados con alto potencial para programas de liderazgo o roles estrat茅gicos para el pr贸ximo ciclo de planificaci贸n de carrera."
    ],
    "similarities": []
  },
  {
    "id": "flujo-20",
    "displayId": 20,
    "fileName": "binary-data.json",
    "flowName": "GENERACIN Y GUARDADO DE DATOS BINARIOS",
    "shortDescription": "Este flujo genera datos de ejemplo, los convierte a formato binario y los guarda en un archivo local llamado test.json.",
    "mainArea": "Infraestructura/Desarrollo",
    "secondaryAreas": [],
    "mainFunction": "Crear, transformar y guardar datos en un archivo binario",
    "automationDestinations": [
      "Sistema de Archivos Local"
    ],
    "dataOrigins": [
      "Generado Internamente"
    ],
    "keyNodes": [
      "function",
      "writeBinaryFile"
    ],
    "complexity": "Simple",
    "useCaseExamples": [
      "Un equipo de desarrollo web necesita generar datos de prueba para simular 100 usuarios en un nuevo formulario de registro. El flujo de n8n genera 100 perfiles de usuario ficticios (nombre, email, id), los convierte a formato binario y los guarda como 'mock_users.json' localmente. El 茅xito se mide si el archivo se crea correctamente y la integraci贸n del formulario consume los datos sin errores antes del final del d铆a.",
      "Un dise帽ador de UI/UX requiere datos de ejemplo consistentes para probar el renderizado de un componente de tabla en un dashboard. El flujo de n8n genera 50 registros de productos (ID, nombre, precio, stock) con valores aleatorios, los convierte a binario y los guarda como 'product_display_data.json' en el directorio del proyecto. El objetivo es que el componente se renderice correctamente con estos 50 铆tems antes de la reuni贸n de revisi贸n de ma帽ana por la ma帽ana.",
      "Un analista de datos necesita una peque帽a muestra de datos de transacciones de un sistema simulado para realizar un an谩lisis exploratorio local r谩pido. El flujo de n8n genera 20 registros de transacciones (fecha, art铆culo, cantidad, total), los convierte a binario y los guarda como 'sample_transactions.json'. El 茅xito se mide por la capacidad del analista de cargar y procesar este archivo en su herramienta de an谩lisis en menos de 30 minutos.",
      "Un ingeniero de DevOps est谩 probando un script de configuraci贸n local que requiere un archivo JSON de entrada con par谩metros espec铆ficos. El flujo de n8n genera un objeto JSON con configuraciones de entorno (ej. 'environment': 'dev', 'feature_flags': ['A', 'B']), lo convierte a binario y lo guarda como 'test_config.json'. El script se considera probado con 茅xito si lee el archivo y ejecuta su l贸gica correctamente, lo cual debe completarse dentro de la hora.",
      "Un instructor de programaci贸n necesita crear un conjunto de datos simple y uniforme para una sesi贸n de capacitaci贸n sobre manipulaci贸n de JSON. El flujo de n8n genera 15 registros de 'estudiantes' (nombre, edad, curso, nota), los convierte a binario y los guarda como 'student_grades.json' en el directorio compartido del curso. El objetivo es que todos los estudiantes puedan acceder y usar este archivo para sus ejercicios pr谩cticos de la clase de ma帽ana, asegurando que est茅 disponible 2 horas antes del inicio."
    ],
    "similarities": []
  },
  {
    "id": "flujo-21",
    "displayId": 21,
    "fileName": "todoist-ai.json",
    "flowName": "PRIORIZACIN Y CATEGORIZACIN DE TAREAS DE TODOIST CON IA",
    "shortDescription": "Este flujo automatiza la categorizaci贸n de tareas de Todoist utilizando Inteligencia Artificial y actualiza su prioridad bas谩ndose en reglas predefinidas y la categor铆a asignada. Se ejecuta peri贸dicamente para procesar nuevas tareas en la bandeja de entrada.",
    "mainArea": "Productividad Personal",
    "secondaryAreas": [],
    "mainFunction": "Categorizar autom谩ticamente tareas de Todoist utilizando IA y actualizar su prioridad en funci贸n de la categor铆a asignada.",
    "automationDestinations": [
      "Todoist",
      "OpenAI"
    ],
    "dataOrigins": [
      "Todoist"
    ],
    "keyNodes": [
      "Schedule Trigger",
      "Todoist",
      "Set",
      "OpenAI",
      "Filter"
    ],
    "complexity": "Medio",
    "useCaseExamples": [
      "Un gestor de redes sociales de una agencia de marketing digital utiliza el flujo para categorizar autom谩ticamente las nuevas tareas de contenido (ej. 'crear reel', 'redactar post blog', 'responder comentarios') en Todoist y ajustar su prioridad. Esto permite reducir en un 30% el tiempo manual de organizaci贸n semanal y asegurar que el 95% de las publicaciones se realicen a tiempo para finales del pr贸ximo trimestre.",
      "El equipo de soporte de TI de una empresa implementa el flujo para clasificar las solicitudes de asistencia (ej. 'problema de red', 'restablecimiento de contrase帽a', 'solicitud de nuevo software') que llegan a Todoist, priorizando autom谩ticamente los 'problemas de red' cr铆ticos. El objetivo es mejorar el tiempo de respuesta promedio a incidentes cr铆ticos en un 20% y garantizar que el 90% de los tickets se asignen a la prioridad correcta dentro de los pr贸ximos dos meses.",
      "Un desarrollador freelance usa el flujo para organizar las tareas de m煤ltiples proyectos y clientes en Todoist, categoriz谩ndolas por cliente y tipo de tarea (ej. 'Cliente A - desarrollo backend', 'Cliente B - dise帽o UI/UX', 'Cliente C - reuni贸n de seguimiento') y asignando prioridad seg煤n los plazos. Esto busca reducir el tiempo de gesti贸n manual en un 15% y minimizar en un 50% la p茅rdida de plazos cr铆ticos para finales del trimestre actual.",
      "Un estudiante universitario implementa el flujo para categorizar autom谩ticamente sus tareas acad茅micas en Todoist (ej. 'Matem谩ticas - Ejercicios', 'Literatura - Ensayo', 'Proyecto de Fin de Grado - Investigaci贸n') y ajustar su prioridad bas谩ndose en la fecha de entrega y la importancia de la asignatura. El objetivo es asegurar que al menos el 90% de las tareas se clasifiquen correctamente y ninguna tarea importante se olvide durante el semestre actual.",
      "Una persona utiliza el flujo para gestionar las tareas del hogar y finanzas personales en Todoist, categorizando autom谩ticamente elementos como 'Pagar factura luz', 'Planificar men煤 semanal', 'Cita m茅dico' o 'Revisar presupuesto mensual'. El flujo prioriza las facturas con vencimiento cercano y las citas importantes, buscando reducir el estr茅s por tareas olvidadas en un 25% y asegurar el 100% de pagos puntuales en los pr贸ximos 30 d铆as."
    ],
    "similarities": [
      {
        "workflowId": "flujo-17",
        "workflowName": "#17 - CREATE A NEW TASK IN TODOIST",
        "score": 0.9,
        "reason": "Ambos flujos se centran en Todoist. Este es m谩s avanzado, ya que utiliza IA para categorizar y priorizar tareas existentes, mientras que el flujo 17 es para crear nuevas tareas."
      },
      {
        "workflowId": "flujo-6",
        "workflowName": "#6 - HN WHO IS HIRING SCRAPE",
        "score": 0.65,
        "reason": "Ambos utilizan OpenAI para procesar texto, uno para clasificar tareas y el otro para extraer datos de ofertas de trabajo."
      }
    ]
  },
  {
    "id": "flujo-22",
    "displayId": 22,
    "fileName": "copper-crm.json",
    "flowName": "GESTIN BSICA DE CONTACTOS EN COPPER",
    "shortDescription": "Este flujo de trabajo simple demuestra c贸mo crear, actualizar y obtener datos de contactos (personas) dentro de Copper CRM utilizando una secuencia lineal de nodos.",
    "mainArea": "Ventas",
    "secondaryAreas": [],
    "mainFunction": "Realizar operaciones CRUD (Crear, Actualizar, Obtener) sobre contactos en Copper.",
    "automationDestinations": [
      "Copper CRM"
    ],
    "dataOrigins": [
      "Manual / Interna (datos hardcodeados)"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Copper"
    ],
    "complexity": "Simple",
    "useCaseExamples": [
      "Automatizaci贸n de Nuevos Leads desde Formularios Web: Automatizar la creaci贸n de contactos de nuevos leads en Copper CRM a partir de cada env铆o de formulario web, reduciendo el tiempo de entrada manual de datos en un 95% y asegurando que el 100% de los leads se registren en Copper CRM en menos de 2 minutos, a lograr en el pr贸ximo trimestre fiscal con monitoreo continuo.",
      "Sincronizaci贸n de Estado de Suscripci贸n de Clientes: Sincronizar autom谩ticamente los cambios en el estado de suscripci贸n de los clientes desde una plataforma de facturaci贸n externa (ej. Stripe) a un campo personalizado en Copper CRM. Esto garantizar谩 que el 100% de los cambios se actualicen en Copper CRM en menos de 1 minuto, manteniendo la precisi贸n de los datos y mejorando la visibilidad del ciclo de vida del cliente. Implementaci贸n planificada para las pr贸ximas 3 semanas.",
      "Registro Autom谩tico de Interacciones de Ventas: Registrar autom谩ticamente cada interacci贸n de llamada saliente en Copper CRM, actualizando el campo 'Fecha ltima Interacci贸n' del contacto. El objetivo es asegurar que el 98% de las llamadas registradas se reflejen en Copper CRM en menos de 5 minutos, proporcionando un historial completo para el seguimiento de ventas. Desarrollo y despliegue del flujo de trabajo en el pr贸ximo mes.",
      "Enriquecimiento y Segmentaci贸n de Leads Post-Creaci贸n: Enriquecer autom谩ticamente los nuevos contactos creados en Copper CRM con informaci贸n de la industria y asignarles un segmento de mercado basado en datos externos. Se busca que el 90% de los nuevos contactos tengan los campos 'Industria' y 'Segmento' actualizados en Copper CRM dentro de las 2 horas posteriores a su creaci贸n, para mejorar las estrategias de marketing y ventas. Implementaci贸n completa para el final del pr贸ximo trimestre.",
      "Sincronizaci贸n de Preferencias de Marketing (Opt-out): Sincronizar el estado de 'baja de marketing' de una plataforma de email marketing (ej. Mailchimp) a un campo 'No Contactar Marketing' en Copper CRM. Este flujo garantizar谩 que el 100% de las solicitudes de baja se actualicen en Copper CRM en menos de 3 minutos, evitando cualquier comunicaci贸n accidental y asegurando el cumplimiento normativo. Operativo en la pr贸xima semana y auditado mensualmente."
    ],
    "similarities": [
      {
        "workflowId": "flujo-10",
        "workflowName": "#10 - LEAD QUALIFICATION WITH BATCHDATA",
        "score": 0.7,
        "reason": "Ambos flujos se centran en la gesti贸n de contactos en un CRM. Este flujo realiza operaciones b谩sicas en Copper, mientras que el flujo 10 realiza una calificaci贸n de leads m谩s avanzada con datos externos."
      }
    ]
  },
  {
    "id": "flujo-23",
    "displayId": 23,
    "fileName": "coda-insert.json",
    "flowName": "INSERTAR DATOS EN UNA NUEVA FILA PARA UNA TABLA EN CODA",
    "shortDescription": "Este flujo inserta datos predefinidos, definidos en el nodo 'Set', en una nueva fila de una tabla en Coda cuando se ejecuta manualmente.",
    "mainArea": "Gesti贸n de Datos",
    "secondaryAreas": [],
    "mainFunction": "Insertar datos predefinidos en una nueva fila de una tabla en Coda.",
    "automationDestinations": [
      "Coda"
    ],
    "dataOrigins": [
      "Datos predefinidos en el flujo (nodo Set)"
    ],
    "keyNodes": [
      "Trigger Manual",
      "Set",
      "Coda"
    ],
    "complexity": "Simple",
    "useCaseExamples": [
      "Un supervisor de equipo utiliza este flujo diariamente para registrar el \"Inicio de Turno Matutino\" en una tabla de asistencia en Coda. Los datos predefinidos incluyen \"Turno: Ma帽ana\" y \"Estado: Iniciado\". El objetivo es garantizar que el 100% de los inicios de turno se registren correctamente en Coda cada d铆a laboral, reduciendo el tiempo de registro en un 30% en la pr贸xima semana.",
      "Un asistente comercial activa manualmente este flujo para generar una nueva entrada en la tabla \"Solicitudes de Presupuesto\" de Coda con datos predefinidos como \"Estado: Pendiente\" y \"Tipo de Solicitud: Est谩ndar\". Esto asegura que todas las nuevas solicitudes se inicien de manera estandarizada y se registren en Coda en menos de 1 minuto desde su recepci贸n, mejorando la coherencia en el registro en un 20% en el pr贸ximo mes.",
      "Un gerente de proyecto utiliza este flujo para marcar la \"Finalizaci贸n de Hito Mayor\" en la tabla \"Hitos del Proyecto\" en Coda. El flujo inserta el nombre del hito y el estado \"Completado\" una vez que se ha alcanzado. El objetivo es que todos los hitos clave se registren en Coda en las 24 horas siguientes a su cumplimiento, aumentando la visibilidad del progreso del proyecto en un 15% para el pr贸ximo trimestre.",
      "Un t茅cnico de TI ejecuta este flujo para registrar r谩pidamente un incidente de \"Phishing Detectado\" en la tabla de \"Incidentes de Seguridad\" de Coda, insertando datos predefinidos como \"Tipo: Phishing\", \"Severidad: Media\" y \"Estado: Nuevo\". Esto reduce el tiempo promedio de registro de este tipo de incidentes en un 50% en el pr贸ximo mes, asegurando una respuesta m谩s r谩pida.",
      "Un editor de contenido utiliza este flujo despu茅s de publicar un nuevo art铆culo para registrarlo en la tabla \"Calendario Editorial\" de Coda. Los datos predefinidos incluyen \"Estado: Publicado\", \"Tipo: Art铆culo\" y \"Plataforma: Blog\". Esto garantiza que el 100% de los art铆culos publicados se registren con su estado correcto en Coda el mismo d铆a de su lanzamiento, mejorando la precisi贸n del calendario editorial en un 25%."
    ],
    "similarities": []
  },
  {
    "id": "AI-Powered YouTube Video Summarization & Analysis.txt-1758053719277",
    "displayId": 24,
    "fileName": "AI-Powered YouTube Video Summarization & Analysis.txt",
    "flowName": "Resumen y An谩lisis de Transcripciones de YouTube",
    "mainArea": "An谩lisis de Contenido",
    "secondaryAreas": [
      "Marketing",
      "Educaci贸n",
      "Investigaci贸n"
    ],
    "mainFunction": "Extraer la transcripci贸n de un video de YouTube, resumirla y analizarla usando inteligencia artificial (IA), y luego compartir el resumen y los detalles del video.",
    "automationDestinations": [
      "Telegram",
      "Webhook"
    ],
    "dataOrigins": [
      "Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "YouTube Video ID",
      "YouTube Transcript",
      "Summarize & Analyze Transcript",
      "Response Object",
      "Telegram"
    ],
    "complexity": "Complejo",
    "shortDescription": "Toma un enlace de YouTube, extrae y resume su transcripci贸n con IA, y luego comparte el resumen y los datos del video v铆a Telegram o como respuesta a la llamada inicial.",
    "useCaseExamples": [
      "Un estudiante de ingenier铆a utiliza el flujo de trabajo para resumir conferencias t茅cnicas largas de YouTube, obteniendo puntos clave, definiciones y detalles de implementaci贸n para sus apuntes de estudio.",
      "Un equipo de marketing de contenidos automatiza la creaci贸n de descripciones para blogs y redes sociales a partir de videos de YouTube, usando el resumen estructurado generado para destacar los temas principales.",
      "Un analista de mercado env铆a enlaces de videos de an谩lisis de la industria a este flujo para recibir res煤menes concisos sobre tendencias, ventajas y desventajas de productos, facilitando la toma de decisiones.",
      "Un formador corporativo comparte enlaces de tutoriales de software en YouTube y utiliza los res煤menes generados para crear materiales de capacitaci贸n concisos, enfoc谩ndose en las caracter铆sticas principales y su uso.",
      "Un periodista investiga discursos p煤blicos o entrevistas largas en YouTube; el flujo le permite obtener r谩pidamente los argumentos principales, definiciones y puntos clave mencionados para sus reportajes."
    ],
    "similarities": []
  },
  {
    "id": " Vision-Based AI Agent Scraper - with Google Sheets, ScrapingBee, and Gemini.txt-1758054180103",
    "displayId": 25,
    "fileName": " Vision-Based AI Agent Scraper - with Google Sheets, ScrapingBee, and Gemini.txt",
    "flowName": "Vision-Based AI Agent Scraper - with Google Sheets, ScrapingBee, and Gemini",
    "mainArea": "E-commerce",
    "secondaryAreas": [
      "Marketing",
      "Inteligencia de Negocio",
      "An谩lisis de la Competencia"
    ],
    "mainFunction": "Extrae datos estructurados de p谩ginas web utilizando un agente de IA basado en visi贸n, con un mecanismo de respaldo para el scraping de HTML, y los organiza en Google Sheets.",
    "automationDestinations": [
      "Google Sheets"
    ],
    "dataOrigins": [
      "Manual Trigger",
      "Google Sheets",
      "ScrapingBee"
    ],
    "keyNodes": [
      "Vision-based Scraping Agent",
      "Google Gemini Chat Model",
      "ScrapingBee - Get page screenshot",
      "ScrapingBee- Get page HTML",
      "Structured Output Parser",
      "Google Sheets - Get list of URLs",
      "Google Sheets - Create Rows",
      "HTML-based Scraping Tool",
      "Set fields"
    ],
    "complexity": "Complejo",
    "shortDescription": "Extrae datos estructurados de p谩ginas web (como productos y promociones) usando un agente de IA visionario con Gemini y ScrapingBee, guardando los resultados en Google Sheets.",
    "useCaseExamples": [
      "Monitorear los precios y promociones de productos de la competencia en varias tiendas online, actualizando autom谩ticamente una hoja de c谩lculo de Google con los datos extra铆dos para an谩lisis de mercado.",
      "Extraer detalles de propiedades (precio, n煤mero de habitaciones, 谩rea, caracter铆sticas clave) de listados en portales inmobiliarios, para un an谩lisis de mercado o una base de datos interna.",
      "Recopilar informaci贸n estructurada sobre ofertas de empleo (puesto, empresa, ubicaci贸n, requisitos) de diferentes sitios web de empleo para identificar tendencias en el mercado laboral o para fines de reclutamiento.",
      "Investigar contenido y tendencias de la industria al raspar art铆culos, blogs o p谩ginas de productos de sitios web de la competencia o de publicaciones especializadas para estrategias de marketing.",
      "Rastrear y comparar precios de vuelos, hoteles o paquetes tur铆sticos en sitios web de viajes para identificar las mejores ofertas y mantener una base de datos actualizada de fluctuaciones de precios."
    ],
    "similarities": []
  },
  {
    "id": "_Generate_Graphic_Wallpaper_with_Midjourney,_GPT_4o_mini_&_Canvas.json-1758054912375",
    "displayId": 26,
    "fileName": "_Generate_Graphic_Wallpaper_with_Midjourney,_GPT_4o_mini_&_Canvas.json",
    "flowName": " Generate Graphic Wallpaper with Midjourney, GPT-4o-mini & Canvas APIs",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Dise帽o",
      "Creaci贸n de Contenido",
      "Redes Sociales"
    ],
    "mainFunction": "Generar fondos de pantalla gr谩ficos combinando prompts de texto con GPT-4o-mini, creaci贸n de im谩genes con Midjourney y dise帽o final con Canvas API para producir contenido visualmente atractivo.",
    "automationDestinations": [
      "Midjourney (v铆a PiAPI)",
      "Canvas API"
    ],
    "dataOrigins": [
      "Manual Trigger",
      "PiAPI (GPT-4o-mini)"
    ],
    "keyNodes": [
      "HTTP Request (Midjourney Generator)",
      "HTTP Request (Gpt-4o-mini API)",
      "Code (Get Prompt)",
      "Wait for Midjourney Generation",
      "If (Determine Whether the Image URL was Fetched)",
      "Switch (Check Image Generation Status)",
      "HTTP Request (Design in Canvas)"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo automatiza la creaci贸n de fondos de pantalla gr谩ficos utilizando GPT-4o-mini para generar texto, Midjourney para la imagen y Canvas API para el dise帽o final.",
    "useCaseExamples": [
      "Un especialista en marketing de redes sociales podr铆a usarlo para generar r谩pidamente contenido visual atractivo (imagen y texto) para campa帽as diarias o semanales, adapt谩ndose a temas de tendencia o productos espec铆ficos sin necesidad de un dise帽ador gr谩fico.",
      "Un creador de contenido personal o bloguero podr铆a generar fondos de pantalla o encabezados de art铆culos tem谩ticos y personalizados para sus publicaciones, bas谩ndose en el estado de 谩nimo, la temporada o el enfoque del contenido de su blog.",
      "Una startup o peque帽a empresa podr铆a crear materiales promocionales conceptuales para nuevos productos o servicios, obteniendo r谩pidamente un visual y un mensaje inicial antes de invertir en fotograf铆a profesional o dise帽o avanzado.",
      "Un organizador de eventos podr铆a generar gr谩ficos din谩micos para anunciar oradores, sesiones o hitos del evento, ajustando el tema y el estilo para cada anuncio espec铆fico, manteniendo la coherencia visual.",
      "Una aplicaci贸n de bienestar o autoayuda podr铆a ofrecer a sus usuarios la posibilidad de generar fondos de pantalla motivacionales personalizados, donde el usuario elige un tema (ej. \"superaci贸n\", \"calma\") y el flujo crea un dise帽o 煤nico con una imagen y un mensaje inspirador."
    ],
    "similarities": []
  },
  {
    "id": " Interactive Image Editor with FLUX. Fill Tool for Inpainting.txt-1758054923776",
    "displayId": 27,
    "fileName": " Interactive Image Editor with FLUX. Fill Tool for Inpainting.txt",
    "flowName": "FLUX-fill standalone",
    "mainArea": "Dise帽o Gr谩fico",
    "secondaryAreas": [
      "Marketing",
      "Desarrollo de Producto",
      "E-commerce"
    ],
    "mainFunction": "Permite a los usuarios editar im谩genes en un editor web interactivo, aplicar efectos de 'relleno' impulsados por IA a trav茅s de la API de FLUX, y recibir la imagen procesada de vuelta.",
    "automationDestinations": [
      "API FLUX (api.bfl.ml)",
      "Navegador del Usuario (v铆a Webhook Response)"
    ],
    "dataOrigins": [
      "Webhook",
      "Entrada del Usuario (a trav茅s del editor HTML)"
    ],
    "keyNodes": [
      "Webhook",
      "HTML",
      "HTTP Request",
      "If",
      "Merge",
      "Respond to Webhook"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un flujo interactivo para edici贸n de im谩genes con IA. Ofrece un editor web para que los usuarios modifiquen im谩genes, las procesen con la IA de FLUX y reciban el resultado.",
    "useCaseExamples": [
      "Un vendedor online utiliza el flujo para limpiar imperfecciones en sus fotos de productos, como eliminar el fondo original y reemplazarlo con un estudio virtual o llenar espacios vac铆os en el empaque con un logotipo actualizado.",
      "Un equipo de marketing genera variaciones de una imagen publicitaria. Por ejemplo, en una foto de un producto, enmascaran una zona y usan un prompt para a帽adir un \"ambiente tropical\" o un \"entorno urbano moderno\", adaptando la imagen a diferentes campa帽as.",
      "Un agente inmobiliario utiliza la herramienta para \"pintar\" sobre 谩reas espec铆ficas de las fotos de propiedades, como reemplazar un c茅sped seco por uno \"verde exuberante\" o llenar una pared vac铆a con un \"cuadro abstracto moderno\" para la puesta en escena virtual.",
      "Un gestor de redes sociales adapta una imagen existente para un nuevo post. Enmascara una parte (por ejemplo, un viejo banner) y usa un prompt para insertar \"texto promocional de descuento\" o \"un nuevo logo de campa帽a\" sin necesidad de un dise帽ador gr谩fico.",
      "Un dise帽ador de UI/UX utiliza la herramienta para probar r谩pidamente diferentes elementos visuales en un mockup de interfaz. Enmascara un bot贸n o un icono y lo reemplaza con \"un bot贸n de estilo ne贸n\" o \"un icono de carrito de compras 3D\" para explorar ideas."
    ],
    "similarities": []
  },
  {
    "id": " DeepSeek AI Agent + Telegram + LONG TERM Memory .txt-1758054939716",
    "displayId": 28,
    "fileName": " DeepSeek AI Agent + Telegram + LONG TERM Memory .txt",
    "flowName": " DeepSeek AI Agent + Telegram + LONG TERM Memory ",
    "mainArea": "Asistencia Personal",
    "secondaryAreas": [
      "Servicio al Cliente",
      "Comunicaci贸n"
    ],
    "mainFunction": "Automatizar una conversaci贸n con un agente de IA DeepSeek a trav茅s de Telegram, utilizando memoria a largo plazo almacenada en Google Docs para respuestas personalizadas y contextuales.",
    "automationDestinations": [
      "Telegram",
      "Google Docs"
    ],
    "dataOrigins": [
      "Telegram Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "IF",
      "Switch",
      "AI Agent",
      "Merge",
      "Google Docs",
      "Telegram",
      "Memory Buffer"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un bot de Telegram que utiliza un agente de IA DeepSeek con memoria a largo plazo (Google Docs) para tener conversaciones personalizadas y contextuales.",
    "useCaseExamples": [
      "Un asistente personal que recuerda tus preferencias de programaci贸n, citas importantes y tareas diarias. Aprende tus h谩bitos para ofrecer recordatorios contextuales y sugerencias proactivas a trav茅s de Telegram, adapt谩ndose a tu flujo de trabajo con el tiempo.",
      "Un tutor de idiomas personalizado que guarda tu progreso, vocabulario aprendido y 谩reas de dificultad. El bot puede adaptar las lecciones y ejercicios en futuras interacciones, record谩ndote tus errores comunes y tus temas de inter茅s para mantenerte motivado.",
      "Un agente de soporte VIP para clientes selectos que recuerda el historial de compras del cliente, sus preferencias de productos y problemas anteriores. Esto permite una atenci贸n al cliente altamente personalizada y eficiente, sin necesidad de repetir informaci贸n.",
      "Un entrenador de fitness y bienestar que almacena tus metas de ejercicio, historial de actividad, preferencias diet茅ticas y cualquier lesi贸n. El bot puede ofrecer planes de entrenamiento adaptados, sugerencias de comidas y motivaci贸n basada en tu progreso y tus necesidades espec铆ficas a largo plazo.",
      "Un curador de contenido y noticias que aprende tus intereses en noticias, art铆culos, libros o podcasts. Recuerda tus temas favoritos y fuentes preferidas para recomendarte contenido relevante y filtrado, mejorando sus sugerencias con cada interacci贸n."
    ],
    "similarities": []
  },
  {
    "id": "DeepSeek V Chat & R Reasoning Quick Start.txt-1758054951593",
    "displayId": 29,
    "fileName": "DeepSeek V Chat & R Reasoning Quick Start.txt",
    "flowName": "DeepSeek V3 Chat & R1 Reasoning Quick Start",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Desarrollo de Software",
      "Automatizaci贸n de IA",
      "Investigaci贸n"
    ],
    "mainFunction": "Explorar y demostrar la integraci贸n de los modelos de lenguaje DeepSeek (V3 Chat y R1 Reasoner) y Ollama para procesamiento de lenguaje natural y capacidades de razonamiento, respondiendo a mensajes de chat entrantes.",
    "automationDestinations": [
      "Plataforma de Chat"
    ],
    "dataOrigins": [
      "Plataforma de Chat"
    ],
    "keyNodes": [
      "When chat message received",
      "AI Agent",
      "DeepSeek",
      "Ollama DeepSeek",
      "DeepSeek JSON Body",
      "DeepSeek Raw Body",
      "Window Buffer Memory"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo muestra c贸mo conectar y utilizar los modelos DeepSeek V3 Chat, R1 Reasoner y Ollama para interactuar con un chat, explorando diferentes m茅todos de integraci贸n.",
    "useCaseExamples": [
      "Un chatbot de soporte al cliente en un sitio web que responde preguntas frecuentes sobre productos y servicios, utilizando la memoria para mantener el contexto de la conversaci贸n del usuario y ofrecer respuestas personalizadas y coherentes.",
      "Un asistente para equipos de marketing que genera ideas para contenido, borradores de publicaciones en redes sociales o textos publicitarios, permitiendo a los usuarios interactuar de forma conversacional para refinar y expandir el contenido.",
      "Un tutor virtual interactivo para estudiantes que ayuda a explicar conceptos complejos, resuelve dudas sobre asignaturas espec铆ficas y genera ejercicios pr谩cticos, manteniendo un hilo de aprendizaje continuo gracias a su memoria conversacional.",
      "Una herramienta interna para equipos de desarrollo que permite a los ingenieros hacer preguntas sobre c贸digo, obtener explicaciones de funciones o depurar problemas, con el agente recordando el historial de consultas para proporcionar asistencia relevante.",
      "Un asistente de productividad personal que ayuda a los usuarios a organizar sus tareas diarias, generar listas de ideas, planificar horarios o recordar compromisos importantes, todo a trav茅s de una interfaz de chat interactiva que recuerda preferencias y contextos previos."
    ],
    "similarities": []
  },
  {
    "id": " Receive Daily Market News from FT.com to your Microsoft outlook inbox.txt-1758054966565",
    "displayId": 30,
    "fileName": " Receive Daily Market News from FT.com to your Microsoft outlook inbox.txt",
    "flowName": "Financial News Recap Workflow",
    "mainArea": "Finanzas",
    "secondaryAreas": [
      "An谩lisis de Contenido",
      "Inteligencia de Mercado",
      "Comunicaci贸n"
    ],
    "mainFunction": "Automatizar la extracci贸n, resumen por IA y env铆o diario por correo electr贸nico de noticias financieras clave para inversores.",
    "automationDestinations": [
      "Microsoft Outlook"
    ],
    "dataOrigins": [
      "Schedule Trigger",
      "HTTP Request (ft.com)"
    ],
    "keyNodes": [
      "Schedule Trigger",
      "HTTP Request",
      "HTML",
      "SET",
      "AI Agent",
      "Google Gemini Chat Model",
      "Microsoft Outlook"
    ],
    "complexity": "Medio",
    "shortDescription": "Extrae noticias financieras de la web, las resume usando inteligencia artificial y env铆a un email diario con un resumen para inversores.",
    "useCaseExamples": [
      "Un gestor de inversiones configura el flujo para recibir un resumen diario de las noticias financieras clave del Financial Times cada ma帽ana a las 7 AM, permiti茅ndole tomar decisiones informadas sobre las carteras de sus clientes antes de la apertura del mercado.",
      "Un analista de mercado utiliza este flujo para obtener una s铆ntesis diaria de titulares y noticias econ贸micas, facilitando la identificaci贸n r谩pida de tendencias y la preparaci贸n de sus informes de mercado sin tener que leer extensos art铆culos.",
      "Un inversor particular activo desea recibir un correo electr贸nico estructurado con las noticias financieras m谩s importantes, lo que le ahorra tiempo y le ayuda a mantenerse al d铆a con los eventos que impactan sus inversiones.",
      "Un directivo de empresa (CEO o CFO) necesita estar al tanto del panorama econ贸mico global y las noticias de Europa sin dedicar horas a la lectura, recibiendo un bolet铆n diario automatizado con los puntos m谩s relevantes para la estrategia empresarial.",
      "Un equipo de inteligencia de negocio en una corporaci贸n configura este flujo para monitorear las noticias financieras y de la industria, usando el resumen generado por IA para alimentar sus informes estrat茅gicos y an谩lisis de riesgo."
    ],
    "similarities": []
  },
  {
    "id": " Perplexity Research to HTML AI-Powered Content Creation.txt-1758054988046",
    "displayId": 31,
    "fileName": " Perplexity Research to HTML AI-Powered Content Creation.txt",
    "flowName": "锔Perplexity Researcher to HTML Web Page",
    "mainArea": "Marketing Digital",
    "secondaryAreas": [
      "Contenido",
      "Desarrollo Web",
      "Investigaci贸n"
    ],
    "mainFunction": "Investiga un tema dado utilizando Perplexity, estructura la informaci贸n en un formato de art铆culo, extrae los datos clave en JSON y luego convierte el art铆culo en una p谩gina web HTML estilizada con Tailwind CSS, con la opci贸n de enviar una notificaci贸n por Telegram.",
    "automationDestinations": [
      "P谩gina Web HTML (salida)",
      "Telegram",
      "Webhook (respuesta)"
    ],
    "dataOrigins": [
      "Webhook",
      "Perplexity (API)"
    ],
    "keyNodes": [
      "Webhook",
      "Perplexity Topic Agent",
      "Extract JSON",
      "Create HTML Article",
      "Basic LLM Chain",
      "If",
      "Respond to Webhook"
    ],
    "complexity": "Complejo",
    "shortDescription": "Automatiza la investigaci贸n de temas con Perplexity, la creaci贸n de art铆culos y su conversi贸n a p谩ginas web HTML estilizadas con Tailwind CSS, respondiendo v铆a Webhook y enviando notificaciones por Telegram.",
    "useCaseExamples": [
      "Un blogger introduce un tema (por ejemplo, \"ltimas tendencias en IA para 2024\") y el flujo de trabajo investiga, estructura y genera una p谩gina web HTML completa con estilo Tailwind CSS, lista para ser publicada en su blog personal.",
      "Un equipo de marketing necesita generar r谩pidamente contenido para m煤ltiples p谩ginas de destino sobre diferentes caracter铆sticas de un producto. El equipo env铆a los temas a trav茅s de webhooks y recibe al instante p谩ginas HTML estilizadas para cada caracter铆stica.",
      "Un creador de cursos en l铆nea utiliza el flujo de trabajo para transformar descripciones de m贸dulos (por ejemplo, \"Conceptos b谩sicos de la computaci贸n cu谩ntica\") en lecciones HTML bien organizadas y f谩ciles de leer para sus estudiantes.",
      "Una peque帽a empresa de noticias tecnol贸gicas automatiza la creaci贸n de res煤menes de art铆culos sobre temas de actualidad. Ingresan un tema de noticias y obtienen una p谩gina HTML concisa con los puntos clave, metadatos y hashtags, para una publicaci贸n r谩pida.",
      "Un profesional de SEO desea generar borradores iniciales de contenido web optimizado para palabras clave espec铆ficas. Env铆a las palabras clave al flujo de trabajo, que devuelve p谩ginas HTML estructuradas y con formato que pueden ajustarse para mejorar el ranking."
    ],
    "similarities": []
  },
  {
    "id": " Private & Local Ollama Self-Hosted AI Assistant.txt-1758054999297",
    "displayId": 32,
    "fileName": " Private & Local Ollama Self-Hosted AI Assistant.txt",
    "flowName": "锔Ollama Chat",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Automatizaci贸n",
      "Servicio al Cliente",
      "Desarrollo de Software"
    ],
    "mainFunction": "Procesar mensajes de chat utilizando un modelo de lenguaje Llama 3.2 a trav茅s de Ollama y devolver una respuesta estructurada.",
    "automationDestinations": [
      "Chat (respuesta estructurada)"
    ],
    "dataOrigins": [
      "Chat Trigger"
    ],
    "keyNodes": [
      "When chat message received",
      "Basic LLM Chain",
      "Ollama Model",
      "JSON to Object",
      "Structured Response"
    ],
    "complexity": "Medio",
    "shortDescription": "Permite interactuar con un modelo de lenguaje Llama 3.2 mediante un chat, procesando la entrada y devolviendo una respuesta en formato JSON.",
    "useCaseExamples": [
      "Un chatbot de soporte al cliente para una tienda en l铆nea, donde los usuarios pueden preguntar sobre el estado de sus pedidos, pol铆ticas de devoluci贸n o detalles de productos, y el flujo de trabajo usa Llama 3.2 para generar respuestas r谩pidas y precisas.",
      "Un asistente de contenido para un equipo de marketing que permite a los usuarios introducir prompts para generar ideas de publicaciones en redes sociales, borradores de correos electr贸nicos o esl贸ganes, recibiendo la salida en un formato estructurado para revisi贸n.",
      "Una herramienta de consulta interna para empleados donde pueden hacer preguntas sobre pol铆ticas de la empresa, beneficios o procesos de recursos humanos, obteniendo respuestas automatizadas del modelo Ollama.",
      "Un generador de ideas creativas para escritores o dise帽adores, donde pueden solicitar inspiraci贸n para tramas de historias, nombres de personajes o conceptos de dise帽o, y el LLM les proporciona sugerencias estructuradas.",
      "Un tutor virtual b谩sico para estudiantes que necesitan explicaciones r谩pidas sobre conceptos complejos en historia, ciencia o matem谩ticas, con el flujo de trabajo proporcionando respuestas concisas generadas por el modelo Llama 3.2."
    ],
    "similarities": []
  },
  {
    "id": "ヰ AI Agent for nn Creators Leaderboard - Find Popular Workflows.txt-1758055015316",
    "displayId": 33,
    "fileName": "ヰ AI Agent for nn Creators Leaderboard - Find Popular Workflows.txt",
    "flowName": "ヰ AI Agent for n8n Creators Leaderboard - Find Popular Workflows",
    "mainArea": "An谩lisis de Datos",
    "secondaryAreas": [
      "Gesti贸n de Comunidad",
      "Reportes",
      "Inteligencia Artificial"
    ],
    "mainFunction": "Obtiene, procesa y analiza estad铆sticas de creadores y flujos de trabajo de n8n de un repositorio de GitHub, para generar un informe Markdown detallado utilizando un agente de IA.",
    "automationDestinations": [
      "Sistema de Archivos Local",
      "Interfaz de Chat"
    ],
    "dataOrigins": [
      "GitHub",
      "Chat",
      "Webhook"
    ],
    "keyNodes": [
      "When chat message received",
      "httpRequest",
      "set",
      "filter",
      "merge",
      "agent",
      "lmChatOpenAi",
      "readWriteFile"
    ],
    "complexity": "Complejo",
    "shortDescription": "Genera un informe detallado sobre la popularidad y estad铆sticas de los creadores y flujos de trabajo de n8n, utilizando IA para procesar datos de GitHub.",
    "useCaseExamples": [
      "Un gestor de la comunidad de n8n utiliza el flujo de trabajo para generar informes mensuales detallados sobre los creadores m谩s activos y sus flujos de trabajo con mayor impacto, con el fin de reconocer sus contribuciones y promover contenido relevante.",
      "Un creador de contenido educativo sobre n8n investiga a un contribuyente popular para entender qu茅 hace que sus flujos de trabajo sean tan atractivos, utilizando el informe generado para identificar caracter铆sticas clave y casos de uso exitosos para sus propios tutoriales.",
      "Una empresa de consultor铆a de automatizaci贸n emplea este flujo para analizar las tendencias de adopci贸n de flujos de trabajo espec铆ficos de n8n, identificando los creadores m谩s influyentes y los tipos de automatizaciones m谩s demandadas para ajustar su estrategia de mercado.",
      "Un l铆der de equipo que busca contratar talentos en automatizaci贸n usa el flujo para evaluar el perfil p煤blico de posibles candidatos de n8n, obteniendo un resumen de sus flujos de trabajo, su popularidad y su impacto en la comunidad.",
      "Un desarrollador individual de n8n ejecuta el flujo para obtener un informe exhaustivo de sus propios flujos de trabajo, analizando m茅tricas de visitas e inserciones para identificar oportunidades de mejora y entender mejor la resonancia de sus contribuciones en la comunidad."
    ],
    "similarities": []
  },
  {
    "id": " Telegram Messaging Agent for Text Audio Images.txt-1758055027543",
    "displayId": 34,
    "fileName": " Telegram Messaging Agent for Text Audio Images.txt",
    "flowName": " Telegram Messaging Agent for Text/Audio/Images",
    "mainArea": "Comunicaci贸n",
    "secondaryAreas": [
      "Soporte al Cliente",
      "Inteligencia Artificial",
      "Gesti贸n de Contenido"
    ],
    "mainFunction": "Act煤a como un agente de mensajer铆a de Telegram que recibe eventos, valida usuarios y procesa mensajes de texto, audio e im谩genes utilizando servicios de IA para transcripci贸n, an谩lisis y clasificaci贸n, enviando respuestas contextuales.",
    "automationDestinations": [
      "Telegram",
      "OpenAI"
    ],
    "dataOrigins": [
      "Webhook"
    ],
    "keyNodes": [
      "webhook",
      "if",
      "switch",
      "telegram",
      "httpRequest",
      "openAi",
      "lmChatOpenAi",
      "textClassifier"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un agente de Telegram que procesa mensajes de texto, audio e im谩genes mediante IA, valida usuarios y responde de forma contextual.",
    "useCaseExamples": [
      "Un usuario env铆a notas de voz a su bot de Telegram para crear tareas y recordatorios. El bot transcribe la voz, clasifica el mensaje como una tarea y lo registra en su lista de pendientes, enviando una confirmaci贸n al usuario.",
      "Un equipo de soporte utiliza el bot para recibir reportes de errores. Los usuarios env铆an mensajes de texto con descripciones o im谩genes del problema. El bot analiza el texto y las im谩genes, clasificando el incidente y extrayendo detalles clave para el equipo.",
      "Un fot贸grafo profesional usa el bot para organizar sus inspiraciones. Env铆a im谩genes con subt铆tulos descriptivos, y el bot analiza la imagen y el texto para clasificarla y etiquetarla autom谩ticamente en una base de datos de referencias visuales.",
      "Una persona con discapacidad visual utiliza el bot para 'leer' el mundo a su alrededor. Env铆a fotos de objetos o textos y el bot, tras analizar la imagen, le devuelve una descripci贸n detallada por mensaje de texto.",
      "Un periodista en el campo env铆a grabaciones de voz cortas a su bot. El bot transcribe el audio, identifica los temas principales y clasifica la informaci贸n para ayudar a organizar r谩pidamente las ideas para sus art铆culos."
    ],
    "similarities": []
  },
  {
    "id": "  AI Agent for Top nn Creators Leaderboard Reporting.txt-1758055039554",
    "displayId": 35,
    "fileName": "  AI Agent for Top nn Creators Leaderboard Reporting.txt",
    "flowName": " AI Agent for Top n8n Creators Leaderboard Reporting",
    "mainArea": "An谩lisis de Datos",
    "secondaryAreas": [
      "Gesti贸n de Comunidad",
      "Marketing",
      "Inteligencia Artificial"
    ],
    "mainFunction": "Recopila, analiza y genera informes detallados sobre las estad铆sticas de rendimiento de creadores y flujos de trabajo de la comunidad n8n utilizando un agente de IA, y distribuye estos informes a trav茅s de m煤ltiples canales.",
    "automationDestinations": [
      "Google Drive",
      "Gmail",
      "Telegram",
      "Sistema de Archivos Local"
    ],
    "dataOrigins": [
      "GitHub (mediante HTTP Request)",
      "Disparador de n8n (Programado o por ejecuci贸n externa)"
    ],
    "keyNodes": [
      "httpRequest",
      "set",
      "Split Out",
      "Sort",
      "Merge",
      "n8n Creators Stats Agent (Agente de IA)",
      "lmChatOpenAi",
      "lmChatGoogleGemini",
      "Workflow Tool",
      "Google Drive",
      "Gmail",
      "Telegram",
      "markdown",
      "limit"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un flujo de trabajo de n8n que emplea un agente de IA para extraer y analizar estad铆sticas de creadores y flujos de trabajo de la comunidad desde GitHub, generando y distribuyendo informes detallados por email, Google Drive y Telegram.",
    "useCaseExamples": [
      "Un Community Manager de n8n programa el flujo de trabajo para que se ejecute semanalmente, generando informes detallados sobre los creadores m谩s activos y los flujos de trabajo m谩s populares. Utiliza estos datos para destacar a los contribuidores en las redes sociales y en el bolet铆n informativo de la comunidad, fomentando la participaci贸n y el reconocimiento.",
      "El equipo de Desarrollo de Producto de n8n utiliza este flujo para identificar tendencias en la creaci贸n de flujos de trabajo y el uso de integraciones espec铆ficas. Los informes generados por la IA les ayudan a comprender las necesidades de los usuarios y a priorizar nuevas caracter铆sticas o mejoras en la plataforma.",
      "Un especialista en marketing de una empresa de automatizaci贸n desea mostrar la vitalidad y la innovaci贸n de la comunidad n8n. Configura el flujo para recibir un informe mensual con los 10 mejores flujos de trabajo y sus creadores, usando esta informaci贸n para crear contenido (como estudios de caso o art铆culos de blog) que demuestre el valor de la plataforma a clientes potenciales.",
      "Un instructor o educador de n8n ejecuta el flujo antes de preparar un nuevo curso o taller. Los informes detallados le permiten identificar los flujos de trabajo m谩s relevantes y con mayor impacto en la comunidad, lo que le ayuda a dise帽ar un curr铆culo que aborde directamente las soluciones y patrones de automatizaci贸n m谩s buscados.",
      "Un usuario avanzado de n8n o un consultor de automatizaci贸n configura este flujo para mantenerse actualizado sobre los flujos de trabajo m谩s innovadores y los creadores destacados. Recibe un resumen diario o semanal a trav茅s de Telegram o correo electr贸nico, lo que le permite explorar nuevas ideas, aprender de las mejores pr谩cticas de la comunidad y aplicar soluciones probadas en sus propios proyectos o los de sus clientes."
    ],
    "similarities": []
  },
  {
    "id": " AI Agent Chatbot + LONG TERM Memory + Note Storage + Telegram.txt-1758055052679",
    "displayId": 36,
    "fileName": " AI Agent Chatbot + LONG TERM Memory + Note Storage + Telegram.txt",
    "flowName": " AI Agent Chatbot + LONG TERM Memory + Note Storage + Telegram",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Productividad",
      "Asistencia Personal",
      "Gesti贸n del Conocimiento",
      "Comunicaci贸n"
    ],
    "mainFunction": "Procesar mensajes de chat recibidos para un agente de IA, utilizando memoria a largo plazo y almacenamiento de notas en Google Docs, memoria de conversaci贸n a corto plazo, y responder a trav茅s de Telegram.",
    "automationDestinations": [
      "Telegram",
      "Google Docs"
    ],
    "dataOrigins": [
      "Chat (disparador de mensaje de chat)",
      "Google Docs"
    ],
    "keyNodes": [
      "When chat message received",
      "AI Tools Agent",
      "gpt-4o-mini",
      "Window Buffer Memory",
      "Retrieve Long Term Memories",
      "Save Long Term Memories",
      "Retrieve Notes",
      "Save Notes",
      "Telegram Response",
      "Merge",
      "Aggregate"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un chatbot de IA con capacidad de memoria a largo plazo y almacenamiento de notas, que interact煤a a trav茅s de mensajes de chat y responde por Telegram, utilizando Google Docs para la persistencia de datos.",
    "useCaseExamples": [
      "**Asistente Personal Inteligente**: Un usuario lo utiliza para gestionar su agenda diaria, guardar recordatorios de citas y tareas, y almacenar preferencias personales como restaurantes favoritos o libros le铆dos. El bot recuerda sus h谩bitos y le asiste de forma proactiva a trav茅s de Telegram.",
      "**Soporte al Cliente Personalizado**: Una empresa implementa el chatbot en Telegram para que sus clientes puedan hacer consultas. El bot recuerda el historial de compras del cliente, sus problemas anteriores y sus preferencias, ofreciendo una atenci贸n m谩s r谩pida y relevante sin repetir informaci贸n.",
      "**Mentor Educativo y de Aprendizaje**: Estudiantes interact煤an con el bot para repasar materias o aprender nuevas habilidades. El bot guarda un registro de su progreso, los temas que les resultan dif铆ciles y sus m茅todos de estudio preferidos, adaptando la ense帽anza y los ejercicios a sus necesidades espec铆ficas.",
      "**Bot de Gesti贸n de Proyectos para Equipos**: Un equipo de trabajo usa el bot en Telegram para coordinar tareas. El bot almacena los roles de los miembros, las decisiones clave tomadas, los plazos del proyecto y las notas importantes, facilitando el seguimiento y la comunicaci贸n del equipo.",
      "**Entrenador de Salud y Bienestar**: Un individuo lo usa para registrar sus h谩bitos alimenticios, rutinas de ejercicio y objetivos de bienestar. El bot recuerda sus preferencias diet茅ticas, alergias y progreso f铆sico, ofreciendo sugerencias personalizadas y recordatorios para mantener la disciplina."
    ],
    "similarities": []
  },
  {
    "id": " Local Multi-LLM Testing & Performance Tracker.txt-1758055062684",
    "displayId": 37,
    "fileName": " Local Multi-LLM Testing & Performance Tracker.txt",
    "flowName": "Testing Mulitple Local LLM with LM Studio",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Desarrollo de Software",
      "An谩lisis de Datos",
      "Investigaci贸n y Desarrollo"
    ],
    "mainFunction": "Evaluar y analizar el rendimiento de m煤ltiples modelos de lenguaje grandes (LLMs) locales desde LM Studio, calculando m茅tricas como legibilidad, conteo de palabras y tiempo de respuesta, y registrando los resultados en una hoja de c谩lculo.",
    "automationDestinations": [
      "Google Sheets"
    ],
    "dataOrigins": [
      "Cuando se recibe un mensaje de chat (Trigger de LangChain)",
      "LM Studio API (Solicitud HTTP)"
    ],
    "keyNodes": [
      "When chat message received",
      "Get Models",
      "Run Model with Dunamic Inputs",
      "Analyze LLM Response Metrics",
      "Save Results to Google Sheets",
      "Set",
      "Date Time"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo de trabajo permite probar y comparar el rendimiento de diferentes modelos de lenguaje locales (LLMs) hospedados en LM Studio, analizando m茅tricas de respuesta y registrando los resultados en Google Sheets.",
    "useCaseExamples": [
      "Una agencia de marketing digital puede comparar varios modelos LLM locales para generar descripciones de productos, evaluando cu谩l produce las respuestas m谩s concisas y con el nivel de legibilidad adecuado para una audiencia espec铆fica, por ejemplo, nivel de \"5to grado\".",
      "Un equipo de desarrollo de chatbots puede utilizar este flujo para probar diferentes modelos de lenguaje en LM Studio, enviando preguntas frecuentes y analizando la claridad, la longitud de las respuestas y el tiempo de respuesta de cada modelo para seleccionar el m谩s eficiente para soporte al cliente.",
      "Un creador de contenido educativo podr铆a evaluar diversos LLMs para generar explicaciones de temas complejos, asegur谩ndose de que las respuestas cumplan con un alto puntaje de legibilidad (Flesch-Kincaid) para que sean f谩cilmente comprensibles para estudiantes j贸venes.",
      "Un ingeniero de IA puede optimizar los par谩metros de modelos LLM (como temperatura y \"top P\") para una aplicaci贸n espec铆fica, comparando c贸mo afectan la concisi贸n y la calidad de las respuestas en escenarios de uso controlados y registrando los resultados en una hoja de c谩lculo.",
      "Una empresa de an谩lisis de texto puede usar el flujo para comparar la capacidad de diferentes LLMs para resumir documentos largos en textos breves y muy legibles, monitoreando el recuento de palabras, la longitud promedio de las oraciones y el tiempo de procesamiento."
    ],
    "similarities": []
  }
]

    