
[
  {
    "id": 1,
    "workflow_uuid": "flujo-1",
    "fileName": "nostr-reporting.json",
    "flowName": "#️⃣NOSTR #DAMUS AI POWERED REPORTING + GMAIL + TELEGRAM",
    "shortDescription": "Este flujo automatiza la recopilación de hilos de Nostr con el hashtag #damus, emplea IA (Google Gemini) para extraer y analizar temas, y luego genera informes estructurados que se envían por correo electrónico a través de Gmail y como mensajes a través de Telegram.",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [],
    "mainFunction": "Generar y distribuir informes detallados sobre temas y conversaciones de la red social Nostr (específicamente #damus) utilizando capacidades de IA para el análisis de texto.",
    "automationDestinations": [
      "Gmail",
      "Telegram"
    ],
    "dataOrigins": [
      "Nostr"
    ],
    "keyNodes": [
      "Nostr Read #damus",
      "ChainLlm",
      "lmChatGoogleGemini",
      "Markdown",
      "Gmail",
      "Telegram",
      "Aggregate",
      "Merge"
    ],
    "complexity": "Complejo",
    "useCaseExamples": [
      "Una startup que desarrolla una aplicación social descentralizada monitorea en tiempo real el sentimiento y las tendencias emergentes en Nostr en relacionadas con #damus para informar el desarrollo de su propio producto. El objetivo es identificar los 3 temas más discutidos (positivos o negativos) sobre #damus cada semana para priorizar mejoras en su aplicación, apuntando a un aumento del 15% en la satisfacción del usuario en el próximo trimestre. Reciben informes semanales los lunes por la mañana a través de Telegram y Gmail.",
      "Un gestor de comunidad para una plataforma Web3 utiliza el flujo de trabajo para detectar menciones críticas o feedback negativo sobre #damus en Nostr, permitiendo una respuesta proactiva. Esto busca reducir el tiempo de respuesta a problemas críticos de la comunidad en un 20% al identificar y abordar 5 problemas potenciales en un plazo de 24 horas cada semana. Reciben alertas diarias por Telegram sobre temas de alta prioridad y un resumen semanal por Gmail.",
      "Un periodista especializado en tecnologías descentralizadas busca identificar rápidamente temas candentes y narrativas emergentes sobre #damus en Nostr para generar ideas de contenido original y oportuno. Su meta es generar al menos 2 ideas de artículos o informes de noticias por semana basadas en los análisis de IA, resultando en un aumento del 10% en el engagement de la audiencia en los próximos dos meses. Reciben un informe quincenal con los temas principales y sus análisis un viernes por la tarde, para la planificación de la siguiente semana.",
      "Un equipo de desarrollo de un cliente de Nostr recopila automáticamente sugerencias de funciones y reportes de errores relacionados con #damus publicados por los usuarios en la red. El equipo busca identificar 3 nuevas solicitudes de funciones o reportes de errores recurrentes al mes, integrándolos en el backlog del producto en un plazo de 30 días, mejorando la hoja de ruta del producto en un 15% para el final del trimestre. Reciben un informe mensual consolidado a principios de cada mes vía Gmail y un resumen por Telegram sobre feedback crítico en tiempo real.",
      "Un investigador en sociología digital estudia la evolución del discurso y la polarización en torno a #damus en Nostr para un estudio académico sobre la formación de comunidades en redes descentralizadas. Se propone recopilar y analizar 1000 hilos por mes, identificando al menos 2 cambios significativos en el sentimiento o los temas dominantes cada trimestre, contribuyendo a la publicación de un artículo de investigación en 12 meses. Reciben informes trimestrales detallados por Gmail que resuman las tendencias y el sentimiento, y alertas mensuales de Telegram sobre anomalías detectadas."
    ],
    "similarities": [
      {
        "workflowId": 15,
        "workflowName": "#15 - NEW TWEETS",
        "score": 0.75,
        "reason": "Ambos flujos monitorean una red social (Nostr y Twitter) para recopilar datos, aunque usan diferentes destinos y métodos de procesamiento."
      }
    ]
  }
]
