[
  {
    "workflow_uuid": "⚡AI-Powered YouTube Video Summarization & Analysis.txt-1758062058823",
    "fileName": "⚡AI-Powered YouTube Video Summarization & Analysis.txt",
    "flowName": "Resumen Inteligente de Transcripciones de YouTube",
    "mainArea": "Contenido y Medios",
    "secondaryAreas": [
      "Educación",
      "Investigación",
      "Marketing",
      "Productividad"
    ],
    "mainFunction": "Procesa una URL de YouTube para obtener su transcripción, la resume utilizando inteligencia artificial y luego envía el resumen resultante a través de un webhook o a Telegram.",
    "automationDestinations": [
      "Webhook",
      "Telegram"
    ],
    "dataOrigins": [
      "Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "YouTube Transcript",
      "Concatenate",
      "Summarize & Analyze Transcript",
      "gpt-4o-mini",
      "Respond to Webhook",
      "Telegram"
    ],
    "complexity": "Medio",
    "shortDescription": "Toma una URL de YouTube, extrae y resume su transcripción con IA, y envía el resumen a un webhook o Telegram.",
    "useCaseExamples": [
      "Un estudiante universitario o investigador puede usar este flujo para obtener resúmenes técnicos estructurados de conferencias, seminarios o tutoriales complejos alojados en YouTube, lo que le permite extraer rápidamente definiciones, características y detalles de implementación para sus trabajos o estudios.",
      "Un equipo de marketing de contenidos puede automatizar la creación de borradores para artículos de blog, descripciones SEO optimizadas para videos o publicaciones para redes sociales, utilizando los resúmenes estructurados generados a partir de sus propios videos de YouTube, potenciando así su estrategia de contenido.",
      "Una empresa puede emplear este flujo para procesar videos de capacitación interna (subidos a YouTube como privados o no listados) y generar guías rápidas o puntos clave para sus empleados, facilitando la revisión y comprensión del material de formación.",
      "Un analista de mercado o producto puede monitorear videos de reseñas de productos o análisis de la competencia en YouTube, usando el flujo para obtener resúmenes estructurados que destaquen ventajas, desventajas y aspectos técnicos relevantes para la toma de decisiones.",
      "Periodistas o curadores de contenido pueden alimentar el flujo con enlaces a videos de noticias, documentales o entrevistas de YouTube para generar rápidamente resúmenes estructurados de los eventos o temas discutidos, agilizando el proceso de seguimiento y difusión de información."
    ],
    "similarities": [],
    "id": 1,
    "isFavorite": true,
    "notes": ""
  },
  {
    "workflow_uuid": "✨ Vision-Based AI Agent Scraper - with Google Sheets, ScrapingBee, and Gemini.txt-1758064149368",
    "fileName": "✨ Vision-Based AI Agent Scraper - with Google Sheets, ScrapingBee, and Gemini.txt",
    "flowName": "Vision-Based AI Agent Scraper - with Google Sheets, ScrapingBee, and Gemini",
    "mainArea": "E-commerce",
    "secondaryAreas": [
      "Inteligencia de Mercado",
      "Análisis de Datos",
      "Investigación de Mercados"
    ],
    "mainFunction": "Extraer datos estructurados (títulos, precios, marcas, promociones) de páginas web utilizando un agente de IA basado en visión, con un respaldo de raspado HTML, y almacenar los resultados en Google Sheets.",
    "automationDestinations": [
      "Google Sheets"
    ],
    "dataOrigins": [
      "Google Sheets",
      "Manual Trigger"
    ],
    "keyNodes": [
      "Vision-based Scraping Agent",
      "Google Gemini Chat Model",
      "ScrapingBee - Get page screenshot",
      "ScrapingBee- Get page HTML",
      "Structured Output Parser",
      "Google Sheets - Get list of URLs",
      "Google Sheets - Create Rows",
      "Split Out",
      "HTML to Markdown"
    ],
    "complexity": "Complejo",
    "shortDescription": "Extrae automáticamente datos estructurados de páginas web (ej. productos de e-commerce) usando un agente de IA (Gemini) que combina captura de pantalla y raspado HTML, y los guarda en Google Sheets.",
    "useCaseExamples": [
      "Una tienda online necesita monitorear constantemente los precios y las promociones de productos clave de sus competidores para ajustar su propia estrategia de precios. El flujo de trabajo puede visitar las URLs de los productos de la competencia, extraer el título, precio, marca y detalles de la promoción, y almacenarlos en una hoja de Google Sheets para un análisis comparativo.",
      "Una empresa que vende productos de diferentes fabricantes necesita poblar su catálogo online. Utilizaría el flujo de trabajo para raspar las páginas de productos de los fabricantes, extrayendo títulos, descripciones básicas, precios y marcas para su importación masiva en su propio sistema o para revisión.",
      "Un analista de mercado desea recopilar rápidamente datos estructurados sobre nuevos lanzamientos de productos o tendencias en diferentes mercados online. El flujo extraería automáticamente el nombre del producto, la marca, el precio y si existe alguna oferta especial de los sitios web de venta para un análisis de tendencias.",
      "Una agencia de marketing de afiliación busca identificar las mejores ofertas y promociones en diferentes minoristas para sus campañas. El flujo de trabajo raspa las páginas de productos, identificando el precio original, el precio de oferta, el porcentaje de descuento y la disponibilidad, registrándolos en una hoja para su promoción.",
      "Un equipo de compras empresariales necesita rastrear la disponibilidad y los precios de los componentes de hardware o software de varios proveedores. El flujo automatiza la extracción de detalles del producto, precios y si hay descuentos por volumen, centralizando la información en Google Sheets para facilitar las decisiones de compra."
    ],
    "similarities": [],
    "id": 2,
    "isFavorite": true,
    "notes": ""
  },
  {
    "workflow_uuid": "✨_Generate_Graphic_Wallpaper_with_Midjourney,_GPT_4o_mini_&_Canvas.json-1758064167594",
    "fileName": "✨_Generate_Graphic_Wallpaper_with_Midjourney,_GPT_4o_mini_&_Canvas.json",
    "flowName": "Generate Graphic Wallpaper with Midjourney, GPT-4o-mini & Canvas APIs",
    "mainArea": "Diseño Gráfico",
    "secondaryAreas": [
      "Marketing Digital",
      "Creación de Contenido",
      "Redes Sociales"
    ],
    "mainFunction": "Generar fondos de pantalla gráficos con texto creativo, combinando prompts de GPT-4o-mini, la capacidad de generación de imágenes de Midjourney y el diseño final a través de la API de Canvas.",
    "automationDestinations": [
      "Canvas API"
    ],
    "dataOrigins": [
      "Manual Trigger",
      "Parámetros de entrada (Basic Params)",
      "PiAPI (GPT-4o-mini, Midjourney)"
    ],
    "keyNodes": [
      "HTTP Request",
      "Code",
      "IF",
      "Switch",
      "Wait",
      "Set"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo automatiza la creación de fondos de pantalla combinando texto generado por GPT-4o-mini con imágenes de Midjourney y los integra en un diseño final utilizando la API de Canvas.",
    "useCaseExamples": [
      "Creación automatizada de contenido inspirador para redes sociales: Una marca personal o una cuenta de influencer quiere publicar diariamente imágenes con frases motivacionales. El flujo permite definir un tema general (ej. \"superación\", \"bienestar\") y un estilo visual, generando automáticamente gráficos impactantes con texto resonante para plataformas como Instagram o Facebook.",
      "Generación de fondos de pantalla personalizados para dispositivos móviles: Un usuario desea un fondo de pantalla único que refleje su estado de ánimo o sus aspiraciones. Puede introducir un \"escenario\" (ej. \"buscando paz interior\", \"necesitando motivación para el trabajo\") y un \"tema\" (ej. \"serenidad\", \"productividad\"), y el flujo le entregará un wallpaper gráfico personalizado.",
      "Diseño rápido de materiales promocionales para eventos o campañas: Los organizadores de un evento (concierto, webinar, lanzamiento de producto) necesitan varios gráficos para promocionar diferentes aspectos. Con solo definir el tema del evento y el mensaje clave, el flujo puede crear imágenes y texto que evocan la emoción deseada para carteles digitales o anuncios.",
      "Creación de portadas o banners para blogs y artículos: Un blogger o periodista necesita imágenes visualmente atractivas para acompañar sus artículos. El flujo puede tomar el concepto principal del artículo (tema) y el tono (escenario) para generar un banner o una imagen de cabecera que capture la esencia del contenido con un mensaje conciso.",
      "Desarrollo de arte conceptual para videojuegos o proyectos creativos: Un equipo de desarrollo de videojuegos o diseñadores de productos necesita explorar rápidamente diferentes estilos visuales y mensajes para sus proyectos. Pueden alimentar el flujo con \"estilos\" (ej. \"ciberpunk distópico\", \"fantasía épica\") y \"temas\" (ej. \"exploración de mundos\", \"lucha contra la adversidad\") para obtener varias opciones de arte conceptual con texto descriptivo."
    ],
    "similarities": [],
    "id": 3,
    "isFavorite": true,
    "notes": ""
  },
  {
    "workflow_uuid": "🎨 Interactive Image Editor with FLUX. Fill Tool for Inpainting.txt-1758064183390",
    "fileName": "🎨 Interactive Image Editor with FLUX. Fill Tool for Inpainting.txt",
    "flowName": "FLUX-fill standalone",
    "mainArea": "Diseño Gráfico",
    "secondaryAreas": [
      "Marketing Digital",
      "Contenido Web",
      "E-commerce"
    ],
    "mainFunction": "Permitir a los usuarios editar y generar nuevas imágenes utilizando una interfaz web interactiva, enmascarando áreas y proporcionando un 'prompt' para la generación de contenido AI con FLUX-Fill.",
    "automationDestinations": [
      "API FLUX-Fill",
      "Navegador Web del Usuario"
    ],
    "dataOrigins": [
      "Webhook",
      "Navegador Web del Usuario"
    ],
    "keyNodes": [
      "Webhook",
      "HTML",
      "HTTP Request",
      "IF",
      "Respond to Webhook",
      "Merge"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un flujo de trabajo interactivo que ofrece una interfaz de usuario web para editar imágenes con herramientas de enmascaramiento y AI generativa (FLUX-Fill) para transformar visualmente el contenido.",
    "useCaseExamples": [
      "Un vendedor online utiliza la herramienta para eliminar imperfecciones o cambiar el fondo de sus fotos de productos (por ejemplo, un sofá) para que se vean más atractivas y consistentes en su tienda, simplemente enmascarando el área y proporcionando una descripción como \"fondo blanco limpio\" o \"sala de estar moderna\".",
      "Un agente inmobiliario carga una foto de una casa y usa el editor para \"vaciar\" una habitación enmascarando los muebles existentes y pidiendo a la IA que genere una \"habitación vacía y espaciosa\", o para \"escenificar\" una habitación vacía añadiendo muebles virtuales con un prompt como \"sala de estar acogedora con chimenea\".",
      "Un gestor de comunidad desea adaptar una imagen existente para una campaña de redes sociales. Utiliza el editor para seleccionar un objeto (por ejemplo, una taza en una mesa) y reemplazarlo con otro (\"taza de café humeante\" o \"libro abierto\"), o para cambiar el estilo de un elemento existente para que coincida con la temática de la campaña.",
      "Un diseñador gráfico necesita explorar rápidamente diferentes conceptos para un banner publicitario. Sube una imagen base, enmascara un área específica (como un logo o una figura) y experimenta con prompts como \"logo futurista brillante\" o \"persona sonriente con traje profesional\" para generar variaciones sin tener que redibujar manualmente.",
      "Un bloguero o editor de contenido desea enriquecer sus artículos con imágenes personalizadas. Carga una foto genérica, enmascara un elemento secundario y lo reemplaza o lo mejora con la IA (por ejemplo, enmascara un cielo gris y lo cambia por \"cielo azul soleado con nubes\" o enmascara un objeto de fondo y lo reemplaza con \"planta de interior elegante\") para que la imagen se adapte mejor al tema del artículo."
    ],
    "similarities": [],
    "id": 4,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🐋🤖 DeepSeek AI Agent + Telegram + LONG TERM Memory 🧠.txt-1758064200354",
    "fileName": "🐋🤖 DeepSeek AI Agent + Telegram + LONG TERM Memory 🧠.txt",
    "flowName": "🐋🤖 DeepSeek AI Agent + Telegram + LONG TERM Memory 🧠",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Comunicación",
      "Gestión de Información"
    ],
    "mainFunction": "Gestionar conversaciones bidireccionales en Telegram utilizando un agente de IA de DeepSeek, que mantiene memoria a largo plazo almacenada en Google Docs para proporcionar respuestas personalizadas y contextualizadas.",
    "automationDestinations": [
      "Telegram",
      "Google Docs"
    ],
    "dataOrigins": [
      "Telegram"
    ],
    "keyNodes": [
      "Listen for Telegram Events",
      "Check User & Chat ID",
      "Message Router",
      "Retrieve Long Term Memories",
      "AI Agent",
      "Save Long Term Memories",
      "Telegram Response",
      "Window Buffer Memory",
      "DeepSeek-V3 Chat",
      "DeepSeek-R1 Reasoning"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un flujo de n8n que integra un agente de IA de DeepSeek con Telegram, dotándolo de memoria a largo plazo gestionada a través de Google Docs para interacciones conversacionales inteligentes y personalizadas.",
    "useCaseExamples": [
      "Un bot de asistencia personal en Telegram que recuerda las preferencias del usuario (por ejemplo, cafés favoritos, horarios de reuniones, contactos clave) y las utiliza para gestionar recordatorios, programar eventos o proporcionar información personalizada de manera proactiva.",
      "Un sistema de soporte al cliente avanzado donde el bot de Telegram recuerda el historial de interacciones, compras y problemas previos de un cliente específico, ofreciendo soluciones más rápidas y personalizadas sin que el cliente tenga que repetir su información cada vez.",
      "Un tutor educativo que interactúa a través de Telegram y almacena el progreso de aprendizaje de un estudiante, sus áreas de dificultad y sus intereses. El bot adapta sus explicaciones y ejercicios en función de la memoria a largo plazo para un aprendizaje más efectivo.",
      "Un coach de bienestar y hábitos saludables en Telegram que recuerda los objetivos de salud del usuario, sus restricciones dietéticas, rutinas de ejercicio y progreso. El bot ofrece consejos, sugerencias de comidas y recordatorios personalizados basados en esta información histórica.",
      "Un asistente para la planificación de eventos o viajes que, a través de Telegram, guarda las preferencias del usuario (por ejemplo, destinos anteriores, tipos de actividades, restricciones de presupuesto). Luego, utiliza esta memoria para sugerir itinerarios, alojamientos o actividades adaptadas a los gustos individuales del usuario."
    ],
    "similarities": [],
    "id": 5,
    "isFavorite": true,
    "notes": ""
  },
  {
    "workflow_uuid": "🐋DeepSeek V Chat & R Reasoning Quick Start.txt-1758064211618",
    "fileName": "🐋DeepSeek V Chat & R Reasoning Quick Start.txt",
    "flowName": "🐋DeepSeek V3 Chat & R1 Reasoning Quick Start",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Desarrollo",
      "Automatización",
      "Educación"
    ],
    "mainFunction": "Integrar y demostrar el uso de los modelos de lenguaje DeepSeek (V3 Chat y R1 Reasoner) y Ollama para interacciones de chat y razonamiento, utilizando nodos de Langchain y peticiones HTTP.",
    "automationDestinations": [
      "Usuario de Chat",
      "API de DeepSeek",
      "Ollama"
    ],
    "dataOrigins": [
      "Mensaje de Chat"
    ],
    "keyNodes": [
      "When chat message received",
      "AI Agent",
      "DeepSeek",
      "Ollama DeepSeek",
      "HTTP Request",
      "Window Buffer Memory"
    ],
    "complexity": "Medio",
    "shortDescription": "Un inicio rápido para explorar y conectar los modelos de lenguaje DeepSeek (V3 Chat, R1 Reasoner) y Ollama en n8n, permitiendo interacciones conversacionales impulsadas por IA.",
    "useCaseExamples": [
      "Un chatbot de atención al cliente que utiliza DeepSeek para responder preguntas frecuentes, resolver problemas comunes y escalar a un agente humano cuando sea necesario, manteniendo el contexto de la conversación.",
      "Un asistente virtual para empleados que proporciona respuestas a preguntas sobre políticas internas, beneficios o información de proyectos, utilizando la capacidad de razonamiento de DeepSeek para extraer datos relevantes de documentos.",
      "Una herramienta de generación de contenido interactiva donde los usuarios pueden solicitar borradores de artículos, ideas para redes sociales o descripciones de productos a través de un chat, y DeepSeek los genera al instante.",
      "Un tutor educativo o ayuda de estudio que los estudiantes pueden consultar para obtener explicaciones sobre conceptos complejos, resolver problemas matemáticos o practicar idiomas, con la capacidad de DeepSeek de recordar interacciones previas.",
      "Un sistema de recomendación personalizado que, basado en las preferencias expresadas por el usuario en una conversación, sugiere productos, libros, películas o destinos de viaje."
    ],
    "similarities": [],
    "id": 6,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "📈 Receive Daily Market News from FT.com to your Microsoft outlook inbox.txt-1758064223389",
    "fileName": "📈 Receive Daily Market News from FT.com to your Microsoft outlook inbox.txt",
    "flowName": "Financial News Recap Workflow",
    "mainArea": "Finanzas",
    "secondaryAreas": [
      "Noticias",
      "Análisis de Datos",
      "Comunicación"
    ],
    "mainFunction": "Automatiza la recopilación, resumen mediante IA y envío diario por correo electrónico de noticias financieras clave para inversores.",
    "automationDestinations": [
      "Microsoft Outlook"
    ],
    "dataOrigins": [
      "Programador",
      "Financial Times (ft.com)"
    ],
    "keyNodes": [
      "Schedule Trigger",
      "HTTP Request",
      "HTML",
      "Set",
      "AI Agent",
      "Microsoft Outlook"
    ],
    "complexity": "Medio",
    "shortDescription": "Recopila, resume con IA y envía diariamente noticias financieras por correo electrónico a inversores.",
    "useCaseExamples": [
      "Un inversor particular activo que gestiona su propio portafolio utiliza este flujo para recibir un resumen diario conciso de las principales noticias y tendencias financieras del Financial Times cada mañana a las 7:00 AM, lo que le permite tomar decisiones informadas sin tener que navegar por el sitio web.",
      "Un asesor financiero desea mantener a sus clientes clave informados con un digest diario de las noticias económicas más relevantes. Este flujo genera automáticamente un resumen que el asesor puede revisar, personalizar ligeramente y luego compartir con sus clientes para ofrecer un valor añadido.",
      "Un analista de mercado junior en una firma de inversión necesita una forma eficiente de escanear el panorama financiero global cada día. El flujo le proporciona un punto de partida automatizado con titulares clave y un resumen inteligente generado por IA, ahorrándole tiempo en la recopilación inicial de noticias.",
      "El director de estrategia de una empresa requiere un informe matutino consolidado de las noticias financieras que podrían afectar la posición o las inversiones de la compañía. Este flujo automatiza la entrega de un resumen relevante, centrado en secciones específicas como \"Editor's Picks\" o \"Europe News\", directamente a su bandeja de entrada.",
      "Un equipo de investigación económica dentro de una organización necesita monitorear constantemente los desarrollos del mercado. Este flujo les asegura que cada mañana a las 7:00 AM, todos los miembros del equipo reciben un correo electrónico con un resumen estructurado y generado por IA de las noticias financieras más importantes del día."
    ],
    "similarities": [],
    "id": 7,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "📚 Auto-generate documentation for nn workflows with GPT and Docsify.txt-1758064236487",
    "fileName": "📚 Auto-generate documentation for nn workflows with GPT and Docsify.txt",
    "flowName": "Docsify example",
    "mainArea": "Gestión del Conocimiento",
    "secondaryAreas": [
      "IT/DevOps",
      "Desarrollo de Software",
      "Operaciones Internas"
    ],
    "mainFunction": "Ofrecer una plataforma de documentación interactiva y autogenerada para los flujos de trabajo de n8n, permitiendo la visualización, edición y regeneración de la documentación de manera dinámica utilizando Docsify y capacidades de IA.",
    "automationDestinations": [
      "Navegador Web",
      "Sistema de Archivos",
      "n8n API"
    ],
    "dataOrigins": [
      "Webhook",
      "n8n API (para datos de flujos de trabajo)"
    ],
    "keyNodes": [
      "Webhook",
      "Switch",
      "If",
      "Read/Write File",
      "HTML",
      "n8n (API)",
      "Code (Mermaid)",
      "LLM Chain (OpenAI)",
      "Set",
      "Merge"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo de trabajo de n8n implementa una solución dinámica para generar, servir y editar la documentación de otros flujos de trabajo de n8n, con un editor Markdown en vivo, visualización de Docsify y asistencia de IA.",
    "useCaseExamples": [
      "Un equipo de desarrollo de automatización centraliza la documentación de todos sus flujos de trabajo de n8n en un portal Docsify accesible, permitiendo a los miembros del equipo buscar, visualizar y entender rápidamente la funcionalidad de cada flujo.",
      "Un administrador de n8n necesita generar automáticamente la documentación inicial para los flujos de trabajo recién creados o importados, utilizando un LLM para crear descripciones y diagramas Mermaid que expliquen su propósito y estructura.",
      "Los desarrolladores requieren una herramienta fácil para editar la documentación existente de un flujo de trabajo. El flujo de n8n les proporciona un editor Markdown en vivo con vista previa en tiempo real y la opción de guardar directamente los cambios.",
      "Una empresa busca mantener un registro actualizado de sus flujos de trabajo críticos. Utilizan esta solución para regenerar automáticamente la documentación de flujos específicos cuando hay actualizaciones importantes, asegurando que la información esté siempre al día.",
      "Un gestor de proyectos quiere proporcionar un catálogo de autoservicio para los usuarios finales, donde puedan ver descripciones y diagramas de los flujos de trabajo de n8n sin acceder a la interfaz completa, facilitando la comprensión y adopción de las automatizaciones."
    ],
    "similarities": [],
    "id": 8,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🔍 Perplexity Research to HTML AI-Powered Content Creation.txt-1758064244850",
    "fileName": "🔍 Perplexity Research to HTML AI-Powered Content Creation.txt",
    "flowName": "🔍🛠️Perplexity Researcher to HTML Web Page",
    "mainArea": "Creación de Contenido",
    "secondaryAreas": [
      "Marketing",
      "Desarrollo Web",
      "Inteligencia Artificial"
    ],
    "mainFunction": "Realiza investigación sobre un tema usando Perplexity AI, genera un artículo estructurado a partir de los resultados de la investigación, extrae la información clave en formato JSON, y finalmente convierte el artículo en una página web HTML con estilo Tailwind CSS, devolviéndola a través de un webhook.",
    "automationDestinations": [
      "Webhook (respuesta HTML)",
      "Telegram"
    ],
    "dataOrigins": [
      "Webhook",
      "Perplexity AI"
    ],
    "keyNodes": [
      "Webhook",
      "Perplexity Topic Agent",
      "Extract JSON",
      "Structured Output Parser",
      "Create HTML Article",
      "Basic LLM Chain",
      "If",
      "HTTP Request (Perplexity)"
    ],
    "complexity": "Complejo",
    "shortDescription": "Investiga un tema con Perplexity AI, crea un artículo estructurado, y lo convierte en una página web HTML con estilo Tailwind CSS, accesible vía webhook.",
    "useCaseExamples": [
      "Un especialista en marketing introduce un tema de blog (por ejemplo, \"Estrategias SEO para eCommerce en 2024\") y el flujo de trabajo investiga el tema, estructura el contenido y genera una página HTML optimizada para su publicación rápida.",
      "Un equipo de producto necesita crear rápidamente páginas de aterrizaje (landing pages) informativas para nuevas características. Ingresan una descripción del producto y el flujo genera una página HTML con contenido relevante y formato atractivo.",
      "Un analista de investigación de mercado busca obtener resúmenes estructurados sobre tendencias emergentes (por ejemplo, \"El futuro de la energía renovable\"). El flujo investiga el tema y produce un informe en formato HTML para su análisis.",
      "Un educador o creador de cursos desea generar materiales de aprendizaje concisos sobre un concepto específico (por ejemplo, \"Introducción a la programación Python\"). El flujo investiga el tema y crea una página HTML explicativa.",
      "Una empresa necesita actualizar su base de conocimientos interna con nuevos artículos técnicos (por ejemplo, \"Guía de implementación de Kubernetes\"). El flujo automatiza la investigación y la generación de borradores HTML para estos artículos."
    ],
    "similarities": [],
    "id": 9,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🔐🦙🤖 Private & Local Ollama Self-Hosted AI Assistant.txt-1758064255631",
    "fileName": "🔐🦙🤖 Private & Local Ollama Self-Hosted AI Assistant.txt",
    "flowName": "🗨️Ollama Chat",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Soporte al Cliente",
      "Asistente Virtual",
      "Automatización de Contenido"
    ],
    "mainFunction": "Procesar mensajes de chat entrantes utilizando un modelo de lenguaje Ollama (Llama 3.2) para generar y estructurar respuestas.",
    "automationDestinations": [
      "Interfaz de Chat"
    ],
    "dataOrigins": [
      "Mensaje de Chat"
    ],
    "keyNodes": [
      "When chat message received",
      "Basic LLM Chain",
      "Ollama Model",
      "JSON to Object",
      "Structured Response",
      "Error Response"
    ],
    "complexity": "Medio",
    "shortDescription": "Un flujo que permite a los usuarios interactuar con un modelo de lenguaje Llama 3.2 a través de un chat, procesando las entradas y devolviendo respuestas estructuradas.",
    "useCaseExamples": [
      "Una empresa de comercio electrónico implementa un chatbot en su sitio web para responder preguntas frecuentes de clientes sobre productos, estado de pedidos y políticas de devolución, utilizando Llama 3.2 para ofrecer respuestas instantáneas y precisas.",
      "Un equipo de soporte técnico utiliza el flujo para crear un asistente interno que ayuda a los técnicos a buscar soluciones a problemas comunes, acceder a documentación técnica y obtener sugerencias de diagnóstico basadas en descripciones de fallos.",
      "Una plataforma educativa integra un \"tutor virtual\" que permite a los estudiantes hacer preguntas sobre el contenido del curso y recibir explicaciones detalladas o ejemplos, mejorando su experiencia de aprendizaje.",
      "Un equipo de marketing emplea el chatbot como una herramienta de brainstorming, pidiendo ideas para campañas publicitarias, sugerencias de contenido para blogs o resúmenes de textos largos, agilizando el proceso creativo.",
      "Una empresa interna de TI implementa el chat para que los empleados puedan reportar problemas tecnológicos o hacer preguntas sobre software interno, y el bot proporciona pasos de solución de problemas o redirige a los recursos adecuados."
    ],
    "similarities": [],
    "id": 10,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🔥📈🤖 AI Agent for nn Creators Leaderboard - Find Popular Workflows.txt-1758064265918",
    "fileName": "🔥📈🤖 AI Agent for nn Creators Leaderboard - Find Popular Workflows.txt",
    "flowName": "🔥📈🤖 AI Agent for n8n Creators Leaderboard - Find Popular Workflows",
    "mainArea": "Análisis de Datos",
    "secondaryAreas": [
      "Comunidad y Contenido",
      "Desarrollo de Software/Herramientas",
      "Business Intelligence"
    ],
    "mainFunction": "Generar informes detallados y personalizados sobre los creadores de flujos de trabajo de n8n y la popularidad de sus flujos, utilizando un agente de IA para procesar datos estadísticos.",
    "automationDestinations": [
      "Sistema de Archivos Local"
    ],
    "dataOrigins": [
      "Chat Trigger",
      "Ejecución de Flujo de Trabajo",
      "GitHub"
    ],
    "keyNodes": [
      "HTTP Request",
      "Set",
      "Filter",
      "Merge",
      "Agent",
      "Chat Trigger",
      "Convert to File",
      "ReadWriteFile"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un agente de IA que recupera estadísticas de creadores y flujos de trabajo de n8n de GitHub para generar informes Markdown detallados sobre la popularidad y el impacto de los contribuyentes.",
    "useCaseExamples": [
      "Un gestor de comunidad n8n necesita identificar a los contribuidores más influyentes para un programa de reconocimiento o un boletín informativo. Utiliza este flujo para generar informes detallados sobre la actividad de creadores específicos, incluyendo sus flujos de trabajo más populares y métricas de uso, facilitando la selección y la creación de contenido para destacar a esos miembros.",
      "Un analista de tendencias en el espacio de la automatización busca entender qué tipos de flujos de trabajo están ganando tracción en la comunidad de n8n. Ejecuta el flujo para investigar a varios creadores líderes y compila un informe con los flujos más insertados y visitados, identificando así patrones y necesidades emergentes en el mercado.",
      "Un creador de contenido educativo para tutoriales de n8n quiere basar sus próximos videos o artículos en flujos de trabajo populares o en los creadores más activos. Usa este flujo para obtener un resumen rápido y estadístico de un creador en particular, ayudándole a decidir qué flujos o perfiles analizar para sus guías y demostraciones.",
      "El equipo de marketing de n8n necesita datos concretos para campañas sobre el impacto de la comunidad. Utiliza el flujo para generar informes sobre creadores clave, destacando sus contribuciones más exitosas y la razón de su popularidad, lo cual puede ser integrado en materiales de marketing, estudios de caso o para atraer a nuevos usuarios.",
      "Un desarrollador individual de n8n, que es también un contribuidor activo en la comunidad, desea realizar un seguimiento de su propio desempeño. Ejecuta el flujo con su nombre de usuario para obtener un informe personal que muestre las estadísticas de sus flujos de trabajo, cuántos usuarios los están insertando y visitando, y el feedback general, para guiar su estrategia de desarrollo futuro."
    ],
    "similarities": [],
    "id": 11,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🤖 Telegram Messaging Agent for Text Audio Images.txt-1758064545028",
    "fileName": "🤖 Telegram Messaging Agent for Text Audio Images.txt",
    "flowName": "🤖 Telegram Messaging Agent for Text/Audio/Images",
    "mainArea": "Comunicación",
    "secondaryAreas": [
      "Asistencia Virtual",
      "Automatización y IA",
      "Análisis de Datos"
    ],
    "mainFunction": "Actúa como un agente inteligente de Telegram que escucha eventos, valida usuarios y enruta mensajes (texto, audio, imágenes) para su procesamiento mediante IA (transcripción, análisis de imágenes, clasificación de texto), respondiendo según el contenido, además de gestionar su configuración de webhook.",
    "automationDestinations": [
      "Telegram",
      "OpenAI"
    ],
    "dataOrigins": [
      "Telegram Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "If",
      "Switch",
      "Telegram",
      "OpenAI",
      "Text Classifier",
      "HTTP Request"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un agente de Telegram que procesa y responde a mensajes de texto, audio e imágenes utilizando capacidades de IA, con herramientas integradas para la gestión del webhook.",
    "useCaseExamples": [
      "Un asistente personal de Telegram que transcribe notas de voz en texto, clasifica mensajes escritos como tareas o información general, y analiza imágenes para proporcionar descripciones, ayudando al usuario a organizar su día.",
      "Un bot de soporte al cliente que recibe consultas de usuarios por texto, audio o imágenes. El bot transcribe las grabaciones de voz, analiza el contenido de los mensajes para determinar la intención y procesa fotos de productos defectuosos, dirigiendo cada caso al departamento adecuado.",
      "Un sistema de monitoreo para grupos de Telegram donde el bot modera automáticamente el contenido. Transcribe mensajes de audio para detectar lenguaje inapropiado, clasifica mensajes de texto para identificar spam o contenido ofensivo, y analiza imágenes en busca de material explícito, alertando a los administradores.",
      "Una herramienta para equipos de campo donde los técnicos envían informes de incidentes a través de Telegram. Pueden adjuntar fotos de los problemas, grabar notas de voz explicando la situación o enviar mensajes de texto con actualizaciones, y el flujo de trabajo procesa esta información para generar un reporte estandarizado.",
      "Un bot educativo que permite a los estudiantes interactuar mediante diferentes formatos. Pueden enviar preguntas de texto para recibir respuestas, grabar su voz para practicar la pronunciación y obtener transcripciones, o enviar imágenes de objetos para aprender sobre ellos a través de análisis visuales."
    ],
    "similarities": [],
    "id": 12,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🤖🧑 💻 AI Agent for Top nn Creators Leaderboard Reporting.txt-1758064557020",
    "fileName": "🤖🧑 💻 AI Agent for Top nn Creators Leaderboard Reporting.txt",
    "flowName": "🤖🧑‍💻 AI Agent for Top n8n Creators Leaderboard Reporting",
    "mainArea": "Análisis de Datos",
    "secondaryAreas": [
      "Gestión de Contenido",
      "Marketing",
      "Comunidad"
    ],
    "mainFunction": "Generar informes detallados y clasificaciones de los principales creadores y flujos de trabajo de n8n, utilizando inteligencia artificial para procesar y resumir datos, y distribuirlos a través de varios canales de comunicación.",
    "automationDestinations": [
      "Google Drive",
      "Gmail",
      "Telegram",
      "Sistema de Archivos Local"
    ],
    "dataOrigins": [
      "GitHub",
      "Disparador de Calendario",
      "Ejecución por Otro Flujo de Trabajo"
    ],
    "keyNodes": [
      "HTTP Request",
      "Set",
      "Split Out",
      "Sort",
      "Limit",
      "Merge",
      "AI Agent (n8n Creators Stats Agent)",
      "LLM (gpt-4o-mini, Google Gemini)",
      "Markdown",
      "Google Drive",
      "Gmail",
      "Telegram"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo genera informes automáticos sobre los creadores y flujos de trabajo más populares de n8n, usando IA para analizar las estadísticas y enviando los resultados por email, Drive y Telegram.",
    "useCaseExamples": [
      "Un gerente de comunidad de n8n utiliza este flujo de trabajo para generar automáticamente un informe semanal que destaca a los creadores más influyentes y los flujos de trabajo más populares, compartiéndolo por correo electrónico con el equipo interno y en Telegram para la comunidad.",
      "Un equipo de marketing emplea el flujo para identificar flujos de trabajo en tendencia y colaboradores destacados, que luego son utilizados para crear contenido para blogs, boletines informativos y publicaciones en redes sociales, mejorando la visibilidad de la comunidad.",
      "Un equipo de relaciones con desarrolladores monitorea el impacto de los flujos de trabajo contribuido por la comunidad. El flujo genera y guarda informes diarios o semanales en Google Drive, permitiéndoles analizar tendencias y la popularidad de los flujos para ajustar su estrategia.",
      "Un equipo de producto dentro de n8n utiliza los informes automáticos sobre los flujos de trabajo más populares y sus descripciones para obtener información valiosa de los usuarios, la cual informa las decisiones sobre el desarrollo de futuras características y mejoras de la plataforma.",
      "Un educador o capacitador de n8n se suscribe al informe de los \"10 mejores flujos de trabajo\" enviado por correo electrónico para mantener una lista actualizada y curada de los flujos de trabajo más relevantes y populares, que luego recomienda a sus estudiantes o incluye en sus materiales de curso."
    ],
    "similarities": [],
    "id": 13,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🤖🧠 AI Agent Chatbot + LONG TERM Memory + Note Storage + Telegram.txt-1758064566851",
    "fileName": "🤖🧠 AI Agent Chatbot + LONG TERM Memory + Note Storage + Telegram.txt",
    "flowName": "🤖🧠 AI Agent Chatbot + LONG TERM Memory + Note Storage + Telegram",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Asistencia Personal",
      "Gestión del Conocimiento",
      "Comunicación"
    ],
    "mainFunction": "Proporciona un chatbot de IA con memoria a largo plazo y capacidad de almacenamiento de notas, interactuando a través de un chat y utilizando Google Docs para persistencia de datos.",
    "automationDestinations": [
      "Telegram",
      "Google Docs"
    ],
    "dataOrigins": [
      "Chat (mensajes de chat)"
    ],
    "keyNodes": [
      "When chat message received",
      "AI Tools Agent",
      "Retrieve Long Term Memories",
      "Retrieve Notes",
      "Save Long Term Memories",
      "Save Notes",
      "Window Buffer Memory",
      "Merge",
      "Aggregate",
      "Telegram Response",
      "gpt-4o-mini"
    ],
    "complexity": "Medio",
    "shortDescription": "Un chatbot de IA que integra memoria a largo plazo y almacenamiento de notas, operando mediante chat (como Telegram) y gestionando la información en Google Docs para una interacción personalizada.",
    "useCaseExamples": [
      "Un asistente personal en Telegram que recuerda tus preferencias (restaurantes favoritos, fechas importantes) para ofrecer recomendaciones personalizadas y guardar notas rápidas sobre tareas pendientes.",
      "Un chatbot de soporte al cliente para una pequeña empresa que memoriza el historial de interacciones, preferencias de productos y problemas previos de cada cliente para dar respuestas contextuales y permite registrar notas de seguimiento.",
      "Un compañero de estudio en Telegram que almacena los temas en los que tienes dificultades o tus áreas de interés (memoria a largo plazo) y guarda notas con definiciones clave o resúmenes de lecciones para facilitar el aprendizaje.",
      "Un coach de bienestar en Telegram que recuerda tus objetivos de fitness, preferencias dietéticas y hábitos de salud (memoria a largo plazo) para ofrecer consejos personalizados y almacenar planes de entrenamiento o recetas.",
      "Un organizador de proyectos para freelancers que utiliza Telegram para recordar requisitos específicos de clientes, plazos de entrega o preferencias de comunicación (memoria a largo plazo) y permite guardar notas detalladas de reuniones y tareas."
    ],
    "similarities": [],
    "id": 14,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🚀 Local Multi-LLM Testing & Performance Tracker.txt-1758064575741",
    "fileName": "🚀 Local Multi-LLM Testing & Performance Tracker.txt",
    "flowName": "Testing Mulitple Local LLM with LM Studio",
    "mainArea": "Desarrollo de IA",
    "secondaryAreas": [
      "Análisis de Datos",
      "Investigación y Desarrollo",
      "Marketing de Contenidos"
    ],
    "mainFunction": "Probar y comparar el rendimiento de múltiples modelos de lenguaje grandes (LLM) locales, analizar métricas de respuesta como legibilidad y longitud, y guardar los resultados en Google Sheets.",
    "automationDestinations": [
      "Google Sheets"
    ],
    "dataOrigins": [
      "When chat message received",
      "HTTP Request (LM Studio)"
    ],
    "keyNodes": [
      "When chat message received",
      "Get Models",
      "Extract Model IDsto Run Separately",
      "Run Model with Dunamic Inputs",
      "LLM Response Analysis",
      "Analyze LLM Response Metrics",
      "Save Results to Google Sheets",
      "Capture Start Time",
      "Capture End Time",
      "Get timeDifference"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo prueba y compara múltiples LLM locales de LM Studio, analizando métricas de sus respuestas y registrando los resultados en Google Sheets.",
    "useCaseExamples": [
      "Una plataforma de e-learning quiere comparar diferentes LLMs locales para generar resúmenes de lecciones que sean fáciles de entender para estudiantes de secundaria. El flujo de trabajo puede probar varios modelos con el mismo contenido y registrar sus puntuaciones de legibilidad para identificar el más adecuado.",
      "Una empresa necesita optimizar su chatbot de soporte interno y busca el LLM local que ofrezca las respuestas más concisas y rápidas. Utilizaría el flujo para enviar preguntas frecuentes y comparar el tiempo de respuesta y la extensión de las respuestas de cada modelo.",
      "Un equipo de marketing desea encontrar el LLM local ideal para generar descripciones de productos cortas y atractivas para una tienda online. El flujo de trabajo permite probar cómo diferentes modelos manejan los mismos datos de producto, evaluando la legibilidad y el recuento de palabras de las descripciones generadas.",
      "Un redactor técnico necesita un LLM que pueda simplificar documentación compleja para una audiencia no técnica. El flujo de trabajo puede comparar cómo varios modelos reescriben secciones de manuales, analizando las puntuaciones de legibilidad (ej. para un nivel de 5º grado) y la longitud promedio de las oraciones.",
      "Una organización de noticias busca automatizar la creación de titulares y resúmenes de artículos, y necesita comparar la eficiencia y la calidad de varios LLMs locales. El flujo puede evaluar la velocidad de generación y la concisión (recuento de palabras y oraciones) de los resultados para determinar el mejor modelo."
    ],
    "similarities": [],
    "id": 15,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "🚀_Social_Media_Content_Generator_&_Publisher_for_LinkedIn_and_X.json-1758064586630",
    "fileName": "🚀_Social_Media_Content_Generator_&_Publisher_for_LinkedIn_and_X.json",
    "flowName": "🚀 Social Media Content Generator & Publisher for LinkedIn and X",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Comunicación",
      "Contenido",
      "Gestión de Redes Sociales"
    ],
    "mainFunction": "Generar contenido optimizado para redes sociales utilizando inteligencia artificial (Google Gemini) y publicarlo automáticamente en LinkedIn y X.",
    "automationDestinations": [
      "X (Twitter)",
      "LinkedIn",
      "Formulario de n8n"
    ],
    "dataOrigins": [
      "Form Trigger"
    ],
    "keyNodes": [
      "Receive Post Title",
      "Google Gemini Chat Model",
      "Generate AI Content",
      "Format AI Output",
      "Post to X",
      "Post to LinkedIn",
      "Append Linkedin And X Publishing Responses"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo genera automáticamente publicaciones para LinkedIn y X utilizando IA basada en un título de entrada, y luego las publica directamente en ambas plataformas.",
    "useCaseExamples": [
      "Un equipo de marketing lanza un nuevo producto y necesita generar rápidamente publicaciones específicas para LinkedIn y X (Twitter) a partir de un título, automatizando la creación y publicación de contenido para maximizar el alcance.",
      "Un creador de contenido quiere promocionar su último artículo de blog o video, introduciendo el título del contenido para que el flujo de trabajo genere automáticamente posts optimizados para cada plataforma social, ahorrando tiempo y manteniendo la coherencia.",
      "Un pequeño empresario desea compartir noticias de la empresa, promociones o consejos del sector; introduce un tema corto y el flujo de trabajo crea y publica mensajes atractivos para su audiencia en LinkedIn y X.",
      "Un departamento de RRHH busca destacar la cultura de la empresa o dar la bienvenida a un nuevo empleado; simplemente proporciona el nombre del evento o la persona, y el flujo genera y publica anuncios adecuados para el tono profesional de LinkedIn y el informal de X.",
      "Un organizador de eventos necesita promover un próximo seminario web o conferencia; ingresa el título del evento y el flujo de trabajo genera texto promocional convincente para LinkedIn y X, publicándolos automáticamente para atraer asistentes."
    ],
    "similarities": [],
    "id": 16,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0001-nostr-damus-ai-report.json-1758064858468",
    "fileName": "0001-nostr-damus-ai-report.json",
    "flowName": "#️⃣Nostr #damus AI Powered Reporting + Gmail + Telegram",
    "mainArea": "Análisis de Datos",
    "secondaryAreas": [
      "Marketing",
      "Comunicación",
      "Inteligencia de Negocio"
    ],
    "mainFunction": "Genera informes analíticos basados en hilos de la red social Nostr con el hashtag #damus, utilizando inteligencia artificial para identificar temas y tendencias, y luego distribuye estos informes a través de Gmail y Telegram.",
    "automationDestinations": [
      "Gmail",
      "Telegram"
    ],
    "dataOrigins": [
      "Nostr"
    ],
    "keyNodes": [
      "Nostr Read #damus",
      "Aggregate #damus Content",
      "#damus Thread Themes",
      "#damus Themes List",
      "#damus Themes & Threads Report",
      "Merge Themes and Content",
      "Google Gemini (chainLlm)",
      "Gmail",
      "Telegram",
      "Markdown"
    ],
    "complexity": "Complejo",
    "shortDescription": "Genera informes impulsados por IA sobre tendencias y temas de la red social Nostr (#damus) y los distribuye por Gmail y Telegram.",
    "useCaseExamples": [
      "Una empresa de desarrollo de aplicaciones descentralizadas utiliza el flujo para monitorear el feedback de los usuarios sobre su cliente Nostr, \"Damus\". Los informes generados por IA sobre errores, nuevas funciones solicitadas y sentimiento general se envían al equipo de desarrollo y marketing semanalmente a través de Gmail y Telegram.",
      "Un analista de tendencias en el espacio de las redes sociales descentralizadas configura este flujo para rastrear las discusiones emergentes y los temas clave relacionados con #damus en Nostr, obteniendo resúmenes diarios o semanales que le ayudan a identificar oportunidades o amenazas en el mercado.",
      "Un equipo de marketing desea entender mejor la percepción de la comunidad sobre la interoperabilidad de Damus con otras herramientas Nostr. El flujo recopila hilos con el hashtag #damus y la IA genera un informe detallado sobre las interacciones y opiniones de los usuarios, enviado a los canales de comunicación interna.",
      "Un moderador de una comunidad grande en Nostr utiliza el flujo para identificar rápidamente preguntas frecuentes o problemas técnicos recurrentes que los usuarios de Damus experimentan. Los informes de IA le permiten crear guías de solución de problemas o FAQs proactivas, que se distribuyen a través de Telegram y correo electrónico.",
      "Un creador de contenido especializado en el ecosistema Nostr automatiza la recolección de los hilos más interesantes sobre #damus. La IA resume estos hilos en un informe que el creador recibe por Gmail y Telegram, utilizando esta información como base para sus artículos o videos diarios, ahorrando tiempo en la investigación manual."
    ],
    "similarities": [],
    "id": 17,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0002-Gumroad-MailerLite-trigger.json-1758064869303",
    "fileName": "0002-Gumroad-MailerLite-trigger.json",
    "flowName": "Gumroad sale trigger",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Ventas",
      "Atención al Cliente"
    ],
    "mainFunction": "Cuando se realiza una venta en Gumroad, este flujo añade al comprador como suscriptor en MailerLite, lo asigna a un grupo específico para iniciar una secuencia de correos, y registra los detalles de la venta en una hoja de Google Sheets que actúa como CRM.",
    "automationDestinations": [
      "MailerLite",
      "Google Sheets"
    ],
    "dataOrigins": [
      "Gumroad"
    ],
    "keyNodes": [
      "Gumroad Sale Trigger",
      "add subscriber to MailerLite",
      "Assign to group",
      "append row in CRM"
    ],
    "complexity": "Simple",
    "shortDescription": "Automatiza la gestión de ventas de Gumroad añadiendo clientes a MailerLite y registrándolos en Google Sheets.",
    "useCaseExamples": [
      "Un creador de cursos online utiliza Gumroad para vender su contenido. Cuando un estudiante compra un curso, este flujo lo añade automáticamente a una lista de correo específica en MailerLite para ese curso y lo asigna a un grupo que inicia una secuencia de bienvenida y acceso al material. Al mismo tiempo, los datos de la venta se registran en una hoja de Google Sheets para llevar un control de inscripciones.",
      "Un diseñador gráfico vende plantillas y recursos digitales en Gumroad. Cada vez que alguien compra un paquete de plantillas, el comprador se añade a MailerLite y se asigna a un grupo específico (ej. 'Compradores de plantillas de redes sociales'). Esto permite enviar correos electrónicos personalizados con tutoriales o promociones de productos relacionados, mientras que un CRM en Google Sheets registra todas las transacciones.",
      "Un autor independiente vende sus ebooks y audiolibros a través de Gumroad. Con cada venta, el comprador es añadido a una lista de MailerLite general para nuevos lanzamientos y se le asigna a un grupo 'Clientes Leales'. Paralelamente, la información de la venta, incluyendo el país de origen, se guarda en Google Sheets, lo que ayuda a analizar las tendencias geográficas y a planificar futuras campañas de marketing.",
      "Una pequeña empresa lanza un nuevo software o plugin exclusivo en Gumroad. Al activarse una venta, el cliente se agrega a una lista de MailerLite para recibir actualizaciones de software y soporte técnico. Además, la venta se registra en una hoja de cálculo de Google Sheets que actúa como su CRM, permitiéndoles rastrear las licencias y contactar a los clientes en caso de problemas o nuevas versiones.",
      "Un fotógrafo vende presets y guías de edición en Gumroad. Cuando alguien adquiere un preset, este flujo automatiza el proceso de añadir al nuevo cliente a un grupo de MailerLite denominado 'Compradores de Presets [Nombre del Preset]' para enviar consejos de uso y ofertas exclusivas. Toda la información de la venta se almacena en una hoja de Google Sheets, facilitando el seguimiento de los productos más populares y la gestión de la base de clientes."
    ],
    "similarities": [],
    "id": 18,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0003-line-chatgpt-image-flow.json-1758064880092",
    "fileName": "0003-line-chatgpt-image-flow.json",
    "flowName": "template-demo-chatgpt-image-1-with-drive-and-sheet copy",
    "mainArea": "Marketing y Contenido",
    "secondaryAreas": [
      "Productividad",
      "Gestión de Datos",
      "IT"
    ],
    "mainFunction": "Permite generar imágenes utilizando un modelo de IA (OpenAI GPT-Image) a partir de una entrada de chat, guardar las imágenes resultantes en Google Drive y registrar los detalles y costos de la generación en Google Sheets.",
    "automationDestinations": [
      "Google Drive",
      "Google Sheets"
    ],
    "dataOrigins": [
      "Chat (n8n Chat Trigger)"
    ],
    "keyNodes": [
      "HTTP Request",
      "Split Out",
      "Loop Over Items",
      "Convert to File",
      "Google Drive",
      "Google Sheets"
    ],
    "complexity": "Medio",
    "shortDescription": "Genera imágenes con IA usando un prompt de chat, las guarda en Google Drive y registra el uso en Google Sheets.",
    "useCaseExamples": [
      "Un equipo de marketing genera rápidamente imágenes para campañas publicitarias en redes sociales. Introducen un \"prompt\" como \"perro labrador con gorra de chef preparando pizza\" y el flujo de trabajo crea la imagen, la guarda en Google Drive y registra sus detalles en una hoja de cálculo para seguimiento.",
      "Un creador de contenido educativo necesita ilustraciones personalizadas para sus lecciones. Describe una escena como \"un grupo de niños explorando un bosque mágico\" y el flujo genera la imagen, la archiva en una carpeta de recursos educativos y registra el uso.",
      "Una startup de comercio electrónico visualiza nuevas ideas de productos. Un empleado introduce un \"prompt\" como \"zapatillas deportivas futuristas con luces LED integradas en un fondo cyberpunk\" para obtener maquetas visuales instantáneas, guardadas y catalogadas automáticamente.",
      "Un bloguero o escritor busca imágenes únicas para acompañar sus artículos. Por ejemplo, al escribir sobre \"tecnología sostenible\", solicita \"un edificio ecológico con paneles solares y jardines verticales\" y el flujo le proporciona una imagen lista para usar, con registro de su generación.",
      "Un equipo de diseño interno permite a otros departamentos solicitar conceptos visuales. Un gerente de producto puede pedir \"un diagrama de flujo abstracto que represente el ciclo de vida del cliente\" para una presentación, recibiendo una imagen guardada en la carpeta del proyecto y con el costo de generación registrado."
    ],
    "similarities": [],
    "id": 19,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0004-connectwise-ticket-alerts-to-teams.json-1758064896597",
    "fileName": "0004-connectwise-ticket-alerts-to-teams.json",
    "flowName": "New Ticket Alerts to Teams",
    "mainArea": "Soporte al Cliente",
    "secondaryAreas": [
      "Operaciones de TI",
      "Comunicación Interna"
    ],
    "mainFunction": "Obtiene nuevos tickets de un sistema de gestión de servicios (ConnectWise), filtra los que ya han sido notificados, los agrupa por empresa y sitio, y envía alertas al equipo de despacho en Microsoft Teams.",
    "automationDestinations": [
      "Microsoft Teams",
      "Redis"
    ],
    "dataOrigins": [
      "Schedule Trigger",
      "ConnectWise"
    ],
    "keyNodes": [
      "Schedule Trigger",
      "HTTP Request",
      "Redis",
      "Merge",
      "Code",
      "Microsoft Teams"
    ],
    "complexity": "Medio",
    "shortDescription": "Envía alertas de nuevos tickets de soporte a Microsoft Teams, asegurando que no se dupliquen las notificaciones.",
    "useCaseExamples": [
      "Un equipo de soporte de TI utiliza ConnectWise para gestionar incidentes. El flujo de trabajo les permite recibir alertas instantáneas en un canal de Microsoft Teams cada vez que se crea un nuevo ticket de soporte, asegurando una respuesta rápida y coordinada a los problemas de los usuarios.",
      "Un Proveedor de Servicios Gestionados (MSP) necesita monitorear tickets de múltiples clientes en ConnectWise. Este flujo notifica automáticamente a su equipo de despacho en Teams sobre los nuevos tickets críticos de cualquiera de sus clientes, agrupándolos por empresa, para una asignación eficiente y una visibilidad centralizada.",
      "Una empresa de servicios técnicos recibe solicitudes de mantenimiento a través de ConnectWise. El flujo envía notificaciones consolidadas a un equipo de operaciones en Teams, destacando los nuevos tickets para que puedan ser priorizados y asignados al personal técnico adecuado sin demora.",
      "Un centro de atención al cliente que utiliza ConnectWise para registrar consultas y quejas. El flujo de trabajo alerta al equipo de supervisores en Teams sobre la llegada de nuevas consultas, permitiéndoles monitorear la carga de trabajo y asegurar que ninguna solicitud quede sin atender.",
      "Un equipo responsable de la administración de la infraestructura de TI recibe alertas automatizadas en ConnectWise de sistemas de monitoreo. Este flujo asegura que los nuevos tickets generados por estas alertas sean inmediatamente comunicados a su canal de Teams, facilitando la pronta investigación y resolución de posibles problemas de infraestructura."
    ],
    "similarities": [],
    "id": 20,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0005-google-calendar-outlook-sync.json-1758064914717",
    "fileName": "0005-google-calendar-outlook-sync.json",
    "flowName": "Google calendar to Outlook",
    "mainArea": "Productividad",
    "secondaryAreas": [
      "Gestión de Tiempo",
      "Administración Personal"
    ],
    "mainFunction": "Sincroniza eventos nuevos y cancelados de Google Calendar con Outlook, creando o eliminando eventos respectivamente y enviando una notificación por correo electrónico al cancelar.",
    "automationDestinations": [
      "Microsoft Outlook"
    ],
    "dataOrigins": [
      "Google Calendar"
    ],
    "keyNodes": [
      "Google Calendar Trigger",
      "Microsoft Outlook",
      "Merge"
    ],
    "complexity": "Medio",
    "shortDescription": "Mantiene tus calendarios de Google y Outlook sincronizados, creando, eliminando eventos y enviando notificaciones para eventos cancelados.",
    "useCaseExamples": [
      "Un profesional independiente que utiliza Google Calendar para gestionar todas las citas con clientes (que provienen de diversas plataformas de reserva) necesita que su calendario de Outlook profesional esté siempre actualizado para evitar dobles reservas al interactuar con colaboradores o clientes que usan Microsoft 365.",
      "Un empleado que trabaja en un entorno híbrido donde algunos equipos usan Google Workspace y otros Microsoft 365. Utiliza Google Calendar para reuniones de proyectos específicos, pero su calendario oficial de la empresa es Outlook. El flujo asegura que todos los eventos importantes de Google Calendar aparezcan y se actualicen en Outlook.",
      "Una persona que organiza su vida personal (citas médicas, eventos familiares, actividades de ocio) en Google Calendar y necesita que los compromisos más importantes se reflejen en su calendario de Outlook laboral para que sus colegas puedan ver su disponibilidad real sin tener que introducirlos manualmente.",
      "Un asistente virtual o secretario que gestiona las agendas de varios clientes o directivos utilizando Google Calendar para la planificación. El flujo permite que, al crear o cancelar una reunión en Google Calendar, esta acción se replique automáticamente en el Outlook del cliente o directivo, manteniendo su agenda siempre actualizada y minimizando errores manuales.",
      "Un coordinador de eventos o un gestor de proyectos que utiliza Google Calendar para planificar la logística detallada de un evento (reuniones con proveedores, horarios de montaje, ensayos) y necesita que estos plazos y citas se reflejen en su Outlook para tener una vista unificada de su agenda profesional y coordinar con el personal interno."
    ],
    "similarities": [],
    "id": 21,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0006-airtable-hn-job-scraping.json-1758064926008",
    "fileName": "0006-airtable-hn-job-scraping.json",
    "flowName": "HN Who is Hiring Scrape",
    "mainArea": "Recursos Humanos",
    "secondaryAreas": [
      "Inteligencia de Mercado",
      "Análisis de Datos",
      "Búsqueda de Empleo"
    ],
    "mainFunction": "Extraer y estructurar ofertas de empleo de los posts 'Who is Hiring' de Hacker News utilizando inteligencia artificial para almacenarlas en Airtable.",
    "automationDestinations": [
      "Airtable"
    ],
    "dataOrigins": [
      "Hacker News (Algolia API)",
      "Hacker News (Firebase API)"
    ],
    "keyNodes": [
      "HTTP Request",
      "Split Out",
      "Filter",
      "Code",
      "OpenAI Chat Model",
      "Structured Output Parser",
      "Airtable"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo extrae ofertas de empleo de Hacker News, las limpia, estructura con IA y las guarda en Airtable para facilitar la búsqueda.",
    "useCaseExamples": [
      "Un desarrollador de software que busca empleo desea recibir una lista diaria o semanal de nuevas ofertas de trabajo publicadas en \"Ask HN: Who is hiring?\", filtradas y estructuradas, directamente en una hoja de cálculo personalizada o Airtable para facilitar su revisión y aplicación.",
      "Un reclutador de tecnología quiere identificar rápidamente las empresas que están contratando para roles específicos (ej., ingenieros de DevOps, desarrolladores de IA) en Hacker News y extraer sus descripciones de puestos para evaluar el panorama competitivo y las tendencias salariales.",
      "Una empresa de análisis de datos del sector tecnológico necesita recopilar automáticamente datos de ofertas de empleo de Hacker News cada mes. El objetivo es analizar tendencias sobre los tipos de roles, tecnologías demandadas y ubicaciones (remoto/presencial) para informes de mercado.",
      "Un pequeño sitio web de bolsa de trabajo desea alimentar automáticamente su base de datos con nuevas ofertas de empleo de Hacker News, transformando el texto no estructurado en entradas estandarizadas con campos como empresa, título, tipo de empleo y URL de solicitud.",
      "Una startup quiere monitorear discretamente las ofertas de trabajo publicadas por sus competidores o empresas similares en Hacker News. Esto les permitiría entender las habilidades que buscan, los tipos de proyectos en los que invierten y cómo estructuran sus equipos."
    ],
    "similarities": [],
    "id": 22,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0007-social-media-creator.json-1758064938279",
    "fileName": "0007-social-media-creator.json",
    "flowName": "Automated Social Media Content Publishing Factory + System Prompt Composition",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Contenido",
      "Inteligencia Artificial",
      "Gestión de Datos"
    ],
    "mainFunction": "Automatizar la creación, aprobación y publicación de contenido multimedia optimizado para redes sociales en múltiples plataformas (X, Instagram, Facebook, LinkedIn, Threads, YouTube Shorts), utilizando inteligencia artificial para generar textos e imágenes dinámicas y gestionando prompts y esquemas desde fuentes externas como Google Docs.",
    "automationDestinations": [
      "X (Twitter)",
      "Instagram",
      "Facebook",
      "LinkedIn",
      "Gmail",
      "Google Drive",
      "Telegram",
      "Threads",
      "YouTube Shorts"
    ],
    "dataOrigins": [
      "Mensaje de Chat",
      "Otro Flujo de Trabajo",
      "Google Docs"
    ],
    "keyNodes": [
      "AI Agent",
      "LLM (OpenAI)",
      "Switch",
      "Merge",
      "HTTP Request",
      "Google Docs",
      "Gmail",
      "Google Drive"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo automatiza la generación, aprobación y publicación de contenido para redes sociales en varias plataformas, utilizando IA para crear textos e imágenes, gestionando la configuración desde Google Docs y archivando todo en Google Drive.",
    "useCaseExamples": [
      "Una pequeña agencia de marketing digital que gestiona las redes sociales de múltiples clientes puede usar este flujo para generar publicaciones diarias o semanales en X (Twitter), Instagram y Facebook, adaptando el tono y el contenido a cada marca específica, y obteniendo la aprobación del cliente por correo electrónico antes de la publicación.",
      "Un creador de contenido individual que publica sobre \"productividad y automatización\" podría usar el flujo para generar un YouTube Short con un tutorial rápido de n8n, una publicación en LinkedIn con un \"truco\" profesional y un post conversacional en Threads para fomentar el debate, todo a partir de una única descripción de tema.",
      "El departamento de marketing de una empresa de tecnología puede automatizar la creación y publicación de anuncios de nuevos productos o características en LinkedIn para profesionales y en Instagram para una audiencia más visual, asegurando que la IA genere el texto, los hashtags y una imagen relevante que se ajuste al esquema de la marca.",
      "Una organización sin fines de lucro podría usar el flujo para difundir rápidamente información sobre un evento o campaña benéfica. Simplemente ingresando los detalles, el sistema generaría mensajes adaptados para Facebook (para la comunidad), X (para noticias rápidas) y un pie de foto para Instagram, incluyendo sugerencias de imágenes para cada plataforma, y luego los enviaría para una aprobación final antes de su lanzamiento.",
      "Un bloguero o periodista tecnológico que publica reseñas de software puede usar este flujo para generar automáticamente resúmenes de sus artículos en diferentes plataformas. Por ejemplo, una entrada concisa en X destacando los puntos clave, una publicación más detallada en Facebook con una pregunta para la comunidad y una publicación profesional en LinkedIn enfocada en el impacto empresarial del software, con imágenes generadas por IA para cada una."
    ],
    "similarities": [],
    "id": 23,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0008-notion_linkedin_pub.json-1758064945480",
    "fileName": "0008-notion_linkedin_pub.json",
    "flowName": "Notion to Linkedin",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Contenido",
      "Gestión de Redes Sociales"
    ],
    "mainFunction": "Automatiza la publicación diaria de contenido (texto e imagen) desde una base de datos de Notion a LinkedIn.",
    "automationDestinations": [
      "LinkedIn",
      "Notion"
    ],
    "dataOrigins": [
      "Notion",
      "Schedule Trigger"
    ],
    "keyNodes": [
      "Schedule Trigger",
      "Notion",
      "Code",
      "HTTP Request",
      "Merge",
      "Publish on LinkedIn"
    ],
    "complexity": "Medio",
    "shortDescription": "Publica automáticamente contenido (texto e imagen) de Notion a LinkedIn diariamente, y actualiza el estado de la publicación en Notion.",
    "useCaseExamples": [
      "Un creador de contenido programa sus publicaciones diarias de LinkedIn (artículos, consejos, análisis) en una base de datos de Notion, y el flujo de trabajo las publica automáticamente cada día a la hora programada, incluyendo el texto y la imagen asociada.",
      "Una agencia de marketing gestiona los calendarios de contenido de sus clientes en Notion. El flujo de trabajo puede configurarse para publicar las actualizaciones diarias de marketing, noticias de la empresa o artículos de liderazgo de pensamiento en la página de LinkedIn de un cliente específico.",
      "El departamento de RRHH de una empresa utiliza Notion para planificar publicaciones diarias que destaquen la cultura de la empresa, los logros de los empleados o las ofertas de empleo. El flujo de trabajo automatiza la publicación de estas entradas en el perfil de LinkedIn de la empresa para mejorar la marca del empleador.",
      "Un fundador de startup o emprendedor desea mantener una presencia constante en LinkedIn, compartiendo actualizaciones sobre su producto, conocimientos de la industria o su trayectoria personal. Prepara estas publicaciones en Notion, y el flujo de trabajo asegura que se publiquen diariamente sin intervención manual.",
      "Un educador o capacitador utiliza Notion para redactar fragmentos educativos diarios, cuestionarios o noticias relevantes para sus seguidores. El flujo de trabajo automatiza el intercambio de este contenido valioso directamente en su red profesional de LinkedIn, manteniendo el compromiso de la audiencia."
    ],
    "similarities": [],
    "id": 24,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0009-multi-agente-ia.json-1758064961087",
    "fileName": "0009-multi-agente-ia.json",
    "flowName": "Multi-Agent Conversation",
    "mainArea": "Inteligencia Artificial",
    "secondaryAreas": [
      "Soporte al Cliente",
      "Desarrollo de Contenido",
      "Asistencia Virtual"
    ],
    "mainFunction": "Gestiona una conversación con múltiples agentes de IA, permitiendo al usuario configurar cada agente y seleccionar dinámicamente con quién interactuar.",
    "automationDestinations": [
      "Interfaz de Chat",
      "Usuario Final"
    ],
    "dataOrigins": [
      "Cuando se recibe un mensaje de chat"
    ],
    "keyNodes": [
      "When chat message received",
      "Define Global Settings",
      "Define Agent Settings",
      "Extract mentions",
      "Loop Over Items",
      "AI Agent",
      "Simple Memory",
      "First loop?",
      "Combine and format responses"
    ],
    "complexity": "Complejo",
    "shortDescription": "Permite interactuar con múltiples agentes de IA configurables en una conversación, seleccionando agentes por mención o llamándolos a todos, y combinando sus respuestas.",
    "useCaseExamples": [
      "Un sistema de soporte al cliente avanzado donde diferentes agentes de IA, especializados en áreas como @Facturación, @SoporteTécnico y @Devoluciones, colaboran para responder a las consultas de los usuarios, quienes pueden dirigirse a un agente específico o dejar que el sistema determine el más adecuado.",
      "Un asistente de generación de contenido y marketing donde agentes como @RedactorCreativo, @ExpertoSEO y @AnalistaDeMercado discuten y colaboran para desarrollar ideas para campañas publicitarias, artículos de blog o publicaciones en redes sociales, con aportes desde sus respectivas especialidades.",
      "Un entorno de tutoría educativa interactiva con múltiples \"profesores\" de IA, como @TutorDeMatemáticas, @Historiador y @Científico, permitiendo a los estudiantes hacer preguntas generales y recibir explicaciones multifacéticas, o consultar a un experto en un tema específico para obtener ayuda detallada.",
      "Una herramienta de planificación y gestión de proyectos donde agentes como @CoordinadorDeTareas, @AnalistaDeRiesgos y @OptimizadorDeRecursos debaten y elaboran planes de proyecto, asignando responsabilidades, identificando posibles problemas y proponiendo soluciones, todo basado en las entradas del usuario.",
      "Una plataforma de simulación de debate o lluvia de ideas para explorar un tema complejo, donde agentes con diferentes perspectivas (ej. @AbogadoDelDiablo, @Optimista, @AnalistaPragmático) intercambian argumentos y puntos de vista para ayudar al usuario a considerar todas las facetas de una decisión o problema."
    ],
    "similarities": [],
    "id": 25,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0010-crm-lead-batchdata-calification.json-1758064978287",
    "fileName": "0010-crm-lead-batchdata-calification.json",
    "flowName": "Lead Qualification with BatchData",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing",
      "Operaciones"
    ],
    "mainFunction": "Califica leads automáticamente utilizando datos de propiedades externos (BatchData), enriquece la información en el CRM y automatiza el seguimiento y las notificaciones según la calificación obtenida.",
    "automationDestinations": [
      "CRM",
      "Slack"
    ],
    "dataOrigins": [
      "CRM (Webhook)"
    ],
    "keyNodes": [
      "Webhook",
      "HTTP Request",
      "Code",
      "IF",
      "Slack"
    ],
    "complexity": "Complejo",
    "shortDescription": "Automatiza la calificación de leads basada en datos de propiedades, enriqueciendo tu CRM y alertando a tu equipo de ventas para seguimiento inmediato.",
    "useCaseExamples": [
      "Una empresa de inversión inmobiliaria utiliza el flujo para calificar automáticamente las propiedades de los leads interesados en vender, verificando su valor, tamaño y antigüedad a través de BatchData para priorizar a los propietarios con alto potencial de inversión.",
      "Un prestamista hipotecario integra el flujo en su CRM para calificar a los solicitantes de préstamos. El sistema verifica el valor estimado y otras características de la propiedad para pre-aprobar rápidamente a los candidatos y enfocar al equipo en leads de alto valor.",
      "Una compañía de instalación de paneles solares califica sus leads entrantes. El flujo de trabajo utiliza la información de la propiedad (tamaño, antigüedad, valor) para determinar la viabilidad de la instalación solar y la capacidad de pago del propietario, asignando los leads más prometedores a los asesores.",
      "Una agencia de marketing para bienes raíces de lujo implementa el flujo para asegurar que los nuevos leads de propietarios de viviendas cumplan con los criterios de 'alto valor' definidos. Los leads calificados como de alto valor activan una notificación instantánea y una tarea de seguimiento prioritario para un agente especializado.",
      "Un desarrollador inmobiliario utiliza el flujo para evaluar propiedades o terrenos para futuras adquisiciones. Al ingresar una dirección, el sistema obtiene automáticamente datos de BatchData sobre el valor, tamaño del lote y otras características, ayudando a calificar la idoneidad del sitio para un nuevo proyecto."
    ],
    "similarities": [],
    "id": 26,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0011-totp-generator.json-1758117904491",
    "fileName": "0011-totp-generator.json",
    "flowName": "Complete Guide to Setting Up and Generating TOTP Codes in n8n 🔐",
    "mainArea": "IT/Utilidades",
    "secondaryAreas": [
      "Seguridad",
      "Administración de Sistemas"
    ],
    "mainFunction": "Generar códigos TOTP (Time-Based One-Time Password) para autenticación de dos factores.",
    "automationDestinations": [],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "Manual Trigger",
      "TOTP"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo genera códigos TOTP para la autenticación de dos factores, activado manualmente.",
    "useCaseExamples": [
      "Automatización de inicio de sesión en servicios externos que requieren autenticación de dos factores (2FA) con TOTP, como la conexión a APIs bancarias o de pasarelas de pago.",
      "Provisión de códigos TOTP para bots o scripts internos que necesitan acceder de forma segura a sistemas críticos (ej. herramientas de administración de servidores, bases de datos) con 2FA sin intervención manual.",
      "Rotación automática de claves API para servicios que exigen una autenticación TOTP adicional al realizar la operación de cambio de clave, aumentando la seguridad de las integraciones.",
      "Generación de códigos TOTP para entornos de prueba, permitiendo a los desarrolladores simular y validar procesos de autenticación de dos factores en aplicaciones sin necesidad de usar un dispositivo físico.",
      "Acceso seguro a paneles de control o bases de datos para la generación automática de informes o la ejecución de tareas programadas, donde el acceso requiere un TOTP para mayor seguridad."
    ],
    "similarities": [],
    "id": 27,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0012-typeform-feedback-route.json-1758117955718",
    "fileName": "0012-typeform-feedback-route.json",
    "flowName": "typeform feedback workflow",
    "mainArea": "Educación",
    "secondaryAreas": [
      "Análisis de Datos",
      "Mejora Continua"
    ],
    "mainFunction": "Recopilar, procesar y clasificar automáticamente el feedback de cursos enviado a través de Typeform y almacenarlo de forma diferenciada en Google Sheets.",
    "automationDestinations": [
      "Google Sheets"
    ],
    "dataOrigins": [
      "Typeform"
    ],
    "keyNodes": [
      "Typeform Trigger",
      "Set",
      "IF",
      "Google Sheets"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo recoge feedback de cursos de Typeform, lo clasifica en positivo o negativo, y lo guarda en hojas de cálculo separadas de Google Sheets.",
    "useCaseExamples": [
      "Un centro de formación utiliza Typeform para que los estudiantes valoren la utilidad de un curso. Las valoraciones positivas (3 o más) se almacenan en una hoja de cálculo para testimonios y las negativas en otra para identificar mejoras.",
      "Una empresa de SaaS implementa una encuesta Typeform post-implementación para que los clientes califiquen la utilidad de su software. El feedback se segrega en hojas de cálculo separadas para que el equipo de producto priorice las funciones y el equipo de éxito del cliente identifique a los usuarios en riesgo.",
      "Organizadores de eventos recogen la opinión de los asistentes sobre la relevancia de las ponencias a través de Typeform. Las respuestas con alta utilidad se usan para promocionar futuros eventos, y las de baja utilidad para mejorar la selección de contenido.",
      "Un equipo de recursos humanos lanza una encuesta Typeform interna para evaluar la utilidad de nuevas políticas o herramientas de colaboración. Los resultados se dividen en hojas de cálculo para medir la aceptación y realizar ajustes proactivamente.",
      "Un editor de contenido web utiliza Typeform para que los lectores valoren la utilidad de sus artículos. Las valoraciones se guardan en dos hojas de cálculo: una para identificar temas exitosos y replicarlos, y otra para revisar o mejorar el contenido menos útil."
    ],
    "similarities": [],
    "id": 28,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0013-bitwarden-line-sync.json-1758117993653",
    "fileName": "0013-bitwarden-line-sync.json",
    "flowName": "Gestión Programática de Grupos y Miembros en Bitwarden",
    "mainArea": "IT y Seguridad",
    "secondaryAreas": [
      "Recursos Humanos",
      "Administración"
    ],
    "mainFunction": "Automatizar la creación de un grupo en Bitwarden y la asignación/validación de miembros a dicho grupo.",
    "automationDestinations": [
      "Bitwarden"
    ],
    "dataOrigins": [
      "Bitwarden"
    ],
    "keyNodes": [
      "Bitwarden (Crear Grupo)",
      "Bitwarden (Obtener Miembros)",
      "Bitwarden (Actualizar Miembros)",
      "Bitwarden (Obtener Miembros del Grupo)"
    ],
    "complexity": "Simple",
    "shortDescription": "Crea un grupo en Bitwarden, asigna miembros y verifica los miembros del grupo.",
    "useCaseExamples": [
      "Provisión inicial de un nuevo grupo de Bitwarden llamado \"Documentación Interna\" y asignación automática de todos los miembros de la organización a él para asegurar acceso universal a recursos de inicio.",
      "Creación de un grupo de acceso universal \"Herramientas Esenciales\" para todos los empleados, asegurando que al momento de su creación, todos los miembros existentes sean añadidos de forma automática.",
      "Restauración o recreación de un grupo de Bitwarden \"Acceso Global\" después de una eliminación accidental, garantizando que todos los miembros de la organización sean repoblados en él de inmediato.",
      "Configuración de un nuevo grupo \"Cumplimiento Normativo\" en Bitwarden y asignación automática de todos los miembros de la organización para cumplir con requisitos de auditoría o políticas de seguridad.",
      "Al lanzar un nuevo proyecto que requiere acceso compartido a un conjunto de credenciales, el flujo crea un grupo específico como \"Proyecto Alfa\" y añade automáticamente a todos los miembros de la organización para facilitar la colaboración."
    ],
    "similarities": [],
    "id": 29,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0014-monitor-verstappen-tweets.json-1758118020876",
    "fileName": "0014-monitor-verstappen-tweets.json",
    "flowName": "New tweets",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Análisis de Datos",
      "Comunicación"
    ],
    "mainFunction": "Buscar tweets con una palabra clave específica, comparar con una lista existente en Airtable y añadir solo los nuevos tweets a una base de datos de Airtable.",
    "automationDestinations": [
      "Airtable"
    ],
    "dataOrigins": [
      "Twitter",
      "Manual Trigger"
    ],
    "keyNodes": [
      "Twitter",
      "Airtable",
      "Merge",
      "Set"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo busca tweets por una palabra clave, los compara con registros existentes en Airtable y guarda los tweets nuevos en Airtable.",
    "useCaseExamples": [
      "Una marca de ropa deportiva monitorea menciones de su nombre y productos en Twitter para gestionar la reputación y medir el impacto de campañas, guardando todos los tweets nuevos en Airtable.",
      "Un equipo de marketing analiza las menciones de la competencia en Twitter para identificar nuevas tendencias de mercado, quejas de clientes o lanzamientos de productos, almacenando los datos en una base de Airtable.",
      "Organizadores de un evento o conferencia utilizan el flujo para recopilar en tiempo real todos los tweets que usen el hashtag oficial del evento, creando un archivo en Airtable para seguimiento post-evento.",
      "Un equipo de ventas busca proactivamente tweets de usuarios expresando la necesidad de un producto o servicio que su empresa ofrece, guardando estos leads en Airtable para un posterior contacto.",
      "Un investigador académico recolecta datos de Twitter sobre un tema social específico (ej. \"cambio climático\" o \"salud mental\") para un estudio, almacenando los tweets relevantes y nuevos en Airtable para su análisis."
    ],
    "similarities": [],
    "id": 30,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0015-berlin-clima-plivo.json-1758118038735",
    "fileName": "0015-berlin-clima-plivo.json",
    "flowName": "Enviar Temperatura Diaria por SMS",
    "mainArea": "Productividad",
    "secondaryAreas": [
      "Notificaciones",
      "Alertas",
      "Operaciones"
    ],
    "mainFunction": "Obtener la temperatura de una ciudad y enviarla como un mensaje SMS a un número de teléfono específico de forma programada.",
    "automationDestinations": [
      "Plivo"
    ],
    "dataOrigins": [
      "Cron",
      "OpenWeatherMap"
    ],
    "keyNodes": [
      "Cron",
      "OpenWeatherMap",
      "Plivo"
    ],
    "complexity": "Simple",
    "shortDescription": "Envía la temperatura diaria de una ciudad por SMS a las 9 AM.",
    "useCaseExamples": [
      "Un individuo en Berlín recibe un SMS cada mañana a las 9 AM con la temperatura actual, ayudándole a decidir qué ropa usar para el día.",
      "Un turista visitando Berlín configura este flujo para obtener la temperatura matutina y planificar sus actividades al aire libre o visitas turísticas.",
      "Una persona que cuida a un familiar mayor en Berlín configura el flujo para enviar un mensaje diario con la temperatura, asegurándose de que su familiar se vista adecuadamente.",
      "El dueño de una cafetería con terraza en Berlín usa el flujo para recibir la temperatura de la mañana y decidir si debe preparar la terraza con parasoles o estufas.",
      "Un organizador de eventos al aire libre en Berlín utiliza el SMS diario de temperatura para hacer ajustes de última hora en la logística del evento o para informar a los participantes."
    ],
    "similarities": [],
    "id": 31,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0016-todoist-task-creator.json-1758118071165",
    "fileName": "0016-todoist-task-creator.json",
    "flowName": "Create a new task in Todoist",
    "mainArea": "Productividad",
    "secondaryAreas": [
      "Gestión de Proyectos",
      "Gestión Personal"
    ],
    "mainFunction": "Crear una nueva tarea en Todoist.",
    "automationDestinations": [
      "Todoist"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "manualTrigger",
      "Todoist"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo permite crear rápidamente una nueva tarea en Todoist mediante un disparador manual.",
    "useCaseExamples": [
      "Registro rápido de ideas o pensamientos: Un usuario tiene una idea repentina y usa el flujo de trabajo para crear rápidamente una tarea en Todoist con un título predefinido como \"Idea: [Descripción]\" para revisarla más tarde.",
      "Creación de una tarea estándar post-reunión: Después de una reunión, el usuario activa el flujo para crear una tarea genérica como \"Enviar resumen de la reunión X\" o \"Seguimiento con el participante Y\", simplificando la creación de tareas recurrentes.",
      "Añadir una tarea para seguimiento de cliente: Un comercial termina una llamada y quiere añadir rápidamente una tarea en Todoist para \"Hacer seguimiento con el Cliente Z en 3 días\" sin tener que abrir la aplicación.",
      "Generar un recordatorio de mantenimiento rutinario: Para tareas de mantenimiento que se deciden hacer \"cuando se tenga tiempo\" (ej. \"Limpiar bandeja de entrada\"), el usuario activa el flujo manualmente cuando decide que es el momento.",
      "Creación de una tarea de \"revisión de pendiente\": Al finalizar el día, el usuario puede activar este flujo para generar una tarea como \"Revisar tareas incompletas del día\" en Todoist, recordándose analizar lo que quedó pendiente."
    ],
    "similarities": [],
    "id": 32,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0017-stripe-hubspot-slack.json-1758118118655",
    "fileName": "0017-stripe-hubspot-slack.json",
    "flowName": "On new Stripe Invoice Payment update Hubspot and notify the team in Slack",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Finanzas",
      "Operaciones"
    ],
    "mainFunction": "Actualizar un trato en Hubspot a pagado cuando se recibe un pago de factura exitoso en Stripe y notificar al equipo a través de Slack, incluyendo el manejo de casos donde no hay número de pedido o el trato no se encuentra.",
    "automationDestinations": [
      "Hubspot",
      "Slack"
    ],
    "dataOrigins": [
      "Stripe"
    ],
    "keyNodes": [
      "Stripe Trigger",
      "Hubspot",
      "IF",
      "Slack"
    ],
    "complexity": "Medio",
    "shortDescription": "Automatiza la actualización de tratos en Hubspot y la notificación en Slack tras un pago exitoso de Stripe, con gestión de errores para números de pedido ausentes o tratos no encontrados.",
    "useCaseExamples": [
      "Una empresa de SaaS gestiona sus suscripciones. Cuando un cliente paga una factura anual a través de Stripe, el flujo encuentra el trato correspondiente en HubSpot (usando el número de PO), lo marca como \"Pagado\" y notifica al equipo de finanzas en Slack con todos los detalles de la transacción.",
      "Una agencia de consultoría cobra a un cliente un hito de un proyecto importante. El flujo detecta el pago en Stripe, busca el trato en HubSpot por el número de orden de compra, actualiza el estado del trato a \"Pagado\" y envía un mensaje a Slack al equipo de cuentas para su registro, o alerta si el PO no fue encontrado.",
      "Una plataforma de e-learning B2B recibe el pago por un paquete de licencias empresariales. El flujo de trabajo identifica el ID de la orden de compra de Stripe, localiza el trato en HubSpot, cambia su estado a \"Factura Pagada\" y alerta al equipo de éxito del cliente en Slack para iniciar el proceso de onboarding.",
      "Una empresa de servicios profesionales procesa pagos de sus clientes vía Stripe. Tras un pago exitoso, el sistema busca el proyecto o \"deal\" en HubSpot mediante el PO, actualiza el campo \"Pagado\" y notifica al gerente de proyecto y al equipo de contabilidad en Slack sobre el ingreso, incluyendo una alerta si el trato no pudo ser encontrado.",
      "Un proveedor de soluciones de software recibe un pago por una personalización o módulo adicional de un cliente existente. El flujo de trabajo valida el pago en Stripe, vincula el número de PO al trato específico en HubSpot para marcarlo como \"Completado/Pagado\" y envía un aviso al equipo de desarrollo y ventas en Slack, o reporta si falta el número de PO."
    ],
    "similarities": [],
    "id": 33,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0018-entrevistas-y-participantes.json-1758118144873",
    "fileName": "0018-entrevistas-y-participantes.json",
    "flowName": "Combinación de Datos por ID",
    "mainArea": "Gestión de Datos",
    "secondaryAreas": [
      "Recursos Humanos",
      "Ventas",
      "Marketing"
    ],
    "mainFunction": "Combina dos conjuntos de datos separados basándose en un identificador común para enriquecer o relacionar información entre ellos.",
    "automationDestinations": [
      "Transformación Interna de Datos"
    ],
    "dataOrigins": [
      "Nodos Function (Datos Mock)"
    ],
    "keyNodes": [
      "Function",
      "Merge"
    ],
    "complexity": "Medio",
    "shortDescription": "Combina dos conjuntos de datos de origen simulado utilizando un ID común para emparejar y fusionar registros.",
    "useCaseExamples": [
      "Un flujo de trabajo de Recursos Humanos que combina los detalles de las entrevistas programadas (candidato, tema, entrevistador ID) con la información detallada de los entrevistadores (nombre, cargo, departamento, foto) obtenida de un sistema de gestión de empleados, para generar informes de contratación completos o paneles de control.",
      "En una plataforma de gestión de eventos, fusionar la lista de sesiones y sus ponentes (ID del ponente) con los perfiles completos de los ponentes (nombre, biografía, foto de perfil) para crear un directorio de ponentes dinámico o agendas personalizadas para los asistentes.",
      "Para un sistema de gestión de proyectos, integrar las asignaciones de tareas (tarea, responsable ID) con la información del perfil del miembro del equipo (nombre, rol, departamento, foto) para visualizaciones del equipo, directorios internos o para facilitar la comunicación.",
      "En un centro de soporte al cliente, unificar los tickets de soporte (ID del agente asignado) con los perfiles detallados de los agentes (nombre, equipo, foto) para el seguimiento del rendimiento, la gestión de la capacidad o para presentar a los agentes a los clientes.",
      "En una institución educativa, combinar los registros de tutorías o asesorías (ID del tutor) con los perfiles de los tutores (nombre, departamento, foto, especialización) para la asignación de estudiantes, la generación de informes académicos o para permitir a los estudiantes buscar tutores por perfil."
    ],
    "similarities": [],
    "id": 34,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0019-EscrituraJSONBinario.json-1758118177928",
    "fileName": "0019-EscrituraJSONBinario.json",
    "flowName": "Escribir Datos Binarios en Archivo",
    "mainArea": "Desarrollo",
    "secondaryAreas": [
      "IT",
      "Operaciones"
    ],
    "mainFunction": "Genera datos de ejemplo en formato JSON, los transforma a binario y los guarda en un archivo local.",
    "automationDestinations": [
      "Sistema de Archivos Local"
    ],
    "dataOrigins": [
      "Generación Interna (Función n8n)"
    ],
    "keyNodes": [
      "Function",
      "Write Binary File"
    ],
    "complexity": "Simple",
    "shortDescription": "Genera y guarda datos de ejemplo en formato binario en un archivo.",
    "useCaseExamples": [
      "Guardar automáticamente las respuestas JSON de una API externa (por ejemplo, datos de stock, información meteorológica o detalles de pedidos) en un archivo local para análisis posterior o como respaldo.",
      "Exportar los resultados de una consulta a una base de datos (SQL o NoSQL) como un archivo JSON en un servidor local para informes o para transferirlos a otros sistemas.",
      "Registrar eventos específicos del sistema o la aplicación, transformando la información del evento a formato JSON y guardándola como un archivo de registro diario o mensual para auditoría y depuración.",
      "Almacenar los envíos de formularios web: cada vez que un usuario completa un formulario, capturar los datos como JSON y guardarlos como un archivo individual para su posterior procesamiento o archivo.",
      "Generar y almacenar archivos de configuración JSON personalizados para diferentes entornos de aplicación (desarrollo, pruebas, producción) basándose en parámetros dinámicos."
    ],
    "similarities": [],
    "id": 35,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0020-todoist-ai-categorization.json-1758118209766",
    "fileName": "0020-todoist-ai-categorization.json",
    "flowName": "Gestión Inteligente de Prioridades en Todoist",
    "mainArea": "Productividad",
    "secondaryAreas": [
      "Organización Personal",
      "Gestión de Proyectos"
    ],
    "mainFunction": "Automatizar la categorización de tareas de Todoist y la actualización de su prioridad utilizando inteligencia artificial.",
    "automationDestinations": [
      "Todoist"
    ],
    "dataOrigins": [
      "Schedule Trigger",
      "Todoist"
    ],
    "keyNodes": [
      "Schedule Trigger",
      "Todoist",
      "OpenAI",
      "Filter",
      "Set"
    ],
    "complexity": "Medio",
    "shortDescription": "Categoriza y asigna prioridad automáticamente a las tareas de Todoist usando IA, ejecutándose en un horario.",
    "useCaseExamples": [
      "Un usuario individual con una bandeja de entrada de Todoist llena de tareas variadas puede usar este flujo para categorizar automáticamente las nuevas tareas en proyectos personales (como \"Trabajo\", \"Salud\", \"Hogar\") y asignarles una prioridad predefinida, asegurando que las tareas más importantes se destaquen.",
      "Un freelancer que recibe tareas de varios clientes en su Todoist puede configurar el flujo para que, de forma programada, clasifique las nuevas entradas por cliente o tipo de proyecto (ej. \"Cliente A\", \"Diseño Gráfico\", \"Facturación\") y actualice su prioridad según la urgencia o importancia asociada a cada categoría.",
      "Un gerente de equipo utiliza una bandeja de entrada compartida en Todoist para nuevas solicitudes. El flujo puede categorizar las solicitudes en áreas como \"Soporte Técnico\", \"Desarrollo\", \"Administración\" y ajustar automáticamente la prioridad de la tarea para reflejar los SLAs o la importancia estratégica de cada tipo de solicitud.",
      "Un estudiante gestiona múltiples proyectos académicos en Todoist. Este flujo puede ejecutarse diariamente para clasificar nuevas tareas en asignaturas (ej. \"Matemáticas\", \"Historia\", \"Programación\") y asignarles una prioridad diferente, ayudándole a enfocarse en los trabajos más urgentes de cada curso.",
      "Una persona ocupada usa Todoist para organizar tareas domésticas. El flujo podría categorizar automáticamente nuevas entradas en proyectos como \"Limpieza\", \"Compras\", \"Mantenimiento\" o \"Finanzas\" y establecer su prioridad, garantizando que las tareas críticas como pagar facturas siempre tengan la atención necesaria."
    ],
    "similarities": [],
    "id": 36,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0021-mock-contacts-to-sheet.json-1758120542942",
    "fileName": "0021-mock-contacts-to-sheet.json",
    "flowName": "Loading data into a spreadsheet",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing",
      "Gestión de Datos",
      "Servicio al Cliente"
    ],
    "mainFunction": "Prepara y carga datos de contactos de CRM en una hoja de cálculo o base de datos.",
    "automationDestinations": [
      "Google Sheets",
      "Airtable",
      "Base de Datos"
    ],
    "dataOrigins": [
      "Hubspot"
    ],
    "keyNodes": [
      "Function",
      "Set",
      "NoOp"
    ],
    "complexity": "Simple",
    "shortDescription": "Carga contactos de CRM en una hoja de cálculo o base de datos de manera sencilla.",
    "useCaseExamples": [
      "Un equipo de marketing necesita exportar semanalmente todos los contactos nuevos de su CRM a una hoja de cálculo de Google para segmentarlos y usarlos en una campaña de email marketing específica, ya que la plataforma de email no se integra directamente con el CRM.",
      "Una empresa desea mantener un registro de respaldo diario de todos sus contactos de clientes en una hoja de cálculo de Airtable, extrayendo el nombre y el correo electrónico del CRM principal para fines de auditoría y recuperación de datos.",
      "Un organizador de eventos necesita compilar una lista consolidada de todos los asistentes de diferentes eventos virtuales. Este flujo puede extraer los datos de registro (simulados por el CRM) y añadirlos automáticamente a una hoja maestra en una base de datos.",
      "Un gerente de ventas quiere preparar una lista rápida de contactos clave (nombre y email) para un equipo de telemarketing. Este flujo le permite extraer la información relevante del CRM y volcarla en una hoja de cálculo que el equipo puede usar fácilmente sin acceder al CRM completo.",
      "Un equipo de soporte al cliente necesita una forma sencilla de ver el nombre y el correo electrónico de los usuarios que han enviado una nueva consulta. El flujo extrae estos datos del sistema de tickets (simulado por el CRM) y los carga en una hoja de cálculo compartida para un seguimiento rápido."
    ],
    "similarities": [],
    "id": 37,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0022-copper-person-flow.json-1758120597165",
    "fileName": "0022-copper-person-flow.json",
    "flowName": "Gestionar Contactos en Copper",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Atención al Cliente"
    ],
    "mainFunction": "Crea, actualiza y recupera información de contactos (personas) dentro de Copper.",
    "automationDestinations": [
      "Copper"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "manualTrigger",
      "Copper"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo permite realizar operaciones básicas de gestión de contactos (crear, actualizar, obtener) en el CRM Copper de forma manual.",
    "useCaseExamples": [
      "Incorporación manual de un nuevo lead o socio: Un miembro del equipo de ventas o alianzas necesita agregar rápidamente un nuevo contacto (un lead prometedor o un socio estratégico) en Copper, registrando su nombre y correo electrónico, y luego añadiendo su número de teléfono tan pronto como esté disponible para un seguimiento completo.",
      "Pruebas de integración para nuevas conexiones de datos: Antes de lanzar una integración a gran escala que sincronice datos de clientes de una base de datos externa a Copper, se utiliza este flujo para verificar que la creación, actualización y recuperación de un registro de persona funcionan correctamente con las credenciales y configuraciones de la API.",
      "Actualización de información de contactos clave tras una reunión: Después de una reunión importante, un gerente desea actualizar la información de un contacto clave en Copper. Este flujo podría ser adaptado para crear un nuevo contacto (si no existe) o actualizar su número de teléfono (si se obtuvo durante la reunión), y luego verificar los datos actualizados.",
      "Soporte al cliente para la creación/modificación de perfiles: Un agente de soporte recibe una solicitud de un cliente para actualizar su información de contacto (por ejemplo, añadir un número de teléfono de trabajo) o para registrar un nuevo contacto que representará a su empresa. El agente usa un mecanismo manual (simulado por el disparador) para iniciar este proceso en Copper.",
      "Generación de contactos de prueba para desarrollo y staging: En un entorno de desarrollo o staging, se necesita poblar el CRM con datos de prueba. Este flujo proporciona una forma rápida y repetible de crear un contacto básico, añadirle un número de teléfono y verificar su existencia, facilitando las pruebas de otras funcionalidades que dependan de datos en Copper."
    ],
    "similarities": [],
    "id": 38,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0023-coda-insert-data.json-1758120625551",
    "fileName": "0023-coda-insert-data.json",
    "flowName": "Insert data into a new row for a table in Coda",
    "mainArea": "Gestión de Datos",
    "secondaryAreas": [
      "Productividad",
      "Operaciones"
    ],
    "mainFunction": "Inserta datos definidos en una nueva fila de una tabla específica en Coda.",
    "automationDestinations": [
      "Coda"
    ],
    "dataOrigins": [
      "Disparador Manual"
    ],
    "keyNodes": [
      "manualTrigger",
      "Set",
      "Coda"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo inserta datos predefinidos en una nueva fila de una tabla de Coda.",
    "useCaseExamples": [
      "Captura de Leads desde Formularios Web: Cuando un nuevo lead completa un formulario en una página web (por ejemplo, Google Forms o Typeform), el flujo de trabajo extrae los datos del lead (nombre, email, empresa) y los inserta automáticamente como una nueva fila en una tabla de Coda utilizada como CRM.",
      "Registro de Tareas o Incidencias: Al crearse una nueva tarea en una herramienta de gestión de proyectos (como Trello o Asana), el flujo de trabajo captura los detalles (título, descripción, asignado) y los añade como una nueva entrada en una tabla de seguimiento de proyectos en Coda.",
      "Sincronización de Nuevos Pedidos de E-commerce: Cada vez que se realiza un nuevo pedido en una plataforma de comercio electrónico (como Shopify o WooCommerce), el flujo extrae la información relevante (ID del pedido, cliente, total, artículos) y la inserta automáticamente en una tabla de Coda para el seguimiento de ventas o inventario.",
      "Registro de Comentarios de Clientes: Cuando un cliente envía un formulario de feedback o una encuesta (por ejemplo, a través de SurveyMonkey o un formulario personalizado), el contenido del feedback (calificación, comentario, nombre del cliente) se registra como una nueva fila en una tabla de Coda dedicada a la gestión de comentarios.",
      "Añadir Nuevas Citas a un Calendario/Agenda: Al programarse una nueva cita en una herramienta de calendario (como Calendly o Google Calendar), los detalles de la cita (fecha, hora, participante, tema) se extraen y se insertan como un nuevo registro en una tabla de Coda utilizada para la agenda o el seguimiento de reuniones."
    ],
    "similarities": [],
    "id": 39,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0024-iss-position-updates.json-1758120654704",
    "fileName": "0024-iss-position-updates.json",
    "flowName": "Send updates about the position of the ISS every minute to a topic in ActiveMQ",
    "mainArea": "IT/Operaciones",
    "secondaryAreas": [
      "Ciencia y Datos",
      "Monitoreo",
      "IoT"
    ],
    "mainFunction": "Obtener la posición actual de la Estación Espacial Internacional (ISS) a través de una API externa y enviar estos datos a un topic de ActiveMQ cada minuto.",
    "automationDestinations": [
      "ActiveMQ"
    ],
    "dataOrigins": [
      "API externa",
      "Cron"
    ],
    "keyNodes": [
      "Cron",
      "HTTP Request",
      "Set",
      "AMQP Sender"
    ],
    "complexity": "Simple",
    "shortDescription": "Envía actualizaciones de la posición de la ISS a ActiveMQ cada minuto.",
    "useCaseExamples": [
      "Un museo espacial o un sitio web educativo utiliza estos datos para alimentar un mapa interactivo que muestra la posición actual de la ISS en tiempo real, accesible al público.",
      "Una aplicación de astronomía aficionada consume estos mensajes para enviar notificaciones a los usuarios cuando la ISS sea visible desde su ubicación geográfica específica.",
      "Un equipo de investigación espacial recopila y almacena esta secuencia de datos de posición para realizar análisis a largo plazo sobre la órbita, velocidad y patrones de movimiento de la ISS.",
      "Estaciones terrestres de aficionados o profesionales que necesiten apuntar automáticamente sus antenas o telescopios para seguir el paso de la ISS, utilizando estos datos como entrada.",
      "Desarrolladores de simulaciones 3D o experiencias de realidad virtual utilizan esta transmisión de datos en vivo para dar vida a modelos de la ISS, permitiendo a los usuarios \"volar junto\" a ella virtualmente."
    ],
    "similarities": [],
    "id": 40,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0025-google-slides-thumbnail.json-1758120682532",
    "fileName": "0025-google-slides-thumbnail.json",
    "flowName": "Extracción de Diapositivas y Miniaturas de Google Slides",
    "mainArea": "Gestión de Contenido",
    "secondaryAreas": [
      "Marketing",
      "Educación",
      "Productividad"
    ],
    "mainFunction": "Recuperar todas las diapositivas de una presentación de Google Slides y generar miniaturas para cada una de ellas.",
    "automationDestinations": [],
    "dataOrigins": [
      "Google Slides",
      "Manual Trigger"
    ],
    "keyNodes": [
      "Google Slides",
      "Google Slides1"
    ],
    "complexity": "Simple",
    "shortDescription": "Obtiene diapositivas y sus miniaturas de una presentación de Google Slides.",
    "useCaseExamples": [
      "Un equipo de marketing necesita generar rápidamente miniaturas de todas las diapositivas de presentaciones de productos para una biblioteca interna de recursos visuales, permitiendo a los miembros del equipo buscar y previsualizar contenido sin abrir cada archivo completo.",
      "Un departamento de RRHH quiere crear un índice visual para un curso de formación online. El flujo de trabajo podría descargar las miniaturas de cada diapositiva de la presentación del curso, que luego podrían usarse como enlaces a las secciones correspondientes en una plataforma de e-learning.",
      "Una empresa necesita archivar automáticamente una representación visual de todas las diapositivas de sus presentaciones trimestrales de resultados para fines de cumplimiento y auditoría, asegurando un registro visual de lo que se presentó.",
      "Un creador de contenido quiere publicar un resumen visual de una presentación reciente en el blog de la empresa o en la intranet. El flujo de trabajo descargaría las miniaturas de las diapositivas clave, que luego podrían incrustarse como imágenes en el post.",
      "Un community manager necesita extraer rápidamente elementos visuales de presentaciones existentes para crear publicaciones en redes sociales. Al obtener las miniaturas de las diapositivas, puede identificar y reutilizar el contenido visual más relevante de forma eficiente."
    ],
    "similarities": [],
    "id": 41,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0026-linkedin-top-sourcer.json-1758120710002",
    "fileName": "0026-linkedin-top-sourcer.json",
    "flowName": "TopSourcer - Finds LinkedIn Profiles using natural language",
    "mainArea": "Recursos Humanos",
    "secondaryAreas": [
      "Ventas",
      "Inteligencia de Negocio"
    ],
    "mainFunction": "Genera cadenas de búsqueda booleanas a partir de descripciones de puestos para encontrar perfiles de LinkedIn y los guarda en una hoja de Google Sheets.",
    "automationDestinations": [
      "Google Sheets"
    ],
    "dataOrigins": [
      "Chat",
      "OpenAI"
    ],
    "keyNodes": [
      "When chat message received",
      "Generate a Boolean Search String",
      "Google Boolean Search",
      "Extracts all linkedin urls from the google http response",
      "If desired results not reached",
      "Appends the results to the sheet"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo usa IA para convertir descripciones de trabajo en búsquedas booleanas de Google, encuentra perfiles de LinkedIn y los guarda automáticamente en Google Sheets.",
    "useCaseExamples": [
      "Un reclutador de una empresa de tecnología necesita encontrar ingenieros de software senior con experiencia en React, Node.js y AWS en la región de Madrid. Introduce la descripción del puesto en lenguaje natural y el flujo genera una lista de perfiles de LinkedIn relevantes en una hoja de cálculo.",
      "Una agencia de contratación especializada busca candidatos para un puesto de \"Jefe de Producto con experiencia en SaaS y metodologías ágiles\". Usan el flujo para generar cadenas de búsqueda complejas y obtener una amplia base de datos de posibles candidatos para sus clientes.",
      "El equipo de RRHH de una gran corporación necesita cubrir una posición muy nicho, como \"Científico de Datos con especialización en procesamiento de lenguaje natural y experiencia en el sector financiero\". El flujo les ayuda a identificar rápidamente expertos en la materia.",
      "Un equipo de ventas quiere identificar directores de marketing en empresas de e-commerce en Latinoamérica para una campaña de prospección. Utilizan el flujo para buscar perfiles que coincidan con estos criterios y recopilar URLs de LinkedIn para su alcance inicial.",
      "Una empresa desea analizar el panorama de talento para \"expertos en ciberseguridad con certificaciones CISSP o CISM\" en Europa. El flujo les permite compilar rápidamente una lista de profesionales para entender la distribución geográfica y las habilidades predominantes."
    ],
    "similarities": [],
    "id": 42,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0027-chargebee-nuevo-cliente.json-1758120731382",
    "fileName": "0027-chargebee-nuevo-cliente.json",
    "flowName": "Create a new customer in Chargebee",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Finanzas",
      "Atención al Cliente"
    ],
    "mainFunction": "Crear un nuevo cliente en Chargebee.",
    "automationDestinations": [
      "Chargebee"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Chargebee"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo permite crear manualmente un nuevo cliente en Chargebee.",
    "useCaseExamples": [
      "Creación automática de un nuevo cliente en Chargebee cuando un usuario se registra en un formulario web para una suscripción a un servicio.",
      "Sincronización de nuevos clientes desde un CRM (por ejemplo, Salesforce o HubSpot) a Chargebee después de que un acuerdo de venta es cerrado y marcado como \"ganado\".",
      "Un miembro del equipo de soporte o ventas crea manualmente un nuevo cliente en Chargebee para una suscripción personalizada o un acuerdo offline.",
      "Registro de asistentes a un evento o webinar de pago como nuevos clientes en Chargebee para gestionar futuras facturaciones o accesos.",
      "Integración con una plataforma de e-commerce (como Shopify o WooCommerce) para crear automáticamente un cliente en Chargebee cuando se realiza una compra de un producto de suscripción."
    ],
    "similarities": [],
    "id": 43,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0028-verificacion-email-deliverable.json-1758120759250",
    "fileName": "0028-verificacion-email-deliverable.json",
    "flowName": "verify email",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Ventas",
      "Operaciones"
    ],
    "mainFunction": "Verifica la existencia y validez de una dirección de correo electrónico utilizando un servicio externo.",
    "automationDestinations": [],
    "dataOrigins": [
      "Manual"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Function Item",
      "Uproc",
      "IF"
    ],
    "complexity": "Simple",
    "shortDescription": "Verifica la validez de una dirección de correo electrónico.",
    "useCaseExamples": [
      "Validar correos electrónicos de nuevos registros de usuarios para asegurar que son válidos antes de crear una cuenta.",
      "Limpiar periódicamente una lista de marketing por correo electrónico, identificando y eliminando direcciones que ya no son entregables para mejorar la eficacia de las campañas.",
      "Verificar la validez de las direcciones de correo electrónico proporcionadas en formularios de contacto o soporte al cliente para asegurar una comunicación efectiva.",
      "Confirmar que el correo electrónico de un nuevo suscriptor a un boletín es entregable antes de añadirlo a la lista activa, evitando rebotes.",
      "Integrar la verificación de correo electrónico en formularios de comentarios o solicitudes para reducir el spam y asegurar que las respuestas lleguen a direcciones válidas."
    ],
    "similarities": [],
    "id": 44,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0029-mattermost-emelia-trigger.json-1758120778057",
    "fileName": "0029-mattermost-emelia-trigger.json",
    "flowName": "Notificación de Respuesta a Campaña de Emelia en Mattermost",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Ventas"
    ],
    "mainFunction": "Notificar en Mattermost cuando un contacto responde a una campaña de Emelia.",
    "automationDestinations": [
      "Mattermost"
    ],
    "dataOrigins": [
      "Emelia Trigger"
    ],
    "keyNodes": [
      "Emelia Trigger",
      "Mattermost"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo notifica al equipo en Mattermost cada vez que un contacto responde a una campaña de correo electrónico de Emelia.",
    "useCaseExamples": [
      "Un equipo de ventas envía campañas de correo electrónico a clientes potenciales a través de Emelia. Cuando un prospecto responde a una campaña, el equipo recibe una notificación instantánea en su canal de ventas de Mattermost, lo que les permite hacer un seguimiento rápido.",
      "Un equipo de soporte al cliente utiliza Emelia para enviar campañas proactivas con actualizaciones o encuestas. Si un cliente responde con una pregunta o un problema, el equipo es alertado inmediatamente en su canal de soporte de Mattermost para atender el caso.",
      "Un departamento de marketing lanza una campaña de lanzamiento de un nuevo producto. Cada vez que un receptor responde mostrando interés o haciendo una pregunta, el equipo de marketing recibe una notificación en tiempo real en Mattermost para medir el compromiso.",
      "Organizadores de eventos envían campañas de Emelia para invitaciones o confirmaciones de asistencia a un webinar. Si un invitado responde para confirmar o hacer una pregunta, el equipo de coordinación del evento es notificado en su canal de Mattermost.",
      "Un equipo de producto distribuye una encuesta de retroalimentación a través de Emelia. Cuando los usuarios envían sus respuestas, el equipo recibe alertas directas en su canal de Mattermost, facilitando una revisión y análisis ágil de los comentarios."
    ],
    "similarities": [],
    "id": 45,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0030-iss-monitoring-sqs.json-1758120800130",
    "fileName": "0030-iss-monitoring-sqs.json",
    "flowName": "Envío de Posición de la ISS a AWS SQS",
    "mainArea": "Monitoreo de Datos",
    "secondaryAreas": [
      "Integración de Datos",
      "Infraestructura IT",
      "Ciencia de Datos"
    ],
    "mainFunction": "Obtiene la posición actual de la Estación Espacial Internacional (ISS) en intervalos regulares y envía estos datos a una cola de AWS SQS.",
    "automationDestinations": [
      "AWS SQS"
    ],
    "dataOrigins": [
      "Cron",
      "API Externa (ISS Tracker)"
    ],
    "keyNodes": [
      "Cron",
      "HTTP Request",
      "Set",
      "AWS SQS"
    ],
    "complexity": "Simple",
    "shortDescription": "Recopila periódicamente la posición de la ISS mediante una API y la publica en una cola de AWS SQS.",
    "useCaseExamples": [
      "Monitoreo en tiempo real de la Estación Espacial Internacional (ISS) para una aplicación web que visualiza su trayectoria global en un mapa.",
      "Alimentar un sistema de alertas que notifique a los observadores de estrellas cuando la ISS sea visible desde su ubicación, basándose en los datos de posición recibidos cada minuto.",
      "Recopilar un historial detallado de la ubicación de la ISS en un lago de datos (data lake) para análisis científicos o estudios de trayectoria orbital a largo plazo.",
      "Suministrar datos de localización actual de la ISS a una pantalla interactiva en un museo de ciencia o centro educativo, mostrando su posición sobre la Tierra en ese instante.",
      "Integrar la información de la posición de la ISS en un sistema de radioaficionados para coordinar la escucha o el seguimiento de las transmisiones de la estación cuando pasa por una región determinada."
    ],
    "similarities": [],
    "id": 46,
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0031-webflow-crear-y-actualizar.json-1758126553721",
    "fileName": "0031-webflow-crear-y-actualizar.json",
    "flowName": "Prueba de Operaciones en Webflow",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Desarrollo Web",
      "Gestión de Contenido"
    ],
    "mainFunction": "Crea, actualiza y recupera elementos de una colección en Webflow.",
    "automationDestinations": [
      "Webflow"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Webflow"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo demuestra cómo crear, actualizar y recuperar elementos de una colección en Webflow.",
    "useCaseExamples": [
      "Automatizar pruebas de integración para las operaciones CRUD (Crear, Actualizar, Eliminar) en una colección específica de Webflow, donde se crea un elemento de prueba, se modifica su contenido y se elimina para verificar que la API funciona correctamente en cada etapa.",
      "Restablecer automáticamente un entorno de demostración de Webflow después de cada uso, creando un elemento temporal, actualizándolo con datos de ejemplo y luego eliminándolo para garantizar que la colección esté siempre limpia y lista para la siguiente demostración.",
      "Validar la estructura y manipulación de datos en una colección de Webflow durante el desarrollo de nuevas características: se crea un elemento con campos básicos, se actualiza para añadir más información (como una imagen) y finalmente se elimina para no dejar residuos en la base de datos.",
      "Gestionar contenido efímero o borradores temporales para campañas de marketing en Webflow: se crea una entrada rápida, se actualiza para incluir un activo visual (ej. un avatar de campaña) y, una vez finalizada la revisión o la campaña, se elimina automáticamente.",
      "Simular un ciclo de vida completo de un elemento de contenido (creación, edición y eliminación) en Webflow para fines de capacitación de nuevos usuarios o para demostrar las capacidades del CMS sin dejar datos persistentes después de la demostración."
    ],
    "similarities": [],
    "notes": "",
    "id": 47,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0032-iss-satellite-monitoring.json-1758126583207",
    "fileName": "0032-iss-satellite-monitoring.json",
    "flowName": "Seguimiento de la Posición de la ISS",
    "mainArea": "Análisis de Datos",
    "secondaryAreas": [
      "Educación",
      "Monitoreo",
      "Geoespacial"
    ],
    "mainFunction": "Obtiene la posición actual de la Estación Espacial Internacional (ISS) y la almacena en Google BigQuery de forma periódica.",
    "automationDestinations": [
      "Google BigQuery"
    ],
    "dataOrigins": [
      "Cron",
      "API de Posición de la ISS"
    ],
    "keyNodes": [
      "Cron",
      "HTTP Request",
      "Set",
      "Google BigQuery"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo rastrea la ubicación en tiempo real de la ISS y guarda los datos en Google BigQuery cada minuto.",
    "useCaseExamples": [
      "Monitoreo en tiempo real de la Estación Espacial Internacional (ISS) para fines educativos en museos o escuelas, mostrando su ubicación actual en un mapa.",
      "Recopilación de datos históricos de la trayectoria de la ISS en Google BigQuery para análisis científicos, estudios de órbita y predicción de pasadas visibles.",
      "Alimentar una aplicación web o móvil que muestre la posición actual de la ISS y notifique a los usuarios sobre su visibilidad desde su ubicación.",
      "Creación de dashboards interactivos y visualizaciones de datos avanzadas utilizando la posición de la ISS almacenada en BigQuery para análisis geográficos y temporales.",
      "Implementación de un sistema de alerta que notifique a investigadores o aficionados cuando la ISS pase sobre una región geográfica de interés específica, como una ciudad o un observatorio."
    ],
    "similarities": [],
    "notes": "",
    "id": 48,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0033-ip-location-email.json-1758126610974",
    "fileName": "0033-ip-location-email.json",
    "flowName": "location_by_ip",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Ventas",
      "Atención al Cliente"
    ],
    "mainFunction": "Determina la ubicación de un usuario por su dirección IP y envía un email de bienvenida localizado.",
    "automationDestinations": [
      "AWS SES (Email)"
    ],
    "dataOrigins": [
      "Disparador Manual",
      "Uproc (API de geolocalización)",
      "Datos Fijos (Función)"
    ],
    "keyNodes": [
      "Get Location By IP",
      "User in Spain?",
      "Send Spanish Email",
      "Send English Email"
    ],
    "complexity": "Medio",
    "shortDescription": "Obtiene la ubicación de un usuario por IP y le envía un email de bienvenida personalizado en español o inglés.",
    "useCaseExamples": [
      "Un nuevo usuario se registra en una plataforma online; el flujo detecta su IP, determina que está en España y automáticamente le envía un correo de bienvenida en español. Si está fuera de España, recibe el correo en inglés.",
      "Una empresa quiere mostrar banners publicitarios o contenido web específico por región. El flujo identifica la IP de un visitante, y si este proviene de España, le presenta una oferta en español; de lo contrario, una en inglés.",
      "Al procesar un formulario de contacto o una consulta de soporte, el flujo usa la IP del remitente. Si la IP indica que el usuario está en España, la respuesta automática o la asignación a un agente se realiza en español.",
      "Una aplicación móvil registra la IP del dispositivo al iniciar sesión. El flujo utiliza esta información para preconfigurar el idioma de la interfaz del usuario a español si se detecta que está en España, y a inglés en cualquier otro caso.",
      "En una tienda online, para mejorar la experiencia de compra, el flujo detecta la ubicación IP del visitante. Si es de España, se le muestra automáticamente los precios en euros y las opciones de envío relevantes para España; de lo contrario, se muestra un idioma y moneda por defecto (inglés/dólares)."
    ],
    "similarities": [],
    "notes": "",
    "id": 49,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0034-clearbit-persona-buscar.json-1758126643928",
    "fileName": "0034-clearbit-persona-buscar.json",
    "flowName": "Look up a person using their email in Clearbit",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing",
      "Inteligencia de Negocio"
    ],
    "mainFunction": "Buscar información detallada sobre una persona utilizando su dirección de correo electrónico a través de Clearbit.",
    "automationDestinations": [],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "Clearbit"
    ],
    "complexity": "Simple",
    "shortDescription": "Busca y obtiene información pública detallada sobre una persona en Clearbit usando su correo electrónico.",
    "useCaseExamples": [
      "Enriquecer automáticamente la información de nuevos leads capturados en un formulario web, obteniendo detalles como nombre, empresa y puesto para personalizar la comunicación de ventas.",
      "Actualizar o completar perfiles de clientes existentes en un CRM que solo tienen el correo electrónico, añadiendo datos demográficos y profesionales clave para un mejor segmento y atención.",
      "Cuando un cliente se comunica a través de un canal de soporte (ej. chat o correo), buscar su perfil al instante para que el agente tenga contexto sobre su rol y empresa, ofreciendo un servicio más relevante.",
      "Calificar y segmentar a los asistentes a un webinar o evento online en función de su correo electrónico, obteniendo información sobre su empresa y seniority para adaptar el seguimiento post-evento.",
      "Investigar rápidamente el perfil de un candidato potencial en la fase inicial de reclutamiento si solo se dispone de su dirección de correo electrónico, para evaluar su adecuación al puesto antes de un contacto directo."
    ],
    "similarities": [],
    "notes": "",
    "id": 50,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0035-airtable-mailcheck-validacion.json-1758126669117",
    "fileName": "0035-airtable-mailcheck-validacion.json",
    "flowName": "Verificación de Correos en Airtable",
    "mainArea": "Gestión de Datos",
    "secondaryAreas": [
      "Marketing",
      "Servicio al Cliente",
      "Administración"
    ],
    "mainFunction": "Valida direcciones de correo electrónico de registros en Airtable utilizando Mailcheck y actualiza el estado de validez en la tabla de Airtable original.",
    "automationDestinations": [
      "Airtable"
    ],
    "dataOrigins": [
      "Airtable"
    ],
    "keyNodes": [
      "Airtable",
      "Mailcheck",
      "Set"
    ],
    "complexity": "Simple",
    "shortDescription": "Verifica correos electrónicos de Airtable y actualiza su estado de validez en la misma tabla.",
    "useCaseExamples": [
      "Validación de leads: Una empresa recopila leads en Airtable y necesita verificar la validez de los correos electrónicos para asegurar que los equipos de ventas se pongan en contacto con direcciones válidas, reduciendo la tasa de rebote.",
      "Limpieza de listas de correo: Un equipo de marketing mantiene una lista de suscriptores para newsletters en Airtable. Este flujo de trabajo puede ejecutarse periódicamente para identificar y marcar correos electrónicos inválidos, mejorando la entregabilidad de las campañas.",
      "Verificación de registros de eventos: Los organizadores de eventos usan Airtable para gestionar los registros. Este flujo puede validar automáticamente los correos electrónicos de los asistentes para asegurar que todas las comunicaciones importantes lleguen a su destino.",
      "Auditoría de contactos de proveedores: Una empresa almacena información de contacto de proveedores en Airtable. El flujo de trabajo puede verificar la existencia de los registros MX de los correos electrónicos para asegurar que los contactos son operativos y fiables.",
      "Detección de errores en formularios: Si un formulario web envía datos a Airtable, este flujo puede actuar como una validación post-envío, marcando cualquier dirección de correo electrónico que parezca ser incorrecta o ficticia, ayudando a corregir los datos en origen."
    ],
    "similarities": [],
    "notes": "",
    "id": 51,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0036-mattermost-notificacion-iniciado.json-1758126689275",
    "fileName": "0036-mattermost-notificacion-iniciado.json",
    "flowName": "Notificación de Inicio de n8n a Mattermost",
    "mainArea": "Operaciones TI",
    "secondaryAreas": [
      "Comunicación Interna",
      "Monitoreo"
    ],
    "mainFunction": "Envía un mensaje de notificación a un canal de Mattermost cuando la instancia de n8n se inicia.",
    "automationDestinations": [
      "Mattermost"
    ],
    "dataOrigins": [
      "n8n Trigger"
    ],
    "keyNodes": [
      "n8n Trigger",
      "Mattermost"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo envía una alerta a Mattermost cada vez que la instancia de n8n se inicia.",
    "useCaseExamples": [
      "Un equipo de DevOps recibe una alerta automática en Mattermost cada vez que la instancia de n8n se reinicia, lo que les permite monitorear la disponibilidad del servicio y detectar reinicios inesperados.",
      "Después de una actualización de software o mantenimiento programado en el servidor, los administradores de sistemas reciben una confirmación instantánea en Mattermost de que el servicio de n8n ha iniciado correctamente y está operativo.",
      "Un equipo que depende de automatizaciones críticas recibe una notificación en Mattermost cada vez que el entorno de n8n se vuelve a poner en marcha, asegurando que todos estén al tanto de cuándo las automatizaciones están activas de nuevo.",
      "Para fines de auditoría, se registra un mensaje en un canal específico de Mattermost cada vez que la instancia de n8n se inicia, proporcionando un registro de los tiempos de actividad del servicio.",
      "Cuando los flujos de trabajo fallan, el equipo de soporte técnico puede revisar el historial de Mattermost para ver si la instancia de n8n se ha reiniciado recientemente, lo que podría explicar interrupciones temporales en el servicio."
    ],
    "similarities": [],
    "notes": "",
    "id": 52,
    "isFavorite": false
  },
  {
    "id": 53,
    "workflow_uuid": "0037-mattermost-trigger.json-1758126750307",
    "fileName": "0037-mattermost-trigger.json",
    "flowName": "Análisis Fallido: 0037-mattermost-trigger.json",
    "mainArea": "Error",
    "secondaryAreas": [],
    "mainFunction": "An unexpected response was received from the server.",
    "automationDestinations": [],
    "dataOrigins": [],
    "keyNodes": [],
    "complexity": "Medio",
    "shortDescription": "El análisis con IA falló. Causa: An unexpected response was received from the server.. Revisa la clave de API o la configuración del modelo.",
    "useCaseExamples": [],
    "similarities": [],
    "isFavorite": false,
    "notes": ""
  },
  {
    "workflow_uuid": "0038-orbit-member-update.json-1758126776760",
    "fileName": "0038-orbit-member-update.json",
    "flowName": "Create a new member, update the information of the member, create a note and a post for the member in Orbit",
    "mainArea": "Comunidad",
    "secondaryAreas": [
      "Marketing",
      "Gestión de Contenidos"
    ],
    "mainFunction": "Crear, actualizar, añadir notas y publicaciones para un miembro en la plataforma Orbit.",
    "automationDestinations": [
      "Orbit"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "manualTrigger",
      "Orbit"
    ],
    "complexity": "Simple",
    "shortDescription": "Automatiza la gestión completa de miembros en Orbit, incluyendo la creación, actualización de información, adición de notas y registro de publicaciones.",
    "useCaseExamples": [
      "Cuando un nuevo contribuidor realiza su primer pull request en un repositorio de GitHub, el flujo automatiza la creación o actualización de su perfil en Orbit, le asigna una etiqueta \"primer-contribuidor\", añade una nota de bienvenida y publica un enlace a las guías de contribución.",
      "Al registrarse un usuario en un evento de la comunidad (webinar, taller), el flujo crea o actualiza su perfil de miembro en Orbit, añade la etiqueta \"asistente-evento-X\", registra una nota de su participación y publica un enlace al material del evento o a la grabación.",
      "Si un miembro de la comunidad es mencionado en un artículo de blog externo o crea contenido relevante, el flujo puede actualizar su perfil de Orbit, añadir una etiqueta como \"mención-destacada\", registrar una nota con el contexto y publicar el enlace a dicho contenido.",
      "Cuando un usuario proporciona feedback detallado o informa un error crítico a través de un formulario específico, el flujo actualiza su perfil en Orbit, añade una etiqueta \"feedback-activo\", registra una nota con los detalles y enlaza al ticket de soporte o hilo de discusión correspondiente.",
      "Para reconocer un logro comunitario, como un miembro que se convierte en moderador de foro o alcanza un número significativo de respuestas, el flujo actualiza su perfil en Orbit, añade una etiqueta \"líder-comunidad\", registra una nota de felicitación y publica un enlace a un anuncio público de su logro."
    ],
    "similarities": [],
    "notes": "",
    "id": 54,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0039-clickup-task-creator.json-1758126803448",
    "fileName": "0039-clickup-task-creator.json",
    "flowName": "Create a task in ClickUp",
    "mainArea": "Gestión de Proyectos",
    "secondaryAreas": [
      "Operaciones",
      "Productividad",
      "Desarrollo de Software"
    ],
    "mainFunction": "Crear una tarea en ClickUp.",
    "automationDestinations": [
      "ClickUp"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "Manual Trigger",
      "ClickUp"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo permite crear una tarea en ClickUp de forma manual.",
    "useCaseExamples": [
      "Cuando un nuevo cliente se registra en el CRM, se crea automáticamente una tarea en ClickUp para el equipo de onboarding con los pasos a seguir.",
      "Si un correo electrónico con un asunto específico llega a una bandeja de entrada designada, se genera una tarea en ClickUp para el equipo correspondiente para su revisión.",
      "Después de que un formulario web de 'contacto' es enviado, se crea una tarea en ClickUp para el equipo de ventas para hacer un seguimiento.",
      "Al finalizar una etapa clave en un proyecto gestionado en otra herramienta (ej. Trello), se crea una tarea en ClickUp para notificar al equipo de desarrollo el siguiente paso.",
      "Cuando una nueva entrada es añadida a una hoja de cálculo de Google Sheets con solicitudes de contenido, se crea una tarea en ClickUp para el equipo de marketing para su creación."
    ],
    "similarities": [],
    "notes": "",
    "id": 55,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0040-screenshot-automation.json-1758126821864",
    "fileName": "0040-screenshot-automation.json",
    "flowName": "screenshot",
    "mainArea": "Productividad",
    "secondaryAreas": [
      "Marketing",
      "Desarrollo Web",
      "Soporte al Cliente"
    ],
    "mainFunction": "Genera capturas de pantalla de una página web (normal y de página completa), las guarda en Dropbox y las envía por correo electrónico al usuario especificado.",
    "automationDestinations": [
      "Dropbox",
      "AWS SES"
    ],
    "dataOrigins": [
      "Manual Trigger",
      "Function Item"
    ],
    "keyNodes": [
      "Function Item",
      "uproc",
      "HTTP Request",
      "Dropbox",
      "Merge",
      "AWS SES"
    ],
    "complexity": "Medio",
    "shortDescription": "Genera capturas de pantalla de una web, las sube a Dropbox y las envía por correo electrónico.",
    "useCaseExamples": [
      "Monitoreo semanal de la competencia: Una empresa configura el flujo para tomar automáticamente capturas de pantalla de los sitios web de sus principales competidores cada lunes, guardarlas en Dropbox y enviar un correo electrónico al equipo de marketing para revisar rápidamente los cambios.",
      "Auditorías visuales post-despliegue: Un equipo de desarrollo integra este flujo para que, después de cada despliegue en producción, se generen capturas de pantalla de páginas clave del sitio web, se almacenen en Dropbox como registro histórico y se envíe una notificación por correo electrónico al equipo de QA.",
      "Reportes de accesibilidad web: Una consultora de accesibilidad utiliza el flujo para documentar el estado visual de los sitios web de sus clientes, generando capturas de pantalla antes y después de las mejoras, guardándolas en Dropbox para referencia y compartiéndolas por correo electrónico con los clientes.",
      "Generación automática de vistas previas para un CMS: Al publicar un nuevo artículo en un blog, el flujo se activa para tomar una captura de pantalla del artículo recién publicado, subirla a Dropbox y enviar el enlace de la imagen al editor para usarla como vista previa en redes sociales o en el backend del CMS.",
      "Documentación de incidentes y errores visuales: Cuando un usuario reporta un problema visual en una aplicación web, el equipo de soporte puede activar el flujo introduciendo la URL afectada, generando así capturas de pantalla del error que se guardan en Dropbox y se envían por correo electrónico al equipo de desarrollo para una rápida depuración."
    ],
    "similarities": [],
    "notes": "",
    "id": 56,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0041-filemaker-multi-step.json-1758126851760",
    "fileName": "0041-filemaker-multi-step.json",
    "flowName": "Gestión Secuencial de Registros en FileMaker",
    "mainArea": "Gestión de Información",
    "secondaryAreas": [
      "Administración",
      "Operaciones",
      "Recursos Humanos"
    ],
    "mainFunction": "Realiza una secuencia de operaciones en FileMaker: primero crea un registro, luego lo edita y finalmente lo recupera.",
    "automationDestinations": [
      "FileMaker"
    ],
    "dataOrigins": [
      "Disparador Manual"
    ],
    "keyNodes": [
      "On clicking 'execute'",
      "FileMaker",
      "FileMaker2",
      "FileMaker3"
    ],
    "complexity": "Simple",
    "shortDescription": "Un flujo que demuestra cómo crear, editar y consultar registros en FileMaker de forma secuencial.",
    "useCaseExamples": [
      "Gestión de Clientes Potenciales (Leads): Un nuevo lead se registra inicialmente en FileMaker con su nombre y apellido. Posteriormente, la información se edita para añadir su país de origen o interés. Finalmente, se recupera el registro completo para su asignación a un vendedor.",
      "Incorporación de Empleados: Se crea un registro básico para un nuevo empleado en FileMaker con su nombre. Luego, se actualiza el registro con su ubicación o país de residencia. Finalmente, se recupera toda la información del empleado para su perfil interno.",
      "Procesamiento de Pedidos: Cuando se recibe un pedido, se crea un registro inicial en FileMaker con el nombre del cliente. Después, se actualiza el país de destino del envío. Finalmente, se consultan los detalles del pedido para el despacho.",
      "Seguimiento de Activos Fijos: Se registra un nuevo activo (ej. una maquinaria) en FileMaker con un identificador y responsable inicial. Luego, se actualiza su ubicación o país de adquisición. Finalmente, se recuperan los datos para auditoría o inventario.",
      "Administración de Proyectos: Al iniciar un nuevo proyecto, se crea un registro en FileMaker con el nombre del líder de proyecto. Posteriormente, se edita para añadir el país donde se ejecuta el proyecto. Finalmente, se obtiene el registro completo del proyecto para su monitoreo."
    ],
    "similarities": [],
    "notes": "",
    "id": 57,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0042-iss-mqtt-flow.json-1758126871275",
    "fileName": "0042-iss-mqtt-flow.json",
    "flowName": "Seguimiento Posición ISS",
    "mainArea": "Integración de Sistemas",
    "secondaryAreas": [
      "Análisis de Datos",
      "IoT",
      "Monitoreo"
    ],
    "mainFunction": "Obtener la posición actual de la Estación Espacial Internacional (ISS) y publicarla en un tema MQTT.",
    "automationDestinations": [
      "MQTT"
    ],
    "dataOrigins": [
      "Cron",
      "API Externa (ISS Tracker)"
    ],
    "keyNodes": [
      "Cron",
      "HTTP Request",
      "Set",
      "MQTT"
    ],
    "complexity": "Simple",
    "shortDescription": "Obtiene la ubicación en tiempo real de la ISS y la publica en un tema MQTT.",
    "useCaseExamples": [
      "Visualización en un dashboard IoT: Un sistema de monitoreo se suscribe al tema MQTT 'iss-position' para mostrar la ubicación actual de la ISS en un mapa en tiempo real, junto con su latitud y longitud, para entusiastas del espacio o centros de control.",
      "Integración con aplicaciones móviles o web: Una aplicación para rastrear la ISS se suscribe a este flujo MQTT para recibir actualizaciones instantáneas de la posición y mostrarlas a los usuarios sin necesidad de hacer llamadas directas a la API externa.",
      "Automatización de un sistema de casa inteligente: Un sistema de domótica compatible con MQTT consume los datos de la posición de la ISS, permitiendo, por ejemplo, que una pantalla inteligente muestre su ubicación o que se active una notificación cuando la estación pase sobre una región específica.",
      "Alimentación de una base de datos para análisis histórico: Un servicio backend se suscribe al tema MQTT y almacena cada mensaje de posición en una base de datos para construir un registro histórico de la trayectoria de la ISS, útil para estudios científicos o educativos.",
      "Proyectos educativos y de ciencia ciudadana: Escuelas o universidades utilizan este flujo para proporcionar datos en tiempo real a sus estudiantes, quienes pueden desarrollar sus propios visualizadores, predecir órbitas o realizar experimentos basados en la posición de la ISS a través de un feed MQTT accesible."
    ],
    "similarities": [],
    "notes": "",
    "id": 58,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0044-gmail-drive-adjunto.json-1758126894374",
    "fileName": "0044-gmail-drive-adjunto.json",
    "flowName": "Guardar Adjuntos de Gmail en Google Drive",
    "mainArea": "Gestión Documental",
    "secondaryAreas": [
      "Productividad Personal",
      "Administración"
    ],
    "mainFunction": "Extrae adjuntos de correos electrónicos de Gmail (filtrados por una etiqueta) y los sube automáticamente a una carpeta específica en Google Drive, capturando el enlace del archivo subido.",
    "automationDestinations": [
      "Google Drive"
    ],
    "dataOrigins": [
      "Gmail"
    ],
    "keyNodes": [
      "Gmail",
      "Google Drive",
      "Set"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo guarda automáticamente los adjuntos de correos de Gmail con una etiqueta específica en Google Drive y obtiene su enlace.",
    "useCaseExamples": [
      "Una agencia de marketing recibe anuncios en video de sus clientes a través de correos electrónicos. Utilizan una etiqueta de Gmail como \"Videos Clientes\" para estos correos. El flujo de trabajo descarga automáticamente los archivos MP4 adjuntos y los sube a una carpeta de Google Drive específica para su posterior revisión por el equipo de diseño.",
      "Un departamento de Recursos Humanos recibe currículums (documentos PDF) de candidatos por correo electrónico. Etiquetan estos correos como \"Candidatos CV\". El flujo de trabajo extrae los archivos PDF y los almacena automáticamente en una carpeta de Google Drive \"CVs Pendientes\", facilitando el acceso para el equipo de contratación.",
      "Un equipo de ventas recibe contratos firmados (archivos PDF escaneados) de clientes por correo electrónico. Asignan la etiqueta \"Contratos Firmados\" a estos correos. El flujo de trabajo carga automáticamente estos documentos a una carpeta de Google Drive \"Contratos Legales\", asegurando un archivo organizado y accesible.",
      "Un equipo de desarrollo de software recibe informes de errores con capturas de pantalla o grabaciones de pantalla (imágenes o MP4) de probadores externos por correo electrónico. Los correos se marcan con la etiqueta \"Reportes Bugs\". El flujo de trabajo guarda los archivos adjuntos en una carpeta compartida de Google Drive para que los desarrolladores los analicen.",
      "Un educador solicita a sus estudiantes que envíen tareas (documentos, presentaciones) por correo electrónico, pidiéndoles que apliquen una etiqueta específica, por ejemplo, \"Tareas Clase\". El flujo de trabajo recopila automáticamente todos los archivos adjuntos de estos correos y los organiza en una carpeta de Google Drive designada para las calificaciones de la asignatura."
    ],
    "similarities": [],
    "notes": "",
    "id": 59,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0045-google-books-automation.json-1758126920779",
    "fileName": "0045-google-books-automation.json",
    "flowName": "Get a volume and add it to your bookshelf",
    "mainArea": "Personal",
    "secondaryAreas": [
      "Educación",
      "Productividad"
    ],
    "mainFunction": "Obtener la información de un volumen de Google Books y añadirlo a una estantería personal.",
    "automationDestinations": [
      "Google Books"
    ],
    "dataOrigins": [
      "Manual Trigger",
      "Google Books"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Google Books"
    ],
    "complexity": "Simple",
    "shortDescription": "Obtiene los detalles de un libro de Google Books y lo añade a tu estantería personal.",
    "useCaseExamples": [
      "Un usuario quiere añadir rápidamente los libros recomendados en una lista o artículo a su estantería de 'Lectura Pendiente' en Google Books sin tener que buscarlos manualmente.",
      "Un club de lectura decide el 'libro del mes' y el organizador utiliza el flujo para añadir automáticamente ese volumen a la estantería compartida del club en Google Books.",
      "Un profesor identifica textos específicos (por su ID en Google Books) que desea que sus alumnos tengan en una estantería de 'Recursos del Curso', y utiliza el flujo para agregarlos.",
      "Un editor de contenido prepara una lista curada de libros para un evento o conferencia y usa este flujo para poblar una estantería dedicada en Google Books con esos volúmenes específicos.",
      "Un desarrollador integra este flujo con una aplicación de recomendación de libros, permitiendo a los usuarios añadir un libro directamente a su estantería personal de Google Books con un solo clic, una vez que el ID del volumen es conocido."
    ],
    "similarities": [],
    "notes": "",
    "id": 60,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0046-email-invite-calendar.json-1758126933352",
    "fileName": "0046-email-invite-calendar.json",
    "flowName": "Automatización de Invitaciones de Eventos vía iCalendar por Correo",
    "mainArea": "Comunicaciones",
    "secondaryAreas": [
      "Organización de Eventos",
      "Marketing",
      "Recursos Humanos"
    ],
    "mainFunction": "Generar automáticamente un archivo iCalendar para un evento específico y enviarlo como adjunto en un correo electrónico a los destinatarios.",
    "automationDestinations": [
      "Servicio de Correo Electrónico (SMTP)"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "Manual Trigger",
      "iCalendar",
      "Send Email"
    ],
    "complexity": "Simple",
    "shortDescription": "Crea y envía invitaciones de eventos en formato iCalendar por correo electrónico.",
    "useCaseExamples": [
      "Envío automático de invitaciones a reuniones de equipo internas con el archivo iCalendar adjunto.",
      "Confirmación de registro a un seminario web, enviando el evento de calendario directamente al correo del asistente.",
      "Programación y envío de citas con clientes o pacientes, incluyendo el archivo iCalendar para facilitar su adición al calendario personal.",
      "Notificación de eventos educativos o talleres a los participantes, con los detalles del curso y una invitación de calendario adjunta.",
      "Coordinación y confirmación de entrevistas de trabajo, enviando a los candidatos un correo con la información y el archivo iCalendar de la entrevista."
    ],
    "similarities": [],
    "notes": "",
    "id": 61,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0047-calendly-notion-auto.json-1758126948108",
    "fileName": "0047-calendly-notion-auto.json",
    "flowName": "Calendly a Notion",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing",
      "Gestión de Proyectos"
    ],
    "mainFunction": "Crear automáticamente una nueva entrada en Notion para cada cita programada en Calendly, registrando los detalles del invitado.",
    "automationDestinations": [
      "Notion"
    ],
    "dataOrigins": [
      "Calendly"
    ],
    "keyNodes": [
      "Calendly Trigger",
      "Notion"
    ],
    "complexity": "Simple",
    "shortDescription": "Registra automáticamente nuevas citas de Calendly en una base de datos de Notion.",
    "useCaseExamples": [
      "Un equipo de ventas utiliza Calendly para programar demos de productos. Cada vez que un prospecto reserva una demo, sus datos (nombre, correo electrónico) se añaden automáticamente a una base de datos de 'Leads de Ventas' en Notion para su seguimiento.",
      "Un consultor independiente usa Calendly para que los clientes reserven sesiones de consulta. Cuando se programa una nueva consulta, los detalles del cliente se registran instantáneamente en una base de datos de 'Clientes y Consultas' en Notion.",
      "Un departamento de Recursos Humanos programa entrevistas con candidatos a través de Calendly. Cada vez que un candidato reserva una entrevista, su información se añade a una base de datos de 'Seguimiento de Candidatos' en Notion para facilitar la gestión del proceso de contratación.",
      "Una agencia de marketing utiliza Calendly para programar reuniones iniciales con nuevos clientes. Al reservar una reunión, los datos del cliente se guardan en una base de datos de 'Proyectos de Clientes' en Notion, marcando el inicio del proceso de integración.",
      "Un organizador de eventos ofrece sesiones individuales o reuniones de networking a través de Calendly durante un congreso. Cada vez que un asistente reserva una sesión, sus detalles se registran en una base de datos de 'Participantes del Evento' en Notion para el seguimiento personalizado."
    ],
    "similarities": [],
    "notes": "",
    "id": 62,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0048-notion-mattermost-marketing.json-1758126969559",
    "fileName": "0048-notion-mattermost-marketing.json",
    "flowName": "Notificación de Notas de Reunión de Marketing de Notion a Mattermost",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Comunicación Interna",
      "Productividad"
    ],
    "mainFunction": "Notificar al equipo de Marketing en Mattermost sobre nuevas notas de reunión añadidas en una base de datos de Notion.",
    "automationDestinations": [
      "Mattermost"
    ],
    "dataOrigins": [
      "Notion"
    ],
    "keyNodes": [
      "Notion Trigger",
      "IF",
      "Mattermost"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo envía una alerta a Mattermost cada vez que se registra una nueva nota de reunión para el equipo de Marketing en Notion.",
    "useCaseExamples": [
      "Cada vez que se añade un nuevo acta de reunión a la base de datos de Notion del equipo de Marketing, se envía automáticamente una notificación con el resumen y el enlace a un canal específico de Mattermost para que todo el equipo esté al tanto.",
      "Cuando un miembro del equipo de contenido agrega una nueva entrada (por ejemplo, un artículo, post de blog) al calendario editorial gestionado en Notion, y está clasificada como \"Marketing\", el flujo avisa al canal de Mattermost del equipo.",
      "Un gerente de proyectos crea una nueva página en Notion para una tarea o un proyecto específico del equipo de Marketing. El flujo notifica a los miembros del equipo en Mattermost sobre la nueva asignación o inicio del proyecto.",
      "Después de una sesión de lluvia de ideas, las nuevas ideas se documentan como páginas en una base de datos de Notion. Si estas ideas están etiquetadas para \"Marketing\", el equipo recibe un mensaje en Mattermost para revisarlas.",
      "Un equipo de marketing utiliza Notion para rastrear los entregables de campañas. Cuando un entregable clave (ej. borrador de anuncio, gráfico) se añade como una nueva página y se marca para el equipo de \"Marketing\", se envía una alerta al canal de Mattermost para su revisión inmediata."
    ],
    "similarities": [],
    "notes": "",
    "id": 63,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0049-chargebee-event-trigger.json-1758126982282",
    "fileName": "0049-chargebee-event-trigger.json",
    "flowName": "Receive updates for events in Chargebee",
    "mainArea": "Operaciones",
    "secondaryAreas": [
      "Finanzas",
      "Atención al Cliente"
    ],
    "mainFunction": "Monitorizar y recibir notificaciones de eventos generados en Chargebee.",
    "automationDestinations": [],
    "dataOrigins": [
      "Chargebee"
    ],
    "keyNodes": [
      "Chargebee Trigger"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo recibe actualizaciones automáticas cuando ocurren eventos en Chargebee.",
    "useCaseExamples": [
      "Enviar automáticamente un correo de bienvenida y crear un nuevo registro en el CRM (ej. Salesforce) cada vez que un nuevo cliente se suscribe en Chargebee.",
      "Notificar al equipo de soporte al cliente vía Slack cuando un pago de suscripción falla o una suscripción es cancelada para iniciar un seguimiento proactivo.",
      "Sincronizar automáticamente la información de nuevas facturas y pagos exitosos desde Chargebee a un sistema de contabilidad como QuickBooks o Xero.",
      "Actualizar el perfil de un cliente en una plataforma de marketing (ej. HubSpot) cuando se produce un cambio en su plan de suscripción o en su estado de pago en Chargebee.",
      "Desencadenar la provisión o desprovisión de acceso a un servicio externo (ej. una herramienta SaaS) cuando una suscripción es creada, activada, pausada o cancelada en Chargebee."
    ],
    "similarities": [],
    "notes": "",
    "id": 64,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0050-calendly-humantic-personality-analysis.json-1758127005099",
    "fileName": "0050-calendly-humantic-personality-analysis.json",
    "flowName": "Análisis de Personalidad de Asistentes a Calendly y Registro en Notion",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing",
      "Recursos Humanos"
    ],
    "mainFunction": "Capturar datos de nuevos asistentes a eventos de Calendly, realizar un análisis de personalidad con Humantic AI y registrar la información relevante, incluyendo el análisis, en Notion.",
    "automationDestinations": [
      "Notion"
    ],
    "dataOrigins": [
      "Calendly"
    ],
    "keyNodes": [
      "Calendly Trigger",
      "Humantic AI",
      "Notion"
    ],
    "complexity": "Simple",
    "shortDescription": "Automatiza la captura de asistentes de Calendly, su análisis de personalidad con Humantic AI y el almacenamiento en Notion.",
    "useCaseExamples": [
      "Un vendedor que agenda una llamada de descubrimiento con un nuevo prospecto vía Calendly, y el flujo guarda automáticamente un perfil de personalidad detallado del prospecto en Notion para personalizar el enfoque de la venta.",
      "Un reclutador que programa una entrevista con un candidato, y el sistema genera un análisis de personalidad en Notion antes de la reunión para entender mejor el estilo de comunicación y comportamiento del candidato.",
      "Un consultor que reserva una sesión inicial con un cliente potencial. El flujo obtiene información sobre su personalidad y la almacena en Notion, permitiéndole adaptar su propuesta y estrategia de interacción.",
      "Un coach de vida o desarrollo profesional que programa una sesión inicial con un nuevo cliente. El flujo provee un análisis de personalidad en Notion para personalizar el plan de coaching.",
      "Un gerente de éxito del cliente que organiza una reunión de bienvenida con un nuevo cliente. El flujo le da una visión de la personalidad del cliente en Notion para adaptar la comunicación y fortalecer la relación desde el principio."
    ],
    "similarities": [],
    "notes": "",
    "id": 65,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0052-release-content-publisher.json-1758127582634",
    "fileName": "0052-release-content-publisher.json",
    "flowName": "Get all the stories starting with `release` and publish them",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Gestión de Contenidos",
      "Operaciones"
    ],
    "mainFunction": "Obtener todas las historias de Storyblok que comienzan con 'release' y publicarlas automáticamente.",
    "automationDestinations": [
      "Storyblok"
    ],
    "dataOrigins": [
      "Manual Trigger",
      "Storyblok"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Storyblok"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo obtiene y publica historias de Storyblok que empiezan con la palabra 'release'.",
    "useCaseExamples": [
      "Un equipo de desarrollo prepara las notas de lanzamiento de un nuevo software en Storyblok, nombrando cada entrada con un prefijo \"release-\". Cuando la versión está lista, un miembro del equipo ejecuta este flujo para publicar todas las notas de lanzamiento simultáneamente.",
      "Un gerente de contenido ha redactado múltiples anuncios de características nuevas para una \"liberación\" de producto, guardándolos como historias que comienzan con \"release-vX.X\". En la fecha de lanzamiento, activa el flujo para hacerlos visibles en el sitio web de una sola vez.",
      "Una agencia de marketing gestiona el contenido de varias campañas estacionales que se publican bajo un tema de \"lanzamiento\". Una vez que todas las piezas (p. ej., landing pages, artículos de blog) están aprobadas y nombradas apropiadamente, el flujo se usa para lanzarlas todas al mismo tiempo.",
      "Un editor de blog prepara una serie de artículos relacionados con el \"lanzamiento\" de un nuevo servicio. Para evitar publicar cada artículo manualmente, utiliza este flujo para poner en línea toda la colección de historias que comienzan con \"release-\" con un solo clic.",
      "Una empresa utiliza Storyblok para documentar actualizaciones de productos. Cuando una nueva \"release\" está lista para ser anunciada, el equipo de producto activa este flujo para publicar todos los cambios documentados, asegurando que la información sea consistente y esté disponible al instante."
    ],
    "similarities": [],
    "notes": "",
    "id": 66,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0053-ssl-expiry-checker.json-1758127599902",
    "fileName": "0053-ssl-expiry-checker.json",
    "flowName": "Get SSL Certificate",
    "mainArea": "Operaciones de TI",
    "secondaryAreas": [
      "Desarrollo Web",
      "Seguridad de la Información",
      "Monitoreo"
    ],
    "mainFunction": "Verificar el estado de un certificado SSL para un dominio específico y enviar una alarma si ha expirado.",
    "automationDestinations": [
      "Telegram"
    ],
    "dataOrigins": [
      "Disparador Manual"
    ],
    "keyNodes": [
      "uproc",
      "IF",
      "Telegram"
    ],
    "complexity": "Medio",
    "shortDescription": "Monitorea la expiración de certificados SSL de un dominio y notifica vía Telegram si el certificado ha caducado.",
    "useCaseExamples": [
      "Una pequeña empresa desea monitorear el certificado SSL de su sitio web principal (por ejemplo, su tienda online) para recibir una notificación instantánea si caduca y evitar interrupciones de servicio o advertencias de seguridad para sus clientes.",
      "Un equipo de TI necesita asegurar que el certificado SSL de una aplicación interna crítica o un servidor de autenticación esté siempre vigente. Configuran este flujo para que les alerte vía Telegram si el certificado de este servicio específico deja de ser válido.",
      "Una agencia de desarrollo web monitorea proactivamente el certificado SSL del sitio web de un cliente clave. Utilizan este flujo para ser alertados en cuanto el certificado caduque, permitiéndoles gestionarlo antes de que el cliente se vea afectado.",
      "Un desarrollador o bloguero personal tiene un sitio web o un proyecto open-source y quiere una forma sencilla de ser notificado si su certificado SSL caduca, asegurando la disponibilidad y confianza de su plataforma.",
      "Un administrador de sistemas ha desplegado un nuevo servicio o microservicio y configura este flujo de trabajo para realizar una verificación continua del certificado SSL del nuevo endpoint, asegurándose de que la seguridad esté siempre activa y válida."
    ],
    "similarities": [],
    "notes": "",
    "id": 67,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0054-clickup-trigger.json-1758127616667",
    "fileName": "0054-clickup-trigger.json",
    "flowName": "Receive updates for events in ClickUp",
    "mainArea": "Gestión de Proyectos",
    "secondaryAreas": [
      "Operaciones",
      "Desarrollo de Producto"
    ],
    "mainFunction": "Recibir notificaciones o actualizaciones en tiempo real de eventos específicos que ocurren en ClickUp.",
    "automationDestinations": [],
    "dataOrigins": [
      "ClickUp"
    ],
    "keyNodes": [
      "ClickUp Trigger"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo se activa al recibir actualizaciones de eventos dentro de ClickUp.",
    "useCaseExamples": [
      "Notificar al equipo en Slack o Microsoft Teams cada vez que se actualice el estado de una tarea, se añada un nuevo comentario o se asigne una tarea en ClickUp.",
      "Sincronizar automáticamente nuevas tareas creadas en ClickUp con una fecha de vencimiento al calendario de Google del asignado, creando un evento para su seguimiento.",
      "Registrar automáticamente en una hoja de cálculo de Google Sheets la finalización de cada tarea en ClickUp, incluyendo la fecha de cierre y el nombre del responsable, para informes de productividad.",
      "Crear un borrador de factura en Stripe cuando una tarea de cliente en ClickUp alcance el estado 'Listo para facturar', extrayendo los detalles relevantes de la tarea.",
      "Enviar correos electrónicos de actualización personalizados a clientes o partes interesadas a través de Gmail o SendGrid cuando el estado de un proyecto o una tarea clave cambie en ClickUp (ej. de 'En progreso' a 'Revisión del cliente')."
    ],
    "similarities": [],
    "notes": "",
    "id": 68,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0055-line-message-processing.json-1758127634201",
    "fileName": "0055-line-message-processing.json",
    "flowName": "Guardar Enlace en Notion y Confirmar",
    "mainArea": "Productividad",
    "secondaryAreas": [
      "Gestión del Conocimiento",
      "Colaboración"
    ],
    "mainFunction": "Permite guardar enlaces enviados a través de un webhook en una base de datos de Notion, extrayendo el título de la página, y envía una confirmación.",
    "automationDestinations": [
      "Notion",
      "Discord"
    ],
    "dataOrigins": [
      "Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "Check type (IF)",
      "HTTP Request",
      "Extract Title",
      "Add Link to Notion"
    ],
    "complexity": "Medio",
    "shortDescription": "Automatiza el proceso de guardar enlaces de páginas web en Notion, extrayendo su título, y confirma la operación al origen del webhook.",
    "useCaseExamples": [
      "Un bot de Discord permite a los usuarios guardar enlaces a artículos interesantes en una base de datos de Notion compartida por el equipo, extrayendo automáticamente el título de la página.",
      "Un equipo de marketing utiliza un comando interno para recopilar enlaces a contenido relevante de la competencia o de la industria, almacenándolos con sus títulos en un Notion para su análisis.",
      "Un investigador académico automatiza la adición de referencias bibliográficas encontradas en línea a una base de datos de Notion, extrayendo el título de cada página web para una organización más sencilla.",
      "Empleados de una empresa utilizan un atajo o un formulario simple que activa este flujo de trabajo para añadir recursos útiles (documentación, tutoriales) a una base de conocimientos interna en Notion.",
      "Un gestor de proyectos usa una herramienta que envía un webhook con una URL para agregar rápidamente enlaces a especificaciones o documentos externos importantes directamente a un tablero de Notion del proyecto."
    ],
    "similarities": [],
    "notes": "",
    "id": 69,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0056-aws-transcribe-s3.json-1758127648219",
    "fileName": "0056-aws-transcribe-s3.json",
    "flowName": "Transcribir Audio desde AWS S3",
    "mainArea": "Procesamiento de Contenido",
    "secondaryAreas": [
      "Servicios al Cliente",
      "Investigación",
      "Media y Entretenimiento"
    ],
    "mainFunction": "Transcribir archivos de audio almacenados en AWS S3 utilizando el servicio AWS Transcribe.",
    "automationDestinations": [
      "AWS Transcribe"
    ],
    "dataOrigins": [
      "Manual Trigger",
      "AWS S3"
    ],
    "keyNodes": [
      "AWS S3",
      "AWS Transcribe"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo transcribe automáticamente archivos de audio desde un bucket de AWS S3 usando AWS Transcribe.",
    "useCaseExamples": [
      "Una empresa de medios carga regularmente grabaciones de podcasts o videos en un bucket S3. Este flujo de trabajo podría transcribir automáticamente todo el nuevo contenido para generar transcripciones, facilitar la búsqueda de palabras clave y mejorar el SEO.",
      "Un centro de llamadas guarda todas las grabaciones de las interacciones con los clientes en un bucket S3. El flujo de trabajo transcribiría estas llamadas para permitir el análisis de sentimiento, la identificación de problemas comunes o la auditoría de calidad de las interacciones.",
      "Una institución educativa o corporación almacena grabaciones de clases, seminarios web o reuniones internas en S3. El flujo de trabajo transcribiría automáticamente todas las grabaciones, creando un archivo de texto searchable para referencia futura o para generar actas.",
      "Un bufete de abogados o una entidad gubernamental archiva grabaciones de deposiciones, testimonios o evidencia de audio/video en S3. Las transcripciones permitirían una búsqueda rápida de información clave en grandes volúmenes de datos de audio.",
      "Una plataforma de e-learning o un creador de contenido de video sube sus videos a S3. El flujo de trabajo transcribiría automáticamente el audio para crear subtítulos, mejorar la accesibilidad y permitir la traducción del texto."
    ],
    "similarities": [],
    "notes": "",
    "id": 70,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0057-uptime-robot-monitor-management.json-1758127662096",
    "fileName": "0057-uptime-robot-monitor-management.json",
    "flowName": "Gestión de Monitores de UptimeRobot",
    "mainArea": "Operaciones de TI",
    "secondaryAreas": [
      "DevOps",
      "Administración de Sistemas"
    ],
    "mainFunction": "Gestionar monitores en UptimeRobot: crear un nuevo monitor, actualizar su nombre y luego obtener los detalles del monitor.",
    "automationDestinations": [
      "UptimeRobot"
    ],
    "dataOrigins": [
      "UptimeRobot"
    ],
    "keyNodes": [
      "UptimeRobot (Create Monitor)",
      "UptimeRobot (Update Monitor)",
      "UptimeRobot (Get Monitor)"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo crea, actualiza y recupera el estado de un monitor específico en UptimeRobot.",
    "useCaseExamples": [
      "Creación y actualización automática de monitores para nuevos proyectos: Cuando un nuevo sitio web o servicio se lanza, este flujo de trabajo puede ser invocado para crear automáticamente un monitor en UptimeRobot y luego actualizar su nombre amigable con información más detallada extraída de un sistema de gestión de proyectos.",
      "Sincronización de inventario de servicios con UptimeRobot: Un sistema de inventario o CMDB podría activar este flujo para asegurar que cada servicio registrado tenga un monitor en UptimeRobot, creando nuevos si faltan y actualizando sus propiedades (como el nombre amigable o la URL) si han cambiado.",
      "Integración en un pipeline de despliegue continuo (CI/CD): Tras un despliegue exitoso de una aplicación, el flujo podría crear o actualizar el monitor asociado en UptimeRobot con la nueva URL o los detalles del entorno, y luego obtener su estado para verificar que el monitoreo ha sido configurado correctamente.",
      "Gestión de monitores para clientes de SaaS: Una plataforma SaaS podría usar este flujo para crear y actualizar automáticamente los monitores de los sitios web o servicios de sus nuevos clientes en UptimeRobot, y luego recuperar los detalles del monitor para mostrárselos al cliente o para auditoría interna.",
      "Mantenimiento masivo de monitores existentes: Cuando se requiere cambiar la convención de nomenclatura de los monitores o actualizar ciertas propiedades (como los contactos de alerta) para un gran número de servicios, este flujo puede automatizar el proceso de buscar, actualizar y verificar cada monitor en UptimeRobot."
    ],
    "similarities": [],
    "notes": "",
    "id": 71,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0058-microsoft-todo-blueprint.json-1758127683153",
    "fileName": "0058-microsoft-todo-blueprint.json",
    "flowName": "Gestión de Tareas en Microsoft To Do",
    "mainArea": "Productividad",
    "secondaryAreas": [
      "Gestión de Proyectos",
      "Administración"
    ],
    "mainFunction": "Crear tareas de alta importancia en Microsoft To Do y actualizar su estado a 'en progreso'.",
    "automationDestinations": [
      "Microsoft To Do"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "Microsoft To Do",
      "Manual Trigger"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo crea una nueva tarea de alta importancia en Microsoft To Do y luego la actualiza para marcarla como 'en progreso'.",
    "useCaseExamples": [
      "Cuando se recibe una nueva solicitud de servicio a través de un formulario web, se crea automáticamente una tarea en Microsoft To Do para el equipo de soporte con los detalles de la solicitud y se marca inmediatamente como \"En Progreso\" para indicar que se está gestionando.",
      "Tras la confirmación de un nuevo pedido en una tienda online, se genera una tarea en To Do para el equipo de almacén (\"Preparar Pedido #XYZ\") y se establece su estado a \"En Progreso\" para agilizar el inicio del proceso de empaquetado y envío.",
      "Al iniciar el proceso de incorporación de un nuevo empleado, se crea una tarea específica (\"Configurar Acceso a Sistemas para [Nombre del Empleado]\") en una lista de tareas de RRHH y se marca automáticamente como \"En Progreso\" para asegurar que los preparativos se inician sin demora.",
      "Cuando un nuevo lead de ventas es capturado desde una campaña de marketing, se crea una tarea en To Do para el equipo de ventas (\"Contactar Lead [Nombre del Lead]\") con alta importancia y se actualiza su estado a \"En Progreso\" para indicar que el seguimiento debe comenzar de inmediato.",
      "Después de que un borrador de contenido es completado y enviado para revisión, se genera una tarea en To Do para el editor (\"Revisar Borrador de Artículo X\") y se pone en estado \"En Progreso\" para alertar al editor que el contenido está listo para su evaluación."
    ],
    "similarities": [],
    "notes": "",
    "id": 72,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0059-mattermost-bot-config.json-1758127697432",
    "fileName": "0059-mattermost-bot-config.json",
    "flowName": "Standup Bot - Initialize",
    "mainArea": "Productividad del Equipo",
    "secondaryAreas": [
      "IT & Operaciones",
      "Colaboración"
    ],
    "mainFunction": "Inicializar y guardar la configuración por defecto de un bot de standup, incluyendo tokens y URLs de Mattermost.",
    "automationDestinations": [
      "Sistema de Archivos",
      "Mattermost (configuración)"
    ],
    "dataOrigins": [
      "Disparador Manual"
    ],
    "keyNodes": [
      "ManualTrigger",
      "Set",
      "Move Binary Data",
      "Write Binary File"
    ],
    "complexity": "Simple",
    "shortDescription": "Inicializa la configuración por defecto de un bot de standup y la guarda en un archivo de configuración.",
    "useCaseExamples": [
      "Inicializar el bot de standup en un nuevo servidor de Mattermost, estableciendo todos los tokens y URLs necesarios por defecto para su primera ejecución.",
      "Restaurar la configuración del bot de standup a un estado predeterminado si el archivo de configuración actual se corrompe o se modifica accidentalmente.",
      "Preparar rápidamente un entorno de desarrollo o prueba para el bot de standup, asegurando que todos los parámetros esenciales estén correctamente configurados desde el inicio.",
      "Automatizar la configuración inicial del bot de standup como parte de un proceso más grande de incorporación para nuevos equipos o proyectos que usarán Mattermost.",
      "Estandarizar y aplicar una configuración base para el bot de standup en múltiples instancias de Mattermost, garantizando consistencia en los tokens y URLs utilizados."
    ],
    "similarities": [],
    "notes": "",
    "id": 73,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0060-notion-sigalerts.json-1758127749238",
    "fileName": "0060-notion-sigalerts.json",
    "flowName": "Gestión de Alertas de Máquinas con Notion y SIGNL4",
    "mainArea": "Operaciones TI",
    "secondaryAreas": [
      "Gestión de Proyectos",
      "Automatización"
    ],
    "mainFunction": "Automatizar la creación de alertas en SIGNL4 desde nuevas entradas en Notion, y actualizar el estado de las alertas en Notion y SIGNL4 en función de los eventos recibidos desde SIGNL4 y verificaciones programadas.",
    "automationDestinations": [
      "Notion",
      "SIGNL4"
    ],
    "dataOrigins": [
      "Webhook",
      "Notion Trigger",
      "Notion (lectura programada)"
    ],
    "keyNodes": [
      "Function",
      "Webhook",
      "Notion",
      "SIGNL4",
      "Interval"
    ],
    "complexity": "Complejo",
    "shortDescription": "Sincroniza el estado de las alertas de máquinas entre Notion y SIGNL4, creando alertas automáticamente y actualizando su estado bidireccionalmente.",
    "useCaseExamples": [
      "Monitorización de Infraestructura IT: Cuando un sistema de monitorización registra una alerta crítica (servidor caído, alto uso de CPU), se crea una entrada en una base de datos de Notion. Este flujo de trabajo envía una alerta urgente al equipo de TI de guardia a través de SIGNL4 y actualiza el estado de la alerta en Notion cuando es reconocida o cerrada en SIGNL4.",
      "Gestión de Incidentes en Producción/Fabricación: Ante la detección de una falla crítica en una máquina de producción mediante sensores, se genera automáticamente una página en Notion. El flujo alerta al personal de mantenimiento a través de SIGNL4, y las acciones de estos (reconocimiento, resolución) en SIGNL4 se sincronizan con el estado en Notion.",
      "Coordinación de Respuesta a Emergencias: En situaciones de emergencia (ej. desastres naturales), cuando se registra un nuevo incidente en una base de datos de Notion, el flujo notifica instantáneamente a los equipos de respuesta (bomberos, servicios médicos) mediante SIGNL4. Las actualizaciones del estado del incidente (reconocido, en ruta, resuelto) desde SIGNL4 se reflejan en tiempo real en Notion.",
      "Respuesta a Incidentes de Seguridad: Un sistema SIEM (Security Information and Event Management) detecta una amenaza de alta prioridad y crea una entrada en una base de datos de Notion de \"Incidentes de Seguridad\". El flujo de n8n alerta al equipo de ciberseguridad a través de SIGNL4, y el progreso de la investigación y resolución del incidente se actualiza automáticamente en Notion.",
      "Escalada de Problemas Críticos de Clientes: Cuando un problema de cliente de nivel crítico (ej. sistema de producción del cliente inoperativo) se registra en Notion, el flujo utiliza SIGNL4 para alertar inmediatamente al equipo de soporte de nivel 3 o a ingeniería. El estado del problema se mantiene actualizado en Notion a medida que el equipo responde y lo resuelve a través de SIGNL4."
    ],
    "similarities": [],
    "notes": "",
    "id": 74,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0061-flujo-buscar-empresa.json-1758170298346",
    "fileName": "0061-flujo-buscar-empresa.json",
    "flowName": "Get Company by Name",
    "mainArea": "Inteligencia de Negocio",
    "secondaryAreas": [
      "Ventas",
      "Marketing",
      "Servicio al Cliente"
    ],
    "mainFunction": "Buscar y verificar la existencia de una empresa por su nombre y país utilizando una API externa.",
    "automationDestinations": [
      "Uproc API"
    ],
    "dataOrigins": [
      "Disparador Manual"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Function",
      "Uproc",
      "IF"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo busca una empresa por nombre y país a través de una API y comprueba si los datos de la empresa fueron encontrados.",
    "useCaseExamples": [
      "Enriquecimiento de datos de clientes potenciales: Un nuevo cliente potencial envía un formulario web con el nombre de su empresa. El flujo de trabajo recupera automáticamente los detalles completos de la empresa (industria, tamaño, etc.) utilizando la función \"Get Company by Name\" y actualiza el registro del cliente potencial en el CRM.",
      "Validación de información de proveedores: Antes de incorporar a un nuevo proveedor, el departamento de compras utiliza el flujo de trabajo para verificar y obtener información oficial de la empresa a partir de su nombre y país, asegurando que los datos sean correctos y actualizados.",
      "Investigación de mercado de competidores: Un equipo de marketing ingresa el nombre de una empresa competidora y su país. El flujo de trabajo busca automáticamente información pública relevante sobre esa empresa, que luego puede ser utilizada para análisis competitivo.",
      "Automatización del proceso de debida diligencia (due diligence): Para cumplir con normativas o políticas internas, el flujo de trabajo puede buscar automáticamente información básica de una empresa por su nombre y país, sirviendo como un primer paso en un proceso de debida diligencia más amplio.",
      "Actualización de bases de datos de empresas: Una base de datos interna contiene nombres de empresas y sus países. El flujo de trabajo se ejecuta periódicamente para cada entrada, utilizando \"Get Company by Name\" para obtener los datos más recientes y corregir o actualizar la información desactualizada."
    ],
    "similarities": [],
    "notes": "",
    "id": 75,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0062-active-campaign-account-trigger.json-1758170433889",
    "fileName": "0062-active-campaign-account-trigger.json",
    "flowName": "Receive updates when a new account is added by an admin in ActiveCampaign",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing",
      "Gestión de Clientes"
    ],
    "mainFunction": "Recibir actualizaciones cuando un administrador añade una nueva cuenta en ActiveCampaign.",
    "automationDestinations": [],
    "dataOrigins": [
      "ActiveCampaign"
    ],
    "keyNodes": [
      "ActiveCampaign Trigger"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo notifica cada vez que un administrador añade una nueva cuenta en ActiveCampaign.",
    "useCaseExamples": [
      "Notificar automáticamente al equipo de ventas a través de Slack o correo electrónico cada vez que un administrador añade una nueva cuenta clave en ActiveCampaign, permitiendo una acción rápida.",
      "Sincronizar la información de la nueva cuenta añadida por un administrador en ActiveCampaign con un sistema CRM externo (como Salesforce o HubSpot) para mantener la base de datos centralizada actualizada.",
      "Crear una tarea automática en Asana o Trello para el equipo de éxito del cliente para que revisen la nueva cuenta o inicien el proceso de incorporación después de que un administrador la haya añadido.",
      "Registrar cada nueva cuenta añadida por un administrador en una hoja de cálculo de Google Sheets o una base de datos interna para fines de auditoría, seguimiento y generación de informes.",
      "Enviar un correo electrónico de bienvenida interno al gerente de cuentas asignado con los detalles de la nueva cuenta tan pronto como un administrador la registra en ActiveCampaign."
    ],
    "similarities": [],
    "notes": "",
    "id": 76,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0063-standup-bot-config.json-1758170447392",
    "fileName": "0063-standup-bot-config.json",
    "flowName": "Standup Bot - Read Config",
    "mainArea": "Operaciones",
    "secondaryAreas": [
      "Gestión de Proyectos",
      "IT"
    ],
    "mainFunction": "Leer y procesar un archivo de configuración local para un bot de standup.",
    "automationDestinations": [],
    "dataOrigins": [
      "Manual Trigger",
      "Sistema de Archivos"
    ],
    "keyNodes": [
      "manualTrigger",
      "readBinaryFile",
      "moveBinaryData"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo lee un archivo de configuración local para un bot de standup y lo prepara como JSON para su uso posterior.",
    "useCaseExamples": [
      "Configurar un bot de stand-up diario: El flujo lee un archivo JSON que especifica los canales de Slack o Teams, los miembros del equipo a interrogar, las preguntas del stand-up y el horario de publicación, permitiendo al bot automatizar la recolección de actualizaciones diarias.",
      "Gestión de credenciales para múltiples integraciones: Un flujo más amplio que interactúa con varias APIs (ej., Stripe, Mailchimp, CRM) puede leer un archivo de configuración JSON para obtener las claves API, tokens de autenticación y URLs de endpoints, centralizando la gestión de credenciales.",
      "Definición de parámetros para la generación de informes automatizados: Un flujo que genera informes semanales o mensuales para diferentes departamentos puede leer un archivo JSON para obtener los filtros de datos específicos, los destinatarios de correo electrónico y el formato de salida deseado para cada informe.",
      "Ajustes de reglas para el procesamiento de datos: En un pipeline de ETL (Extracción, Transformación, Carga), el flujo puede leer un archivo de configuración JSON que define las reglas de mapeo de columnas, las transformaciones de datos a aplicar y las rutas de archivos de origen/destino para un proceso de ingesta de datos.",
      "Personalización de notificaciones de monitoreo de sistemas: Un flujo que monitorea el rendimiento de servidores o servicios puede leer un archivo de configuración JSON para especificar los umbrales de alerta, los canales de notificación (ej., Slack, correo electrónico) y la lista de contactos a quienes alertar en caso de un incidente."
    ],
    "similarities": [],
    "notes": "",
    "id": 77,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0064-twitter-if-trigger (1).json-1758170489492",
    "fileName": "0064-twitter-if-trigger (1).json",
    "flowName": "Publicación Condicional en Twitter",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Comunicación",
      "Redes Sociales"
    ],
    "mainFunction": "Publica un mensaje predefinido en Twitter solo si una condición numérica específica se cumple durante la ejecución del flujo.",
    "automationDestinations": [
      "Twitter"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "IF",
      "Twitter"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo envía un tweet a Twitter si se cumple una condición numérica específica durante la ejecución.",
    "useCaseExamples": [
      "Publicación Rápida de Novedades o Anuncios: Un equipo de marketing puede usarlo para publicar instantáneamente un anuncio pre-redactado (por ejemplo, \"¡Oferta del día!\" o \"¡Nuevo artículo en el blog!\") en Twitter con solo un clic, asegurando el timing perfecto.",
      "Confirmación de Finalización de Tarea o Hito: Después de completar una fase crítica de un proyecto o una tarea importante, un gestor puede activar el flujo para tuitear una confirmación estándar, informando a los seguidores sobre el progreso.",
      "Alertas de Mantenimiento o Incidentes: Un equipo de operaciones puede tener un mensaje predefinido (\"Servicio X en mantenimiento\", \"Incidente resuelto\") listo para tuitear manualmente en Twitter, comunicando rápidamente el estado a los usuarios.",
      "Activación de Contenido Programado en Eventos en Vivo: Durante un evento en vivo o un webinar, un moderador puede presionar un botón para lanzar un tuit predefinido con información clave, encuestas o recordatorios en el momento exacto.",
      "Pruebas de Conectividad con Twitter: Desarrolladores o administradores de n8n pueden usar este flujo simplificado para verificar rápidamente que la integración y las credenciales con Twitter funcionan correctamente, enviando un tweet de prueba."
    ],
    "similarities": [],
    "notes": "",
    "id": 78,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0064-twitter-if-trigger.json-1758170516758",
    "fileName": "0064-twitter-if-trigger.json",
    "flowName": "Publicación Condicional en Twitter",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Comunicación",
      "Redes Sociales"
    ],
    "mainFunction": "Publicar un mensaje predefinido en Twitter, sujeto a una condición específica.",
    "automationDestinations": [
      "Twitter"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "Twitter",
      "IF"
    ],
    "complexity": "Simple",
    "shortDescription": "Un flujo simple que publica un mensaje en Twitter de forma condicional tras una ejecución manual.",
    "useCaseExamples": [
      "Un equipo de marketing lanza un tweet predefinido para anunciar rápidamente una oferta flash o un evento en vivo, asegurándose de que el mensaje sea siempre el mismo.",
      "Un gestor de comunidad utiliza el flujo para publicar manualmente un recordatorio diario sobre el horario de atención al cliente o un 'buenos días' en las redes sociales.",
      "Un creador de contenido quiere republicar manualmente un enlace a su último video o artículo cada cierto tiempo, usando un tweet estándar pre-escrito.",
      "Una pequeña empresa desea anunciar la apertura de su tienda física o el inicio de un evento especial con un tweet listo para usar, activado con un solo clic por cualquier miembro del equipo autorizado.",
      "Un desarrollador prueba la integración de Twitter en su cuenta de n8n enviando un mensaje de prueba estático para confirmar que las credenciales y la conexión funcionan correctamente."
    ],
    "similarities": [],
    "notes": "",
    "id": 79,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0065-telegram-deploy-automation.json-1758170527883",
    "fileName": "0065-telegram-deploy-automation.json",
    "flowName": "Despliegue de Releases en GitHub via Telegram",
    "mainArea": "Desarrollo de Software",
    "secondaryAreas": [
      "Operaciones IT",
      "Automatización",
      "Gestión de Proyectos"
    ],
    "mainFunction": "Automatizar la creación de nuevas releases en un repositorio de GitHub enviando un comando específico a través de Telegram.",
    "automationDestinations": [
      "GitHub"
    ],
    "dataOrigins": [
      "Telegram"
    ],
    "keyNodes": [
      "Telegram Trigger",
      "IF",
      "Set",
      "GitHub"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo permite crear releases en GitHub controladas por mensajes enviados a través de Telegram, facilitando los despliegues.",
    "useCaseExamples": [
      "Un equipo de desarrollo puede usar este flujo para lanzar una nueva versión de su aplicación en GitHub (creando un \"release\" con un tag específico) simplemente enviando un mensaje como \"/deploy v1.0.0\" a un bot de Telegram.",
      "Un administrador de contenido podría publicar una nueva versión de la documentación de un proyecto (almacenada en un repositorio de GitHub) creando un \"release\" con el tag correspondiente a través de Telegram, por ejemplo, \"/deploy docs-update-2023-10-27\".",
      "En caso de una vulnerabilidad o error crítico, un ingeniero de operaciones puede iniciar un despliegue de emergencia de un parche (creando un release con la versión del hotfix) directamente desde su teléfono a través de Telegram, como \"/deploy hotfix-v1.0.1\".",
      "Un equipo interno que mantiene varias herramientas o scripts en GitHub puede automatizar la creación de versiones etiquetadas para estas herramientas, facilitando el seguimiento y la distribución, usando comandos como \"/deploy tool-alpha-v2.3\".",
      "Después de que un pipeline de integración continua (CI) haya completado sus pruebas con éxito, un gerente de proyecto o líder técnico puede dar el paso final de crear un release en GitHub para la versión probada, señalando que está lista para su despliegue en producción o para ser consumida, mediante un mensaje de Telegram \"/deploy production-ready-vX.Y.Z\"."
    ],
    "similarities": [],
    "notes": "",
    "id": 80,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0066-pipedrive-crear-deal.json-1758170539327",
    "fileName": "0066-pipedrive-crear-deal.json",
    "flowName": "Create an deal in Pipedrive",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Gestión de Clientes"
    ],
    "mainFunction": "Crear una oportunidad de negocio en Pipedrive.",
    "automationDestinations": [
      "Pipedrive"
    ],
    "dataOrigins": [
      "Manual"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Pipedrive"
    ],
    "complexity": "Simple",
    "shortDescription": "Crea una nueva oportunidad de negocio en Pipedrive de forma manual.",
    "useCaseExamples": [
      "Creación manual de oportunidades de venta tras una llamada de calificación: Un vendedor ha tenido una llamada exitosa con un prospecto, ha calificado la oportunidad y necesita crear un nuevo trato en Pipedrive para iniciar el seguimiento formal.",
      "Registro de un nuevo trato después de una feria comercial: Tras un evento o feria, un miembro del equipo de ventas revisa los contactos obtenidos y, de forma proactiva, crea tratos individuales en Pipedrive para las oportunidades más prometedoras.",
      "Inicio de un proceso de renovación para clientes existentes: Cuando se acerca la fecha de renovación de un cliente, un gestor de cuentas puede ejecutar manualmente este flujo de trabajo para crear un trato de \"renovación\" en Pipedrive y comenzar el seguimiento.",
      "Creación de un trato para un cliente referido por un socio: Un socio de canal ha enviado una referencia de un nuevo cliente. Un representante de ventas ejecuta el flujo para registrar rápidamente esta nueva oportunidad en Pipedrive con los datos iniciales.",
      "Registro de una solicitud de presupuesto inesperada: Un cliente potencial contacta directamente por correo electrónico o teléfono solicitando un presupuesto. Un miembro del equipo de ventas ejecuta el flujo para transformar esta solicitud en un trato en Pipedrive y asignarlo para seguimiento."
    ],
    "similarities": [],
    "notes": "",
    "id": 81,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0067-obtener-registros-dns.json-1758170554240",
    "fileName": "0067-obtener-registros-dns.json",
    "flowName": "Get DNS entries",
    "mainArea": "IT y Operaciones",
    "secondaryAreas": [
      "Desarrollo Web",
      "Seguridad de la Información"
    ],
    "mainFunction": "Obtener registros DNS para un dominio específico utilizando una herramienta externa.",
    "automationDestinations": [],
    "dataOrigins": [
      "Manual",
      "uproc API"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Function Item",
      "uproc"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo obtiene los registros DNS para un dominio (n8n.io por defecto) a través de una llamada a una herramienta uproc.",
    "useCaseExamples": [
      "Un administrador de sistemas utiliza este flujo para monitorear periódicamente los registros DNS (A, CNAME, MX, TXT) de los dominios críticos de la empresa y asegurar que no hayan sido alterados o que estén configurados correctamente.",
      "Un proveedor de servicios SSL lo emplea para validar automáticamente la propiedad de un dominio (obteniendo registros CNAME o TXT) antes de emitir un certificado, agilizando el proceso de verificación.",
      "Un equipo de seguridad lo usa para auditar los registros DNS de múltiples dominios, buscando configuraciones incorrectas o vulnerabilidades que puedan ser explotadas para ataques de suplantación o phishing.",
      "Un técnico de soporte lo implementa para diagnosticar rápidamente problemas de conectividad de sitios web o servicios de correo electrónico, obteniendo al instante los registros DNS relevantes de un dominio problemático.",
      "Un especialista en marketing por correo electrónico lo configura para verificar que los registros SPF, DKIM y DMARC de su dominio estén correctamente implementados, mejorando la entregabilidad de los correos y evitando que sean marcados como spam."
    ],
    "similarities": [],
    "notes": "",
    "id": 82,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0068-line-chatbot-config-override.json-1758170567808",
    "fileName": "0068-line-chatbot-config-override.json",
    "flowName": "Standup Bot - Override Config",
    "mainArea": "Operaciones IT",
    "secondaryAreas": [
      "Desarrollo",
      "Administración de Sistemas"
    ],
    "mainFunction": "Sobreescribir el archivo de configuración de un bot de standup guardando un nuevo archivo binario (JSON) en el sistema de archivos local.",
    "automationDestinations": [
      "Sistema de Archivos Local"
    ],
    "dataOrigins": [
      "Activador Manual"
    ],
    "keyNodes": [
      "Manual Trigger",
      "Move Binary Data",
      "Write Binary File"
    ],
    "complexity": "Simple",
    "shortDescription": "Actualiza la configuración de un bot de standup escribiendo un nuevo archivo de configuración en el sistema de archivos.",
    "useCaseExamples": [
      "Un líder de equipo quiere actualizar la lista de miembros que participan en el standup diario, añadiendo o eliminando personas del archivo de configuración del bot.",
      "El equipo decide cambiar las preguntas estándar que el bot formula en el standup, y este flujo se usa para sobrescribir las preguntas en el archivo de configuración del bot.",
      "Se necesita ajustar el horario o la frecuencia con la que el bot solicita los informes de standup (por ejemplo, cambiar la hora del día o de diario a tres veces por semana).",
      "El equipo migra a un nuevo canal de Slack o Microsoft Teams, y este flujo de trabajo se utiliza para actualizar el ID del canal de destino en la configuración del bot.",
      "Se requiere activar o desactivar una función específica del bot, como los recordatorios automáticos para entregas tardías, modificando la bandera de configuración correspondiente."
    ],
    "similarities": [],
    "notes": "",
    "id": 83,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0069-line-weather-kelvin.json-1758170578742",
    "fileName": "0069-line-weather-kelvin.json",
    "flowName": "Send daily weather updates via a message in Line",
    "mainArea": "Productividad",
    "secondaryAreas": [
      "Información General",
      "Comunicación"
    ],
    "mainFunction": "Obtener actualizaciones meteorológicas diarias de una ciudad específica y enviarlas como mensaje a través de Line.",
    "automationDestinations": [
      "Line"
    ],
    "dataOrigins": [
      "Cron",
      "OpenWeatherMap"
    ],
    "keyNodes": [
      "Cron",
      "OpenWeatherMap",
      "Line"
    ],
    "complexity": "Simple",
    "shortDescription": "Envía diariamente la temperatura actual de una ciudad por mensaje de Line.",
    "useCaseExamples": [
      "Un individuo que vive en Berlín configura el flujo para recibir la temperatura matutina diaria directamente en su aplicación Line, ayudándole a decidir qué ropa usar antes de salir de casa.",
      "Una persona que planifica un viaje a Berlín para la próxima semana utiliza el flujo para obtener actualizaciones diarias de la temperatura en la ciudad, permitiéndole preparar su equipaje de manera adecuada.",
      "El propietario de una pequeña cafetería en Berlín utiliza el flujo para recibir la temperatura a las 9 AM cada día, lo que le ayuda a decidir si debe instalar el mobiliario exterior o preparar bebidas frías/calientes especiales.",
      "Un organizador de eventos al aire libre en Berlín programa el flujo para recibir la temperatura temprano cada mañana, lo que le permite hacer ajustes rápidos en la logística o el equipo necesario para el evento del día.",
      "Un hijo configura el flujo para enviar la temperatura diaria de Berlín a su padre mayor que vive allí, asegurándose de que su padre esté informado sobre el clima y se vista apropiadamente, especialmente durante los meses más fríos."
    ],
    "similarities": [],
    "notes": "",
    "id": 84,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0070-114_validar_telefono.json-1758170595909",
    "fileName": "0070-114_validar_telefono.json",
    "flowName": "Verify phone numbers",
    "mainArea": "Gestión de Datos",
    "secondaryAreas": [
      "Marketing",
      "Ventas",
      "Atención al Cliente"
    ],
    "mainFunction": "Valida la estructura y existencia de números de teléfono utilizando un servicio externo de UProc.",
    "automationDestinations": [],
    "dataOrigins": [
      "Activador Manual"
    ],
    "keyNodes": [
      "Function Item",
      "UProc",
      "IF"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo verifica la validez de un número de teléfono específico usando un servicio UProc y evalúa el resultado.",
    "useCaseExamples": [
      "Limpieza de datos en CRM: Una empresa quiere asegurar la calidad de sus datos. Este flujo podría ejecutarse semanalmente para validar los números de teléfono de todos sus contactos en el CRM, marcando o eliminando los inválidos.",
      "Validación de leads en formularios web: Antes de añadir un nuevo lead a la base de datos de ventas, el flujo verifica automáticamente el número de teléfono proporcionado en un formulario de contacto para descartar leads con información incorrecta.",
      "Preparación para campañas de marketing por SMS/WhatsApp: Un equipo de marketing utiliza el flujo para validar una lista de miles de números de teléfono antes de enviar una campaña masiva, reduciendo la tasa de rebote y los costos asociados.",
      "Registro de nuevos usuarios en una plataforma: Durante el proceso de registro, el número de teléfono ingresado por el usuario es validado instantáneamente para asegurar que es un número real capaz de recibir SMS de verificación o notificaciones.",
      "Actualización y verificación de datos de proveedores: Una empresa gestiona una base de datos de sus proveedores. Este flujo se usa para verificar periódicamente que los números de contacto principales de los proveedores sigan siendo válidos para una comunicación fluida."
    ],
    "similarities": [],
    "notes": "",
    "id": 85,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0071-pipedrive-change-monitor.json-1758171122401",
    "fileName": "0071-pipedrive-change-monitor.json",
    "flowName": "Receive updates for all changes in Pipedrive",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Gestión de Clientes",
      "Operaciones"
    ],
    "mainFunction": "Monitorear y recibir notificaciones sobre todas las actualizaciones y cambios que ocurren en Pipedrive.",
    "automationDestinations": [],
    "dataOrigins": [
      "Pipedrive"
    ],
    "keyNodes": [
      "Pipedrive Trigger"
    ],
    "complexity": "Simple",
    "shortDescription": "Recibe notificaciones instantáneas de cualquier cambio en tus datos de Pipedrive.",
    "useCaseExamples": [
      "Notificar a un canal de Slack cada vez que el estado de una oportunidad de venta cambia en Pipedrive para mantener al equipo informado.",
      "Sincronizar automáticamente nuevos contactos o actualizaciones de organizaciones de Pipedrive a una lista de correo electrónico en Mailchimp o SendGrid.",
      "Registrar todas las actividades completadas en Pipedrive (llamadas, reuniones) en una hoja de cálculo de Google Sheets para un seguimiento detallado y análisis.",
      "Actualizar el estado de un proyecto en Asana o Trello cuando una oportunidad de venta relacionada en Pipedrive avanza a una etapa específica.",
      "Enviar un correo electrónico automatizado al equipo de finanzas cuando el valor de una oportunidad de venta en Pipedrive supera un cierto umbral o se cierra como 'ganada'."
    ],
    "similarities": [],
    "notes": "",
    "id": 86,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0072-medium-rss-feed.json-1758171141828",
    "fileName": "0072-medium-rss-feed.json",
    "flowName": "Agregador y Combinador de Feeds RSS",
    "mainArea": "Marketing de Contenidos",
    "secondaryAreas": [
      "Análisis de Datos",
      "Investigación",
      "Gestión de Información"
    ],
    "mainFunction": "Recopilar y unificar publicaciones de diversas fuentes de feeds RSS en un solo conjunto de datos dentro del flujo.",
    "automationDestinations": [
      "Ninguna explícita (procesamiento interno)"
    ],
    "dataOrigins": [
      "RSS Feed"
    ],
    "keyNodes": [
      "Function",
      "SplitInBatches",
      "RSS Feed Read",
      "IF",
      "Merge Data"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo lee publicaciones de múltiples feeds RSS, las procesa en lotes y luego las combina en un único conjunto de datos para su posterior uso interno.",
    "useCaseExamples": [
      "Agregación de Noticias Diarias: Un usuario desea recibir un resumen diario de las últimas publicaciones de sus blogs tecnológicos favoritos y sitios de noticias para mantenerse actualizado, consolidando toda la información en un solo lugar.",
      "Monitoreo de Competencia Industrial: Una empresa necesita rastrear las novedades y comunicados de prensa de sus principales competidores, recopilando las entradas de sus feeds RSS corporativos para un análisis rápido de la actividad del mercado.",
      "Curación de Contenido para Redes Sociales: Un gestor de redes sociales busca artículos relevantes y de tendencia en su nicho, recolectando contenido de varios feeds RSS de la industria para programar publicaciones en sus perfiles sociales.",
      "Compilación de Recursos para Investigación: Un investigador académico o estudiante necesita recopilar artículos y publicaciones recientes de múltiples revistas científicas y repositorios (que ofrecen feeds RSS) en un tema específico para su revisión bibliográfica.",
      "Creación de una Lista de Lectura Personalizada: Un profesional desea tener una única lista consolidada de nuevos artículos de opinión, análisis de mercado y publicaciones de líderes de pensamiento de diferentes sitios web, para leer en su tiempo libre sin tener que visitar cada sitio individualmente."
    ],
    "similarities": [],
    "notes": "",
    "id": 87,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0073-hubspot-pagination.json-1758171164508",
    "fileName": "0073-hubspot-pagination.json",
    "flowName": "Obtener Contactos de HubSpot con Paginación",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Ventas",
      "Servicio al Cliente",
      "Análisis de Datos"
    ],
    "mainFunction": "Recuperar todos los contactos de HubSpot, gestionando la paginación de la API para asegurar la extracción completa de los datos.",
    "automationDestinations": [
      "n8n (para procesamiento posterior)"
    ],
    "dataOrigins": [
      "HubSpot API",
      "Manual Trigger"
    ],
    "keyNodes": [
      "HTTP Request",
      "Config URL",
      "Check if pagination?",
      "Set next URL",
      "Combine all data",
      "Wait"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo extrae todos los contactos de HubSpot de forma paginada y los consolida para su uso posterior.",
    "useCaseExamples": [
      "Un equipo de ventas necesita extraer todos sus contactos de HubSpot, incluyendo todas las páginas de resultados, para realizar una migración a un nuevo sistema CRM, asegurando que no se pierda ningún registro.",
      "Una agencia de marketing desea sincronizar diariamente su base de datos completa de contactos de HubSpot con una plataforma de marketing por correo electrónico externa para enviar campañas personalizadas, manejando grandes volúmenes de datos paginados.",
      "Una empresa requiere generar informes mensuales de auditoría sobre todos sus contactos de clientes en HubSpot para cumplir con las normativas de privacidad de datos, extrayendo y consolidando todos los registros existentes.",
      "Un analista de datos necesita obtener una copia completa de todos los contactos de HubSpot, incluyendo sus propiedades personalizadas, para realizar un análisis de segmentación avanzado y construir modelos predictivos, sin preocuparse por la limitación de registros por llamada a la API.",
      "Para un proceso de respaldo y recuperación, una organización programa este flujo para descargar y almacenar periódicamente todos los contactos activos de HubSpot en una base de datos interna o un almacenamiento en la nube, garantizando la integridad de los datos ante cualquier eventualidad."
    ],
    "similarities": [],
    "notes": "",
    "id": 88,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0074-getresponse-contact-update-flow.json-1758171180644",
    "fileName": "0074-getresponse-contact-update-flow.json",
    "flowName": "Get all the contacts from GetResponse and update them",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Ventas"
    ],
    "mainFunction": "Recuperar todos los contactos de GetResponse y actualizar la campaña de aquellos contactos que no pertenezcan a la campaña 'n8n'.",
    "automationDestinations": [
      "GetResponse"
    ],
    "dataOrigins": [
      "Manual Trigger",
      "GetResponse"
    ],
    "keyNodes": [
      "GetResponse",
      "IF"
    ],
    "complexity": "Medio",
    "shortDescription": "Obtiene todos los contactos de GetResponse y cambia la campaña de los que no son de 'n8n' a otra específica.",
    "useCaseExamples": [
      "Migrar automáticamente a todos los contactos de GetResponse que no pertenecen a la campaña principal 'n8n' a una campaña específica de re-engagement (WRVXO), para iniciar un nuevo ciclo de comunicación.",
      "Reorganizar contactos antiguos o desactualizados que no están en la campaña central 'n8n', moviéndolos a una campaña de 'segmentación especial' (WRVXO) para su posterior cualificación o eliminación.",
      "Unificar los contactos dispersos de varias campañas secundarias en GetResponse, trasladando a todos los que no están en la campaña principal 'n8n' a una campaña unificada de 'clientes potenciales' (WRVXO).",
      "Preparar una promoción especial para contactos no activos: mover todos los contactos que no se encuentran en la campaña de clientes activos ('n8n') a una campaña de 'ofertas exclusivas' (WRVXO) para reactivarlos.",
      "Centralizar el seguimiento de contactos de eventos pasados: trasladar todos los asistentes a eventos anteriores que no han sido asignados a la campaña principal de seguimiento ('n8n') a una campaña de 'seguimiento de eventos' (WRVXO)."
    ],
    "similarities": [],
    "notes": "",
    "id": 89,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0075-syncro-opsgenie-integration.json-1758171199125",
    "fileName": "0075-syncro-opsgenie-integration.json",
    "flowName": "Syncro Alert to OpsGenie",
    "mainArea": "Operaciones TI",
    "secondaryAreas": [
      "Gestión de Incidentes",
      "Soporte al Cliente"
    ],
    "mainFunction": "Gestionar automáticamente las alertas generadas en Syncro, creando nuevos incidentes o cerrando los existentes en OpsGenie basándose en el estado de la alerta.",
    "automationDestinations": [
      "OpsGenie"
    ],
    "dataOrigins": [
      "Syncro",
      "Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "Switch",
      "IF",
      "HTTP Request"
    ],
    "complexity": "Medio",
    "shortDescription": "Automatiza la creación y el cierre de alertas en OpsGenie a partir de eventos de Syncro, específicamente las alertas de agentes.",
    "useCaseExamples": [
      "Una empresa de servicios gestionados (MSP) utiliza Syncro RMM para monitorear los servidores de sus clientes. Cuando el agente de Syncro en un servidor crítico se desconecta, este flujo de trabajo crea automáticamente una alerta de alta prioridad en OpsGenie para notificar al equipo de operaciones sobre la posible interrupción del servicio.",
      "Un equipo de TI interno monitorea la disponibilidad de las estaciones de trabajo de empleados remotos. Si el agente de Syncro en el portátil de un empleado clave se desconecta, se genera una alerta en OpsGenie, permitiendo al equipo de soporte investigar problemas de conectividad o hardware de manera proactiva.",
      "Para la supervisión de la infraestructura de puntos de venta (POS) en una cadena minorista, si el servidor local de una tienda se desconecta y el agente de Syncro reporta un 'agent_offline_trigger', el flujo de trabajo alerta inmediatamente a OpsGenie para movilizar al personal de soporte.",
      "Cuando un agente de Syncro que previamente estaba desconectado vuelve a estar en línea (lo que Syncro marca como una alerta 'resuelto'), este flujo de trabajo detecta el cambio y cierra automáticamente la alerta correspondiente en OpsGenie, optimizando el ciclo de vida de la gestión de incidentes.",
      "En un entorno industrial con dispositivos IoT o edge computing monitoreados por Syncro, si uno de estos dispositivos pierde su conexión a la red y su agente de Syncro se desconecta, el flujo de trabajo alerta a OpsGenie para que un técnico pueda investigar la causa y restaurar la operación."
    ],
    "similarities": [],
    "notes": "",
    "id": 90,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0076-google-calendar-status-hue.json-1758171234764",
    "fileName": "0076-google-calendar-status-hue.json",
    "flowName": "Google Calendar to Slack Status & Philips Hue",
    "mainArea": "Productividad Personal",
    "secondaryAreas": [
      "Automatización de Oficina",
      "Comunicación Interna"
    ],
    "mainFunction": "Actualiza automáticamente el estado de Slack y las luces Philips Hue basándose en los eventos de tu Google Calendar, utilizando códigos de color para la categorización.",
    "automationDestinations": [
      "Slack",
      "Philips Hue"
    ],
    "dataOrigins": [
      "Google Calendar"
    ],
    "keyNodes": [
      "Event Started",
      "Google Calendar",
      "Set CalColor",
      "Switch",
      "Slack - Status",
      "Light - Busy",
      "Light - Personal",
      "Light - Available"
    ],
    "complexity": "Medio",
    "shortDescription": "Actualiza tu estado de Slack y las luces Philips Hue automáticamente en función de tus eventos de Google Calendar.",
    "useCaseExamples": [
      "Un desarrollador marca bloques de tiempo en su Google Calendar como '4dw_doing' (trabajo concentrado). Al inicio de estos eventos, su estado de Slack se actualiza a \"Enfocado - No molestar\" con un emoji de auriculares, y la luz de su oficina cambia a rojo (indicando \"Ocupado\") para minimizar interrupciones.",
      "Un gerente programa reuniones importantes de liderazgo como '4dw_leading' en su Google Calendar. Cuando comienza una de estas reuniones, su estado de Slack se actualiza a \"Liderando reunión del equipo\" y una luz inteligente en su espacio de trabajo se pone en ámbar (indicando \"Ocupado\"), alertando visualmente a su equipo sobre su enfoque actual.",
      "Una persona asigna el color '4dw_living' a sus citas personales, pausas extendidas o tiempo libre en Google Calendar. Al activarse, su estado de Slack cambia a \"Tiempo Personal\" o \"En Pausa\", y la luz de su área de trabajo se vuelve verde suave (indicando \"Personal\") para señalar que no está disponible para temas laborales urgentes.",
      "Un Project Manager designa bloques de tiempo para la gestión activa de proyectos con el color '4dw_managing' en su calendario. Durante estos períodos, su estado de Slack muestra \"Gestionando Proyecto: [Nombre del Proyecto]\" y la luz de su cubículo se ilumina en azul (indicando \"Ocupado\") para indicar que está inmerso en tareas de coordinación y seguimiento.",
      "Para eventos de calendario generales o no categorizados (que no utilizan los colores '4dw_'), el flujo actualiza el estado de Slack del usuario a \"Disponible para consultas\" y sus luces de oficina se ajustan a un color blanco normal o neutro (indicando \"Disponible\"), comunicando que está abierto a interacciones no urgentes."
    ],
    "similarities": [],
    "notes": "",
    "id": 91,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0077-conversor-json-a-xml.json-1758171249836",
    "fileName": "0077-conversor-json-a-xml.json",
    "flowName": "Webhook a XML Responder",
    "mainArea": "Integración de Datos",
    "secondaryAreas": [
      "Desarrollo",
      "Operaciones"
    ],
    "mainFunction": "Recibir datos por un webhook, transformar datos a formato XML y responder al mismo webhook con la salida XML.",
    "automationDestinations": [
      "Webhook Responder"
    ],
    "dataOrigins": [
      "Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "Set",
      "XML",
      "Respond to Webhook"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo recibe una petición por webhook, manipula algunos datos y devuelve una respuesta en formato XML al originador.",
    "useCaseExamples": [
      "Simular una API para pruebas: Un equipo de desarrollo necesita un endpoint que siempre devuelva un XML específico para probar la integración de un sistema cliente que espera respuestas en formato XML, sin depender de un backend complejo.",
      "Proporcionar un estado de servicio básico en XML: Un sistema heredado que solo puede consumir XML necesita un endpoint para verificar el estado de un microservicio, donde una respuesta XML simple indica 'activo' o 'disponible'.",
      "Distribuir configuración estática en XML: Una aplicación cliente necesita descargar un archivo de configuración en formato XML desde una URL específica, y este flujo proporciona un XML predefinido para ese propósito.",
      "Adaptar una interfaz moderna a un consumidor XML: Una herramienta interna genera datos en JSON, pero un sistema consumidor externo y antiguo requiere esos datos en un formato XML preestablecido para su procesamiento o validación.",
      "Demostración de conversión JSON a XML para un PoC: Un equipo está evaluando la capacidad de n8n para la integración de datos y necesita un ejemplo rápido y funcional de cómo convertir un payload JSON estático a XML y servirlo a través de un webhook para un concepto de prueba."
    ],
    "similarities": [],
    "notes": "",
    "id": 92,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0078-comida-diaria-recipe.json-1758171276605",
    "fileName": "0078-comida-diaria-recipe.json",
    "flowName": "What To Eat",
    "mainArea": "Vida Personal",
    "secondaryAreas": [
      "Salud y Bienestar",
      "Cocina"
    ],
    "mainFunction": "Automatizar la búsqueda y el envío diario de recetas de comida personalizadas por correo electrónico, basándose en criterios como la dieta, el recuento de ingredientes y los límites de calorías y tiempo de preparación.",
    "automationDestinations": [
      "Email"
    ],
    "dataOrigins": [
      "Cron",
      "Edamam API"
    ],
    "keyNodes": [
      "Cron",
      "Set",
      "Function",
      "HTTP Request",
      "Email Send"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo busca diariamente recetas de comida personalizadas de la API de Edamam, aplicando diversos filtros de búsqueda, y luego envía los resultados por correo electrónico.",
    "useCaseExamples": [
      "Un usuario configura el flujo para recibir semanalmente (ej. los domingos a las 10 AM) 3 recetas basadas en \"pollo\", con una dieta \"equilibrada\" y requisitos de \"salud\" aleatorios, preparables en menos de 30 minutos y con un máximo de 1500 calorías, para facilitar su planificación semanal de comidas.",
      "Un profesional que busca inspiración para sus almuerzos configura el flujo para recibir cada día 3 recetas \"bajas en carbohidratos\" y \"sin gluten\", utilizando \"verduras\" como ingrediente principal, con un límite de 400 calorías y 20 minutos de preparación, directamente en su bandeja de entrada.",
      "Un nutricionista o cuidador de un paciente con restricciones dietéticas complejas (ej. \"sin lácteos\", \"baja en potasio\") usa el flujo para generar y enviar semanalmente 3 nuevas recetas de \"pescado\" o \"legumbres\", que se ajusten estrictamente a esos requisitos de salud y dietéticos, y que sean fáciles de preparar (tiempo máximo 45 minutos).",
      "Un cocinero aficionado activa el flujo mensualmente para descubrir 3 recetas con opciones de \"dieta\" y \"salud\" totalmente \"aleatorias\", usando un ingrediente sorpresa (ej. \"tofu\" o \"cordero\"), sin límites estrictos de tiempo o calorías, con el fin de salir de su zona de confort y experimentar nuevos sabores.",
      "Un blogger de comida saludable programa el flujo para que, una vez a la semana, le genere 3 ideas de recetas \"altas en fibra\" y \"veganas\", utilizando diferentes ingredientes de temporada como \"frutas\" o \"cereales integrales\", para tener siempre contenido fresco y relevante para sus publicaciones."
    ],
    "similarities": [],
    "notes": "",
    "id": 93,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0079-sheets-to-dropbox.json-1758171289669",
    "fileName": "0079-sheets-to-dropbox.json",
    "flowName": "Automatización de Hoja de Cálculo a Dropbox",
    "mainArea": "Operaciones",
    "secondaryAreas": [
      "Administración de Datos",
      "TI"
    ],
    "mainFunction": "Automatizar la lectura periódica de datos de una hoja de cálculo de Google, su conversión a formato XLS y su posterior subida a Dropbox.",
    "automationDestinations": [
      "Dropbox"
    ],
    "dataOrigins": [
      "Google Sheets",
      "Interval (Disparador)"
    ],
    "keyNodes": [
      "Trigger all 15 min",
      "Read Sheet",
      "Convert to XLS",
      "Upload Dropbox"
    ],
    "complexity": "Simple",
    "shortDescription": "Lee datos de Google Sheets, los convierte a XLS y los sube a Dropbox cada 15 minutos.",
    "useCaseExamples": [
      "Actualización de Lista de Precios: Una tienda online mantiene su lista de precios de productos en una hoja de Google Sheets. Este flujo de trabajo exporta automáticamente la lista actualizada cada 15 minutos como un archivo XLS a Dropbox, permitiendo que un sistema de un distribuidor o un ERP lo sincronice sin necesidad de intervención manual.",
      "Sincronización de Inventario: Un almacén gestiona su inventario en tiempo real usando Google Sheets. El flujo de trabajo exporta el estado del inventario a un archivo XLS en Dropbox cada 15 minutos, que luego es recogido por un sistema de comercio electrónico o un software de gestión de pedidos para mantener el stock actualizado.",
      "Reporte de Ventas para Socios: Un equipo de ventas registra sus resultados diarios en un Google Sheet. Cada 15 minutos, este flujo convierte el informe a XLS y lo carga a una carpeta compartida en Dropbox, asegurando que los socios externos siempre tengan acceso a los datos de ventas más recientes en un formato compatible.",
      "Respaldo Automático de Datos Críticos: Una empresa utiliza Google Sheets para almacenar datos críticos de proyectos o clientes. El flujo de trabajo realiza un respaldo automático de estos datos cada 15 minutos, guardándolos como un archivo XLS en Dropbox, lo que proporciona una capa adicional de seguridad y acceso rápido en caso de necesitar una versión anterior o exportar los datos.",
      "Alimentación de Datos para Sistemas Heredados: Una organización utiliza un sistema heredado que solo puede importar datos en formato XLS. Los datos de entrada para este sistema se mantienen en un Google Sheet para facilitar la edición y colaboración. El flujo de trabajo asegura que el sistema heredado siempre tenga disponible el archivo XLS más reciente en Dropbox para su importación periódica."
    ],
    "similarities": [],
    "notes": "",
    "id": 94,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0080-shopify-product-alerts.json-1758171303323",
    "fileName": "0080-shopify-product-alerts.json",
    "flowName": "Publicar Nuevo Producto en Redes Sociales",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Ventas",
      "Comunicación"
    ],
    "mainFunction": "Anunciar la creación de nuevos productos de Shopify en redes sociales como Twitter y Telegram.",
    "automationDestinations": [
      "Twitter",
      "Telegram"
    ],
    "dataOrigins": [
      "Shopify"
    ],
    "keyNodes": [
      "product created",
      "Twitter",
      "Telegram"
    ],
    "complexity": "Simple",
    "shortDescription": "Publica automáticamente información sobre nuevos productos de Shopify en Twitter y Telegram.",
    "useCaseExamples": [
      "Un diseñador de camisetas personalizadas utiliza Shopify para vender sus creaciones. Cada vez que sube un nuevo diseño de camiseta, el flujo de trabajo lo publica automáticamente en su cuenta de Twitter y en un grupo de Telegram para sus seguidores más leales, anunciando el nuevo producto y dónde comprarlo.",
      "Una pequeña tienda de artículos hechos a mano en línea, que vende a través de Shopify, lanza regularmente nuevas colecciones. Con este flujo, cada vez que se añade un nuevo artículo artesanal al catálogo, se genera un tweet y un mensaje de Telegram para notificar a sus clientes sobre la última novedad.",
      "Una marca de cosméticos independiente que gestiona su tienda en Shopify. Cuando lanzan un nuevo tono de lápiz labial o un nuevo producto para el cuidado de la piel, el flujo se activa para anunciarlo inmediatamente en Twitter y en su canal de Telegram, impulsando el interés y las ventas tempranas.",
      "Un vendedor de productos digitales (como plantillas de diseño o presets de fotografía) en Shopify. Al crear un nuevo paquete de recursos digitales, el flujo difunde automáticamente un mensaje en sus redes sociales para informar a su comunidad de creativos sobre la disponibilidad de las nuevas herramientas.",
      "Una librería independiente que utiliza Shopify para sus ventas online. Cuando un nuevo libro de un autor local se añade al inventario, el flujo publica un aviso en Twitter y en su grupo de Telegram, destacando el nuevo título y el autor, para fomentar la compra entre sus lectores."
    ],
    "similarities": [],
    "notes": "",
    "id": 95,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0081-shopify-pedidos-trigger.json-1758172141179",
    "fileName": "0081-shopify-pedidos-trigger.json",
    "flowName": "Gestión Avanzada de Pedidos Shopify",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing",
      "Atención al Cliente",
      "Gestión de Proyectos"
    ],
    "mainFunction": "Procesa automáticamente nuevos pedidos de Shopify para actualizar la información del cliente en el CRM (Zoho), generar facturas (Harvest), crear tareas en Trello, y enviar correos electrónicos personalizados (Gmail) con ofertas o agradecimientos, además de segmentar clientes en Mailchimp.",
    "automationDestinations": [
      "Zoho",
      "Trello",
      "Harvest",
      "Gmail",
      "Mailchimp"
    ],
    "dataOrigins": [
      "Shopify"
    ],
    "keyNodes": [
      "Set fields",
      "IF",
      "Zoho",
      "Harvest",
      "Trello",
      "Gmail",
      "Mailchimp"
    ],
    "complexity": "Medio",
    "shortDescription": "Automatiza la gestión de pedidos Shopify: CRM, facturación, tareas, emails personalizados y segmentación de marketing.",
    "useCaseExamples": [
      "Una tienda de comercio electrónico utiliza el flujo para automatizar el procesamiento de pedidos de Shopify, actualizando los datos del cliente en Zoho CRM, generando facturas en Harvest y gestionando el seguimiento interno de pedidos en Trello, además de enviar emails de agradecimiento personalizados con ofertas si el valor de compra es alto.",
      "Una empresa que vende productos físicos a través de Shopify integra este flujo para asegurar que cada nueva orden de un cliente se registre en su CRM (Zoho), se cree automáticamente una factura para contabilidad (Harvest), se genere una tarea para el equipo de empaque y envío (Trello) y se ofrezcan incentivos post-compra vía email a clientes de alto valor.",
      "Un proveedor de servicios digitales o suscripciones que usa Shopify para procesar pagos, aprovecha el flujo para añadir automáticamente nuevos clientes a su base de datos de Zoho, emitir facturas, crear tickets de onboarding en Trello y segmentar a los suscriptores en Mailchimp basándose en el valor de su primera compra.",
      "Un negocio de artesanías personalizado usa Shopify. Al recibir un pedido, el flujo actualiza la información del cliente en Zoho, genera una factura en Harvest, crea una tarjeta en Trello para seguir el proceso de creación y envío del artículo, y envía un cupón por Gmail si el pedido es de un valor considerable.",
      "Una empresa B2B que permite pedidos online a través de Shopify utiliza el flujo para sincronizar los datos de sus clientes corporativos con Zoho, emitir facturas proforma en Harvest, gestionar el cumplimiento de pedidos complejos en Trello, y enviar agradecimientos con descuentos por volumen a sus clientes más valiosos."
    ],
    "similarities": [],
    "notes": "",
    "id": 96,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0082-shopify-reportes-semanal.json-1758172175987",
    "fileName": "0082-shopify-reportes-semanal.json",
    "flowName": "Informe Semanal de Ventas de Shopify",
    "mainArea": "Comercio Electrónico",
    "secondaryAreas": [
      "Análisis de Datos",
      "Operaciones"
    ],
    "mainFunction": "Este flujo recopila los pedidos de Shopify semanalmente, los filtra por fecha, calcula el número total de pedidos y su valor total, y luego registra esta información en una hoja de cálculo de Google Sheets y la envía como notificación a Slack.",
    "automationDestinations": [
      "Google Sheets",
      "Slack"
    ],
    "dataOrigins": [
      "Cron",
      "Shopify"
    ],
    "keyNodes": [
      "Cron",
      "Shopify",
      "Date & Time",
      "IF",
      "Set price",
      "Function",
      "Google Sheets",
      "Slack"
    ],
    "complexity": "Medio",
    "shortDescription": "Analiza semanalmente los pedidos de Shopify, calculando el total de pedidos y ventas, y enviando un informe a Google Sheets y una notificación a Slack.",
    "useCaseExamples": [
      "Informe Semanal de Ventas Acumuladas: Una tienda de Shopify desea un informe semanal que resuma el número total de pedidos y los ingresos generados desde el inicio de un período fiscal o campaña específica (definido por la fecha del nodo IF) hasta la fecha actual. Este informe se publica en Slack y se guarda en una hoja de cálculo de Google para seguimiento financiero continuo.",
      "Seguimiento Post-Lanzamiento de un Producto/Tienda: Una nueva tienda en línea o una nueva categoría de productos lanzada en una fecha concreta (la fecha del nodo IF) necesita un seguimiento semanal del rendimiento acumulado en términos de cantidad de pedidos y valor total. El flujo de trabajo automatiza el cálculo y la notificación al equipo de marketing a través de Slack, además de archivar los datos en Google Sheets.",
      "Auditoría de Cumplimiento o Período Promocional: Para cumplir con requisitos de auditoría o para evaluar el impacto de una promoción de larga duración que comenzó en una fecha específica (la fecha del nodo IF), la empresa necesita un resumen semanal de todos los pedidos y su valor desde ese punto. Los datos se comparten con el equipo de cumplimiento/marketing en Slack y se registran en una hoja de cálculo maestra.",
      "Monitoreo de Crecimiento de Negocio: Un emprendedor quiere tener una visión semanal del progreso general de su negocio, calculando el número total de pedidos y los ingresos totales desde un punto de partida relevante (representado por la fecha del nodo IF, por ejemplo, la fecha de inicio de la tienda o un hito importante). Esta información es vital para la motivación y la planificación estratégica, entregada convenientemente a Slack y a una hoja de cálculo de registro.",
      "Consolidación de Datos para Inversores: Una startup de e-commerce que busca inversión necesita generar informes semanales automáticos sobre su tracción de ventas, mostrando el número total de pedidos y el valor monetario acumulado desde su ronda de financiación anterior o desde el inicio del negocio (la fecha del nodo IF). Estos datos son enviados a un canal privado de Slack para la dirección y a una hoja de cálculo para la preparación de presentaciones a inversores."
    ],
    "similarities": [],
    "notes": "",
    "id": 97,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0083-harvest-cliente-ciclo.json-1758172190296",
    "fileName": "0083-harvest-cliente-ciclo.json",
    "flowName": "Create a client in Harvest",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Gestión de Proyectos",
      "Contabilidad"
    ],
    "mainFunction": "Crear un nuevo cliente en el sistema Harvest.",
    "automationDestinations": [
      "Harvest"
    ],
    "dataOrigins": [
      "Entrada Manual"
    ],
    "keyNodes": [
      "Harvest"
    ],
    "complexity": "Simple",
    "shortDescription": "Crea un nuevo cliente en Harvest de forma manual.",
    "useCaseExamples": [
      "Un nuevo cliente ha sido cerrado en el CRM y el equipo de ventas necesita crearlo rápidamente en Harvest para iniciar la facturación y el seguimiento del proyecto.",
      "El departamento de contabilidad recibe una notificación de un nuevo contrato y debe añadir al cliente en Harvest para la gestión de proyectos y la emisión de facturas.",
      "Después de que un prospecto acepta una propuesta, el gerente de cuentas utiliza este flujo de trabajo para registrar al nuevo cliente en Harvest antes de asignar los recursos del proyecto.",
      "Una empresa necesita migrar manualmente un pequeño número de clientes de una hoja de cálculo a Harvest, y este flujo permite añadir cada uno individualmente de forma controlada.",
      "Un consultor independiente adquiere un nuevo cliente para un proyecto a corto plazo y usa este flujo para crear un registro en Harvest sin tener que navegar por la interfaz completa."
    ],
    "similarities": [],
    "notes": "",
    "id": 98,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0084-telegram-profanity-detector.json-1758172386807",
    "fileName": "0084-telegram-profanity-detector.json",
    "flowName": "Moderador de Mensajes de Telegram",
    "mainArea": "Moderación de Contenido",
    "secondaryAreas": [
      "Comunidades Online",
      "Soporte al Cliente",
      "Comunicación Interna"
    ],
    "mainFunction": "Detecta y responde automáticamente a mensajes con contenido ofensivo o profano en Telegram utilizando la API de Google Perspective para el análisis de texto.",
    "automationDestinations": [
      "Telegram"
    ],
    "dataOrigins": [
      "Telegram"
    ],
    "keyNodes": [
      "Telegram Trigger",
      "Google Perspective",
      "IF"
    ],
    "complexity": "Simple",
    "shortDescription": "Monitorea mensajes de Telegram, los analiza para detectar profanidades y responde automáticamente si el contenido es tóxico.",
    "useCaseExamples": [
      "Un equipo de desarrollo de software utiliza un grupo de Telegram para soporte técnico. El flujo de trabajo modera automáticamente los mensajes, respondiendo a aquellos con alto contenido de lenguaje soez para mantener un ambiente de ayuda constructivo y profesional.",
      "Un administrador de una comunidad de videojuegos tiene un grupo de Telegram para que los jugadores interactúen. El flujo de trabajo ayuda a mantener el chat libre de insultos y lenguaje tóxico, enviando una advertencia automática cuando detecta un mensaje ofensivo.",
      "Un medio de comunicación usa un canal de Telegram para compartir noticias y permite comentarios. El flujo de trabajo escanea los comentarios para identificar y señalar rápidamente el lenguaje inapropiado, asegurando que las discusiones se mantengan respetuosas.",
      "Un grupo de estudiantes colabora en un proyecto universitario usando Telegram. El flujo de trabajo previene el uso de lenguaje vulgar o intimidatorio, respondiendo a mensajes con un alto nivel de profanidad para mantener el enfoque en el trabajo académico.",
      "Un club de lectura organiza sus discusiones y anuncios en un grupo de Telegram. El flujo de trabajo garantiza que las conversaciones sobre los libros se mantengan civilizadas y libres de improperios, moderando automáticamente los mensajes que cruzan los límites de la decencia."
    ],
    "similarities": [],
    "notes": "",
    "id": 99,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0085-n8n_LinkedIn_Interactions_Automation.json-1758172408110",
    "fileName": "0085-n8n_LinkedIn_Interactions_Automation.json",
    "flowName": "Create Email Campaign From LinkedIn Post Interactions",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Ventas",
      "Automatización de Datos",
      "Gestión de Relaciones con Clientes (CRM)"
    ],
    "mainFunction": "Identificar y capturar prospectos que interactúan con publicaciones de LinkedIn, enriquecer su información de contacto y agregarlos o actualizar su perfil en una base de datos (Airtable), una plataforma de campañas de email (Lemlist) y un CRM (Hubspot) para iniciar campañas de correo electrónico dirigidas.",
    "automationDestinations": [
      "Airtable",
      "Lemlist",
      "Hubspot",
      "Phantombuster"
    ],
    "dataOrigins": [
      "Cron",
      "LinkedIn",
      "Phantombuster"
    ],
    "keyNodes": [
      "Cron",
      "Phantombuster",
      "Dropcontact",
      "Airtable",
      "Exists ?",
      "Lemlist",
      "Hubspot"
    ],
    "complexity": "Complejo",
    "shortDescription": "Este flujo automatiza la captura de interacciones en publicaciones de LinkedIn para enriquecer la información de contactos y añadirlos a Airtable, Lemlist y Hubspot, facilitando campañas de email.",
    "useCaseExamples": [
      "Una empresa de SaaS lanza una nueva característica de producto y publica un post en LinkedIn. El flujo de trabajo identifica a los usuarios que comentan o reaccionan, encuentra sus correos electrónicos y los añade a una campaña de Lemlist para ofrecerles una demostración y una prueba gratuita.",
      "Una consultoría de negocios comparte un informe de tendencias de la industria en LinkedIn. El flujo de trabajo rastrea a las personas que interactúan con la publicación, enriquece sus perfiles con Dropcontact y los añade a Airtable y Hubspot para un seguimiento personalizado, ofreciéndoles contenido adicional o una consulta gratuita.",
      "Una agencia de marketing digital publica un estudio de caso exitoso en LinkedIn. El flujo de trabajo captura a los profesionales de marketing o líderes de negocio que reaccionan o comentan, recopila sus datos de contacto y empresa, y los incorpora a una secuencia de correos fríos personalizada a través de Lemlist, ofreciendo una auditoría gratuita.",
      "Una organización sin fines de lucro promueve una campaña de recaudación de fondos o un evento benéfico en LinkedIn. El flujo de trabajo identifica a los interesados que interactúan con el post, obtiene sus detalles y los añade a una campaña de Lemlist para compartir más información, enlaces de donación o invitaciones directas.",
      "Una empresa de reclutamiento publica un post en LinkedIn destacando una oportunidad de empleo para un perfil específico. El flujo de trabajo identifica a los candidatos potenciales que interactúan, enriquece sus datos de contacto y los añade a una campaña de Lemlist para invitarlos a aplicar o a una entrevista inicial."
    ],
    "similarities": [],
    "notes": "",
    "id": 100,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0086-calendly-pipedrive-slack.json-1758172882278",
    "fileName": "0086-calendly-pipedrive-slack.json",
    "flowName": "Automatización de Seguimiento de Reuniones",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Operaciones",
      "Gestión de Clientes"
    ],
    "mainFunction": "Automatizar la creación de actividades en Pipedrive y el envío de recordatorios por Slack después de que se crea una reunión en Calendly.",
    "automationDestinations": [
      "Pipedrive",
      "Slack"
    ],
    "dataOrigins": [
      "Calendly"
    ],
    "keyNodes": [
      "Calendly Trigger",
      "Pipedrive",
      "Date & Time",
      "Wait",
      "Slack"
    ],
    "complexity": "Simple",
    "shortDescription": "Registra reuniones de Calendly en Pipedrive, calcula un tiempo para feedback, y envía un recordatorio por Slack al final de la reunión.",
    "useCaseExamples": [
      "Un equipo de ventas que usa Calendly para programar demos de productos: Al finalizar la demo, se crea automáticamente una actividad en Pipedrive y el vendedor recibe un recordatorio en Slack 15 minutos después para registrar sus notas y acciones de seguimiento.",
      "Un consultor que programa sesiones iniciales de descubrimiento con clientes potenciales a través de Calendly: El flujo de trabajo registra la llamada en Pipedrive y notifica al consultor en Slack poco después de que termina la llamada para documentar los requisitos del cliente.",
      "Un gestor de éxito del cliente que organiza llamadas de incorporación para nuevos usuarios con Calendly: La herramienta crea una entrada en Pipedrive para la llamada y envía un mensaje de Slack al gestor para resumir los puntos clave y los próximos pasos.",
      "Un reclutador que programa entrevistas con candidatos a través de Calendly: Una vez terminada la entrevista, se registra la actividad en Pipedrive y el reclutador recibe una alerta en Slack para que envíe sus comentarios sobre el candidato.",
      "Un equipo de soporte técnico que utiliza Calendly para programar reuniones con clientes sobre problemas complejos: El sistema registra la reunión en Pipedrive y notifica al técnico asignado en Slack para que documente los detalles técnicos y los acuerdos de la llamada."
    ],
    "similarities": [],
    "notes": "",
    "id": 101,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0087-github-backup-flujos.json-1758172902767",
    "fileName": "0087-github-backup-flujos.json",
    "flowName": "Copia de Seguridad y Sincronización de Flujos n8n a GitHub",
    "mainArea": "IT Operations",
    "secondaryAreas": [
      "DevOps",
      "Administración de Sistemas"
    ],
    "mainFunction": "Automatizar la copia de seguridad diaria y la sincronización de todos los flujos de trabajo de una instancia de n8n con un repositorio de GitHub, incluyendo la creación de nuevos archivos y la actualización de los existentes.",
    "automationDestinations": [
      "GitHub"
    ],
    "dataOrigins": [
      "n8n Instance API",
      "Cron"
    ],
    "keyNodes": [
      "Cron",
      "HTTP Request",
      "Function",
      "Merge",
      "GitHub"
    ],
    "complexity": "Complejo",
    "shortDescription": "Realiza una copia de seguridad diaria de los flujos de trabajo de n8n en GitHub, actualizando los existentes y creando nuevos.",
    "useCaseExamples": [
      "Copia de seguridad diaria automatizada de todos los flujos de trabajo de n8n a un repositorio de GitHub para recuperación ante desastres y protección de datos.",
      "Implementación de un sistema de control de versiones para flujos de trabajo de automatización, permitiendo a los equipos de desarrollo rastrear cambios, auditar modificaciones y revertir a versiones anteriores si es necesario.",
      "Mantener un historial de cambios detallado y auditable de los flujos de trabajo de n8n en GitHub para cumplir con requisitos de conformidad y auditorías internas/externas.",
      "Facilitar la migración y replicación de flujos de trabajo entre diferentes instancias de n8n (desarrollo, pruebas, producción) utilizando GitHub como fuente central de la verdad.",
      "Automatizar la sincronización de las definiciones de flujos de trabajo entre la instancia de n8n y un repositorio de código, asegurando que cualquier modificación local se refleje automáticamente en el control de versiones."
    ],
    "similarities": [],
    "notes": "",
    "id": 102,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0088-typeform-hubspot-email.json-1758172923162",
    "fileName": "0088-typeform-hubspot-email.json",
    "flowName": "Gestión de Leads de Typeform a HubSpot con Seguimiento por Email",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing"
    ],
    "mainFunction": "Capturar envíos de formularios de Typeform, crear o actualizar contactos en HubSpot, y enviar correos electrónicos de seguimiento personalizados basándose en el interés del lead.",
    "automationDestinations": [
      "HubSpot",
      "Gmail"
    ],
    "dataOrigins": [
      "Typeform"
    ],
    "keyNodes": [
      "Typeform Trigger",
      "Set",
      "HubSpot",
      "IF",
      "Gmail"
    ],
    "complexity": "Medio",
    "shortDescription": "Automatiza la captura y calificación de leads desde Typeform, su registro en HubSpot y el envío de correos de seguimiento.",
    "useCaseExamples": [
      "Una empresa de SaaS utiliza un Typeform en su sitio web para que los visitantes soliciten una demo. El flujo crea el contacto en HubSpot, marca a los prospectos interesados en escalar su contenido visual como \"oportunidad\" y les envía un email con un enlace para agendar una demo.",
      "Una organización sin fines de lucro usa un Typeform para que los voluntarios se registren. Si un voluntario expresa interés en liderar proyectos, el flujo lo clasifica como \"oportunidad\" en HubSpot y le envía un email con información adicional sobre roles de liderazgo y un enlace para programar una reunión.",
      "Un consultor de marketing emplea un Typeform en sus landing pages para capturar leads que desean un diagnóstico gratuito. El flujo crea el contacto en HubSpot, actualiza la etapa a \"oportunidad\" si el lead manifiesta interés en sus servicios y le envía un email con un enlace para agendar la consulta.",
      "Una plataforma de e-learning ofrece un curso gratuito y requiere que los usuarios se registren a través de un Typeform. Si el usuario indica interés en cursos avanzados o membresías premium, el flujo lo registra en HubSpot como \"oportunidad\" y le envía un email con enlaces a la oferta de pago y un calendario para una sesión informativa.",
      "Una agencia de desarrollo web usa un Typeform para que las empresas soliciten una cotización para un nuevo proyecto. El flujo crea el contacto en HubSpot, categoriza a los que buscan activamente un socio de desarrollo como \"oportunidad\" y les envía un email de seguimiento con un portafolio y un enlace para discutir sus requisitos."
    ],
    "similarities": [],
    "notes": "",
    "id": 103,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0089-hubspot-deals-processing.json-1758172936441",
    "fileName": "0089-hubspot-deals-processing.json",
    "flowName": "Automatización de Gestión de Deals de Hubspot",
    "mainArea": "Ventas",
    "secondaryAreas": [
      "Marketing",
      "Operaciones"
    ],
    "mainFunction": "Automatizar la gestión de deals en Hubspot, incluyendo notificaciones en Slack, creación de presentaciones, registro de deals perdidos en Airtable y generación de tickets de seguimiento basados en el estado y valor del deal.",
    "automationDestinations": [
      "Slack",
      "Google Slides",
      "Airtable",
      "Hubspot"
    ],
    "dataOrigins": [
      "Hubspot Trigger"
    ],
    "keyNodes": [
      "Hubspot Trigger",
      "Hubspot",
      "Set",
      "Switch",
      "IF"
    ],
    "complexity": "Complejo",
    "shortDescription": "Un flujo que reacciona a la creación de deals en Hubspot para automatizar notificaciones, la generación de documentos y la creación de tickets de seguimiento, basándose en el estado y valor del deal.",
    "useCaseExamples": [
      "Automatización de Notificaciones por Cierre de Ventas: Cuando una oportunidad de venta en Hubspot cambia a la etapa \"Cerrada y Ganada\", el equipo de ventas y marketing es notificado automáticamente en un canal de Slack para celebrar el éxito y mantener a todos informados.",
      "Preparación de Materiales para Presentaciones: Al programar una presentación para un cliente (etapa \"Presentación Programada\" en Hubspot), se genera automáticamente una plantilla de presentación en Google Slides, prellenada con el nombre de la oportunidad, para que el equipo pueda empezar a trabajar en ella de inmediato.",
      "Análisis de Oportunidades Perdidas: Cada vez que una oportunidad de venta en Hubspot es marcada como \"Cerrada y Perdida\", sus detalles clave (nombre, ID, tipo) se registran automáticamente en una base de datos de Airtable para un análisis posterior de las razones de la pérdida y la identificación de patrones.",
      "Priorización Automática de Tareas para Nuevos Negocios de Alto Valor: Cuando se crea una nueva oportunidad de negocio en Hubspot con un valor superior a 500 y de tipo \"newbusiness\" (y aún no está cerrada), se crea automáticamente un ticket de \"alta prioridad\" en Hubspot para el equipo de soporte o implementación, asignado a un propietario específico.",
      "Gestión de Seguimiento para Oportunidades Activas: Para cualquier nueva oportunidad de negocio creada en Hubspot que no cumpla los criterios de \"alto valor y nuevo negocio\" (y que aún no esté cerrada), se genera un ticket de \"prioridad media\" en Hubspot para asegurar un seguimiento adecuado por parte del equipo comercial o de customer success."
    ],
    "similarities": [],
    "notes": "",
    "id": 104,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0090-GitHub-issue-autoassign (1).json-1758172946051",
    "fileName": "0090-GitHub-issue-autoassign (1).json",
    "flowName": "Automate assigning GitHub issues",
    "mainArea": "Desarrollo de Software",
    "secondaryAreas": [
      "Gestión de Proyectos",
      "Colaboración en Equipo",
      "Automatización de Tareas"
    ],
    "mainFunction": "Automatiza la asignación de incidencias (issues) en GitHub, ya sea al creador de la incidencia si no tiene asignado a nadie, o a un comentarista que solicite la asignación.",
    "automationDestinations": [
      "GitHub"
    ],
    "dataOrigins": [
      "GitHub"
    ],
    "keyNodes": [
      "Github Trigger1",
      "Switch",
      "IF no assignee?",
      "IF wants to work?",
      "IF not assigned?",
      "Assign Issue Creator",
      "Assign Commenter",
      "Add Comment"
    ],
    "complexity": "Medio",
    "shortDescription": "Asigna automáticamente incidencias de GitHub a usuarios basándose en la creación de la incidencia o en comentarios específicos, facilitando la gestión de tareas.",
    "useCaseExamples": [
      "Un desarrollador crea un nuevo \"bug report\" en GitHub e incluye la frase \"assign me\" en la descripción del issue, lo que hace que el flujo de trabajo le asigne automáticamente el issue a él y le añada la etiqueta \"assigned\".",
      "Un miembro del equipo ve un issue sin asignar en el repositorio del proyecto y comenta \"assign me\" para indicar que quiere trabajar en él. El flujo de trabajo detecta el comentario, le asigna el issue y añade la etiqueta \"assigned\".",
      "Otro desarrollador intenta reclamar un issue que ya está asignado comentando \"assign me\". El flujo de trabajo reconoce que el issue ya tiene un responsable y responde con un comentario informándole que el issue ya está asignado.",
      "Un project manager configura una plantilla de issue para nuevas tareas que incluye automáticamente \"assign me\" en el cuerpo. Cuando se crea un nuevo issue a partir de esta plantilla, el flujo de trabajo lo asigna inmediatamente al creador del issue.",
      "En un proyecto de código abierto, un colaborador de la comunidad encuentra un issue de tipo \"good first issue\" sin asignar y comenta \"assign me\". El flujo de trabajo le asigna el issue automáticamente, facilitando la colaboración."
    ],
    "similarities": [],
    "notes": "",
    "id": 105,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0090-GitHub-issue-autoassign.json-1758172957493",
    "fileName": "0090-GitHub-issue-autoassign.json",
    "flowName": "Automate assigning GitHub issues",
    "mainArea": "Desarrollo de Software",
    "secondaryAreas": [
      "Gestión de Proyectos",
      "Colaboración"
    ],
    "mainFunction": "Automatiza la asignación de issues de GitHub basándose en su creación/apertura o comentarios que soliciten la asignación, y añade comentarios cuando un issue ya está asignado.",
    "automationDestinations": [
      "GitHub"
    ],
    "dataOrigins": [
      "GitHub"
    ],
    "keyNodes": [
      "Switch",
      "IF no assignee?",
      "IF wants to work?",
      "IF not assigned?",
      "Github Trigger",
      "Github (Assign Issue Creator)",
      "Github (Add Comment)",
      "Github (Assign Commenter)"
    ],
    "complexity": "Medio",
    "shortDescription": "Asigna automáticamente issues de GitHub a usuarios cuando son creados/abiertos, o cuando un usuario comenta 'assign me' en un issue abierto.",
    "useCaseExamples": [
      "Un desarrollador abre un nuevo \"issue\" en GitHub y, para indicar que planea trabajar en él inmediatamente, incluye la frase \"assign me\" en la descripción. El flujo de trabajo asigna automáticamente el \"issue\" a ese desarrollador y le añade la etiqueta \"assigned\".",
      "Un miembro de la comunidad de un proyecto de código abierto ve un \"issue\" sin asignar que le interesa resolver. Deja un comentario en el \"issue\" que dice \"assign me\" y el flujo de trabajo lo asigna automáticamente a sí mismo.",
      "En un equipo de desarrollo, un \"manager\" de proyecto crea varios \"issues\" para nuevas características. Los desarrolladores pueden ir a los \"issues\" sin asignar y comentar \"assign me\" para autoasignarse una tarea, agilizando el proceso de asignación.",
      "Un colaborador intenta autoasignarse un \"issue\" comentando \"assign me\", pero el \"issue\" ya ha sido asignado a otra persona. El flujo de trabajo detecta que ya hay un asignado y automáticamente añade un comentario al \"issue\" informando al colaborador que ya está asignado.",
      "Un equipo de control de calidad abre un \"bug report\" en GitHub. Uno de los ingenieros de software revisa los \"bugs\" recién abiertos y, si quiere tomar uno sin asignar, simplemente edita la descripción del \"issue\" o deja un comentario con \"assign me\" para que se le asigne automáticamente."
    ],
    "similarities": [],
    "notes": "",
    "id": 106,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0091-steam-cloudflare-phishing-monitor.json-1758172969621",
    "fileName": "0091-steam-cloudflare-phishing-monitor.json",
    "flowName": "Steam + CF Report",
    "mainArea": "Seguridad",
    "secondaryAreas": [
      "IT",
      "Operaciones"
    ],
    "mainFunction": "Detectar y reportar sitios web de phishing de Steam a Cloudflare (si usan sus servicios) y a Valve (Steam).",
    "automationDestinations": [
      "Mailgun",
      "Cloudflare",
      "Valve/Steam"
    ],
    "dataOrigins": [
      "Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "IF",
      "Execute Command",
      "Mailgun"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo recibe un dominio vía webhook, verifica si es un dominio válido y si usa Cloudflare, y luego envía reportes de phishing a Cloudflare y a Steam según corresponda.",
    "useCaseExamples": [
      "Un analista de seguridad que monitorea foros y listas negras de dominios maliciosos puede usar este flujo para reportar automáticamente cualquier URL identificada como un posible sitio de phishing de Steam tan pronto como la detecta.",
      "Un equipo de respuesta a incidentes que recibe numerosos reportes de usuarios sobre sitios web de phishing de Steam puede automatizar el proceso de verificación y notificación a Valve (Steam) y Cloudflare enviando las URLs sospechosas a este webhook.",
      "Un investigador de ciberseguridad que compila bases de datos de amenazas puede integrar este flujo en su sistema para que, al encontrar un nuevo dominio de phishing de Steam, se genere un informe automático a las partes relevantes sin intervención manual.",
      "Un desarrollador de una herramienta de inteligencia de amenazas puede configurar su software para que, al identificar un dominio que imita a Steam y tiene características de phishing, envíe la URL a este flujo de trabajo, automatizando el envío de alertas a los proveedores de servicios.",
      "Una plataforma de monitoreo de marca puede utilizar este flujo para proteger a sus clientes (como Valve) contra el abuso de marca. Al detectar un dominio que suplanta a Steam con fines de phishing, el sistema puede invocar este webhook para iniciar el proceso de notificación y mitigación de forma proactiva."
    ],
    "similarities": [],
    "notes": "",
    "id": 107,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0092-segment-track-event.json-1758172983409",
    "fileName": "0092-segment-track-event.json",
    "flowName": "Track an event in Segment",
    "mainArea": "Marketing",
    "secondaryAreas": [
      "Análisis de Datos",
      "Producto"
    ],
    "mainFunction": "Registrar o rastrear un evento de usuario o sistema en Segment para análisis posterior.",
    "automationDestinations": [
      "Segment"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "manualTrigger",
      "Segment"
    ],
    "complexity": "Simple",
    "shortDescription": "Un flujo simple para enviar datos de eventos a Segment de forma manual.",
    "useCaseExamples": [
      "Cuando un administrador marca manualmente la finalización de un proceso de incorporación de usuario en un sistema interno, registrándolo en Segment.",
      "Al cerrar manualmente un acuerdo de venta importante por un representante de ventas, se envía un evento 'Deal Closed' a Segment para el seguimiento de métricas.",
      "Cuando un gestor de contenido publica manualmente un nuevo artículo en el blog y necesita registrar ese evento en Segment para análisis de rendimiento.",
      "Al resolver manualmente un problema complejo de soporte al cliente, un agente registra el evento 'Problema Resuelto' en Segment para seguimiento de tickets.",
      "Cuando un equipo de marketing lanza una campaña especial sin una integración directa, se activa manualmente un evento 'Campaña Lanzada' en Segment."
    ],
    "similarities": [],
    "notes": "",
    "id": 108,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0093-pokemon-rate-limiter.json-1758173001052",
    "fileName": "0093-pokemon-rate-limiter.json",
    "flowName": "API Rate Limiter con Airtable",
    "mainArea": "Gestión de APIs",
    "secondaryAreas": [
      "Operaciones de TI",
      "Desarrollo de Software",
      "Seguridad"
    ],
    "mainFunction": "Implementa un sistema de limitación de tasa (rate limiting) por minuto y por hora para una API. Si la solicitud está dentro de los límites, consulta y formatea datos de Airtable para devolverlos.",
    "automationDestinations": [
      "Cliente API"
    ],
    "dataOrigins": [
      "Webhook"
    ],
    "keyNodes": [
      "Webhook",
      "Redis",
      "IF",
      "Airtable",
      "Function"
    ],
    "complexity": "Complejo",
    "shortDescription": "Controla el acceso a una API mediante límites de uso por minuto y hora, y recupera datos de Airtable para las solicitudes válidas.",
    "useCaseExamples": [
      "Un proveedor de API externa implementa límites de tasa por clave de API para proteger sus servicios y garantizar un uso justo. Este flujo verifica la clave de API entrante, incrementa los contadores de uso en Redis por minuto y por hora, y solo recupera datos de productos (simulados por \"Pokemon\" en Airtable) si el usuario no ha excedido su cuota.",
      "Una empresa que ofrece acceso a datos especializados (por ejemplo, información de mercado, catálogos de productos) a través de una API. El flujo gestiona y aplica estrictos límites de tasa de consulta para cada suscriptor (usando su clave de API), asegurando que los recursos del servidor no se saturen y cobrando quizás por niveles de acceso basados en estas cuotas.",
      "Un desarrollador construye una pasarela para microservicios internos donde diferentes equipos o aplicaciones (cada uno con una clave de API) acceden a datos compartidos (como configuraciones o activos). El flujo de trabajo impone límites de tasa para evitar que una aplicación sobrecargue el servicio de datos compartidos, sirviendo datos desde Airtable o denegando la solicitud si se exceden los límites.",
      "Una plataforma de medios que ofrece un API para acceder a su contenido (artículos, imágenes). Utiliza este flujo para controlar la cantidad de peticiones que un socio o desarrollador puede hacer en un período determinado (minuto/hora) con su clave de API, devolviendo un mensaje de error cuando los límites son superados, y el contenido (metadatos de \"Pokemon\") cuando no.",
      "Un sistema de gestión de recursos que proporciona una API para consultar el estado de equipos o reservas. Cada consulta se valida con una clave de API. El flujo utiliza Redis para monitorear las consultas por clave de API en intervalos de un minuto y una hora, permitiendo la recuperación de datos (de un Airtable simulado) solo si la cuota de peticiones no ha sido excedida por el usuario."
    ],
    "similarities": [],
    "notes": "",
    "id": 109,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0094-zendesk-ticket-flow.json-1758173016265",
    "fileName": "0094-zendesk-ticket-flow.json",
    "flowName": "Create a ticket in Zendesk",
    "mainArea": "Soporte al Cliente",
    "secondaryAreas": [
      "TI",
      "Gestión de Proyectos",
      "Ventas"
    ],
    "mainFunction": "Crear un ticket nuevo en Zendesk.",
    "automationDestinations": [
      "Zendesk"
    ],
    "dataOrigins": [
      "Manual Trigger"
    ],
    "keyNodes": [
      "On clicking 'execute'",
      "Zendesk"
    ],
    "complexity": "Simple",
    "shortDescription": "Este flujo crea un ticket en Zendesk al ser ejecutado manualmente.",
    "useCaseExamples": [
      "Reporte manual de incidentes de TI: Un técnico de soporte de TI recibe una llamada telefónica sobre un problema de software y necesita crear rápidamente un ticket en Zendesk para registrarlo y asignarlo.",
      "Registro de consultas de clientes complejas: Un agente de servicio al cliente completa una conversación telefónica larga con un cliente y necesita documentar manualmente los detalles y el problema en un nuevo ticket de Zendesk para su seguimiento.",
      "Creación de tickets para seguimiento de ventas: Un representante de ventas identifica un problema potencial o una solicitud de soporte durante una llamada de ventas y crea un ticket manualmente para que el equipo de soporte al cliente se ponga en contacto con el prospecto.",
      "Notificación de errores internos por empleados: Un empleado interno descubre un error en un sistema interno y utiliza este flujo de trabajo para generar manualmente un ticket en Zendesk para que el equipo de desarrollo lo investigue.",
      "Documentación de problemas de QA: Un probador de control de calidad encuentra un defecto durante las pruebas manuales de un producto y necesita generar rápidamente un ticket en Zendesk para que el equipo de desarrollo lo aborde."
    ],
    "similarities": [],
    "notes": "",
    "id": 110,
    "isFavorite": false
  },
  {
    "workflow_uuid": "0095-sequential-http-post.json-1758173031350",
    "fileName": "0095-sequential-http-post.json",
    "flowName": "Procesamiento de Datos de Cliente y Envío a API",
    "mainArea": "Gestión de Datos",
    "secondaryAreas": [
      "Ventas",
      "Marketing",
      "Integración de Sistemas"
    ],
    "mainFunction": "Recuperar datos de un almacén de clientes, procesarlos por lotes y enviarlos a un sistema externo a través de una petición HTTP.",
    "automationDestinations": [
      "Sistema Externo (via HTTP API)"
    ],
    "dataOrigins": [
      "Disparador Manual",
      "Customer Datastore"
    ],
    "keyNodes": [
      "Customer Datastore",
      "SplitInBatches",
      "HTTP Request",
      "Wait"
    ],
    "complexity": "Medio",
    "shortDescription": "Este flujo recupera datos de clientes, los divide en lotes y los envía a una API externa, con una pausa entre envíos.",
    "useCaseExamples": [
      "Sincronizar perfiles de clientes desde una base de datos interna a una plataforma de email marketing, enviando los datos uno por uno para evitar exceder los límites de tasa de la API.",
      "Registrar nuevos usuarios de una aplicación en un sistema de soporte al cliente externo, procesando cada registro individualmente con un retardo para gestionar la carga de la API.",
      "Enviar detalles de empleados (ID y nombre) desde el sistema de RRHH a una herramienta de gestión de proyectos de terceros, asegurando que cada creación de usuario tenga una pausa entre sí.",
      "Actualizar una lista de contactos en un CRM (Customer Relationship Management) basado en los datos de una base de datos de clientes, enviando cada contacto de forma secuencial para una sincronización controlada.",
      "Publicar entradas en un registro de auditoría o sistema de monitoreo, donde cada \"persona\" de una base de datos se registra como un evento individual con su ID y nombre, con un retraso para no sobrecargar el sistema de logs."
    ],
    "similarities": [],
    "notes": "",
    "id": 111,
    "isFavorite": false
  }
]